{"[PAD]": 0, "[UNK]": 1, "[CLS]": 2, "[SEP]": 3, "[MSK]": 4, "AAAA": 5, "AAAG": 6, "AAAT": 7, "AAAC": 8, "AAAN": 9, "AAGA": 10, "AAGG": 11, "AAGT": 12, "AAGC": 13, "AAGN": 14, "AATA": 15, "AATG": 16, "AATT": 17, "AATC": 18, "AATN": 19, "AACA": 20, "AACG": 21, "AACT": 22, "AACC": 23, "AACN": 24, "AANA": 25, "AANG": 26, "AANT": 27, "AANC": 28, "AANN": 29, "AGAA": 30, "AGAG": 31, "AGAT": 32, "AGAC": 33, "AGAN": 34, "AGGA": 35, "AGGG": 36, "AGGT": 37, "AGGC": 38, "AGGN": 39, "AGTA": 40, "AGTG": 41, "AGTT": 42, "AGTC": 43, "AGTN": 44, "AGCA": 45, "AGCG": 46, "AGCT": 47, "AGCC": 48, "AGCN": 49, "AGNA": 50, "AGNG": 51, "AGNT": 52, "AGNC": 53, "AGNN": 54, "ATAA": 55, "ATAG": 56, "ATAT": 57, "ATAC": 58, "ATAN": 59, "ATGA": 60, "ATGG": 61, "ATGT": 62, "ATGC": 63, "ATGN": 64, "ATTA": 65, "ATTG": 66, "ATTT": 67, "ATTC": 68, "ATTN": 69, "ATCA": 70, "ATCG": 71, "ATCT": 72, "ATCC": 73, "ATCN": 74, "ATNA": 75, "ATNG": 76, "ATNT": 77, "ATNC": 78, "ATNN": 79, "ACAA": 80, "ACAG": 81, "ACAT": 82, "ACAC": 83, "ACAN": 84, "ACGA": 85, "ACGG": 86, "ACGT": 87, "ACGC": 88, "ACGN": 89, "ACTA": 90, "ACTG": 91, "ACTT": 92, "ACTC": 93, "ACTN": 94, "ACCA": 95, "ACCG": 96, "ACCT": 97, "ACCC": 98, "ACCN": 99, "ACNA": 100, "ACNG": 101, "ACNT": 102, "ACNC": 103, "ACNN": 104, "ANAA": 105, "ANAG": 106, "ANAT": 107, "ANAC": 108, "ANAN": 109, "ANGA": 110, "ANGG": 111, "ANGT": 112, "ANGC": 113, "ANGN": 114, "ANTA": 115, "ANTG": 116, "ANTT": 117, "ANTC": 118, "ANTN": 119, "ANCA": 120, "ANCG": 121, "ANCT": 122, "ANCC": 123, "ANCN": 124, "ANNA": 125, "ANNG": 126, "ANNT": 127, "ANNC": 128, "ANNN": 129, "GAAA": 130, "GAAG": 131, "GAAT": 132, "GAAC": 133, "GAAN": 134, "GAGA": 135, "GAGG": 136, "GAGT": 137, "GAGC": 138, "GAGN": 139, "GATA": 140, "GATG": 141, "GATT": 142, "GATC": 143, "GATN": 144, "GACA": 145, "GACG": 146, "GACT": 147, "GACC": 148, "GACN": 149, "GANA": 150, "GANG": 151, "GANT": 152, "GANC": 153, "GANN": 154, "GGAA": 155, "GGAG": 156, "GGAT": 157, "GGAC": 158, "GGAN": 159, "GGGA": 160, "GGGG": 161, "GGGT": 162, "GGGC": 163, "GGGN": 164, "GGTA": 165, "GGTG": 166, "GGTT": 167, "GGTC": 168, "GGTN": 169, "GGCA": 170, "GGCG": 171, "GGCT": 172, "GGCC": 173, "GGCN": 174, "GGNA": 175, "GGNG": 176, "GGNT": 177, "GGNC": 178, "GGNN": 179, "GTAA": 180, "GTAG": 181, "GTAT": 182, "GTAC": 183, "GTAN": 184, "GTGA": 185, "GTGG": 186, "GTGT": 187, "GTGC": 188, "GTGN": 189, "GTTA": 190, "GTTG": 191, "GTTT": 192, "GTTC": 193, "GTTN": 194, "GTCA": 195, "GTCG": 196, "GTCT": 197, "GTCC": 198, "GTCN": 199, "GTNA": 200, "GTNG": 201, "GTNT": 202, "GTNC": 203, "GTNN": 204, "GCAA": 205, "GCAG": 206, "GCAT": 207, "GCAC": 208, "GCAN": 209, "GCGA": 210, "GCGG": 211, "GCGT": 212, "GCGC": 213, "GCGN": 214, "GCTA": 215, "GCTG": 216, "GCTT": 217, "GCTC": 218, "GCTN": 219, "GCCA": 220, "GCCG": 221, "GCCT": 222, "GCCC": 223, "GCCN": 224, "GCNA": 225, "GCNG": 226, "GCNT": 227, "GCNC": 228, "GCNN": 229, "GNAA": 230, "GNAG": 231, "GNAT": 232, "GNAC": 233, "GNAN": 234, "GNGA": 235, "GNGG": 236, "GNGT": 237, "GNGC": 238, "GNGN": 239, "GNTA": 240, "GNTG": 241, "GNTT": 242, "GNTC": 243, "GNTN": 244, "GNCA": 245, "GNCG": 246, "GNCT": 247, "GNCC": 248, "GNCN": 249, "GNNA": 250, "GNNG": 251, "GNNT": 252, "GNNC": 253, "GNNN": 254, "TAAA": 255, "TAAG": 256, "TAAT": 257, "TAAC": 258, "TAAN": 259, "TAGA": 260, "TAGG": 261, "TAGT": 262, "TAGC": 263, "TAGN": 264, "TATA": 265, "TATG": 266, "TATT": 267, "TATC": 268, "TATN": 269, "TACA": 270, "TACG": 271, "TACT": 272, "TACC": 273, "TACN": 274, "TANA": 275, "TANG": 276, "TANT": 277, "TANC": 278, "TANN": 279, "TGAA": 280, "TGAG": 281, "TGAT": 282, "TGAC": 283, "TGAN": 284, "TGGA": 285, "TGGG": 286, "TGGT": 287, "TGGC": 288, "TGGN": 289, "TGTA": 290, "TGTG": 291, "TGTT": 292, "TGTC": 293, "TGTN": 294, "TGCA": 295, "TGCG": 296, "TGCT": 297, "TGCC": 298, "TGCN": 299, "TGNA": 300, "TGNG": 301, "TGNT": 302, "TGNC": 303, "TGNN": 304, "TTAA": 305, "TTAG": 306, "TTAT": 307, "TTAC": 308, "TTAN": 309, "TTGA": 310, "TTGG": 311, "TTGT": 312, "TTGC": 313, "TTGN": 314, "TTTA": 315, "TTTG": 316, "TTTT": 317, "TTTC": 318, "TTTN": 319, "TTCA": 320, "TTCG": 321, "TTCT": 322, "TTCC": 323, "TTCN": 324, "TTNA": 325, "TTNG": 326, "TTNT": 327, "TTNC": 328, "TTNN": 329, "TCAA": 330, "TCAG": 331, "TCAT": 332, "TCAC": 333, "TCAN": 334, "TCGA": 335, "TCGG": 336, "TCGT": 337, "TCGC": 338, "TCGN": 339, "TCTA": 340, "TCTG": 341, "TCTT": 342, "TCTC": 343, "TCTN": 344, "TCCA": 345, "TCCG": 346, "TCCT": 347, "TCCC": 348, "TCCN": 349, "TCNA": 350, "TCNG": 351, "TCNT": 352, "TCNC": 353, "TCNN": 354, "TNAA": 355, "TNAG": 356, "TNAT": 357, "TNAC": 358, "TNAN": 359, "TNGA": 360, "TNGG": 361, "TNGT": 362, "TNGC": 363, "TNGN": 364, "TNTA": 365, "TNTG": 366, "TNTT": 367, "TNTC": 368, "TNTN": 369, "TNCA": 370, "TNCG": 371, "TNCT": 372, "TNCC": 373, "TNCN": 374, "TNNA": 375, "TNNG": 376, "TNNT": 377, "TNNC": 378, "TNNN": 379, "CAAA": 380, "CAAG": 381, "CAAT": 382, "CAAC": 383, "CAAN": 384, "CAGA": 385, "CAGG": 386, "CAGT": 387, "CAGC": 388, "CAGN": 389, "CATA": 390, "CATG": 391, "CATT": 392, "CATC": 393, "CATN": 394, "CACA": 395, "CACG": 396, "CACT": 397, "CACC": 398, "CACN": 399, "CANA": 400, "CANG": 401, "CANT": 402, "CANC": 403, "CANN": 404, "CGAA": 405, "CGAG": 406, "CGAT": 407, "CGAC": 408, "CGAN": 409, "CGGA": 410, "CGGG": 411, "CGGT": 412, "CGGC": 413, "CGGN": 414, "CGTA": 415, "CGTG": 416, "CGTT": 417, "CGTC": 418, "CGTN": 419, "CGCA": 420, "CGCG": 421, "CGCT": 422, "CGCC": 423, "CGCN": 424, "CGNA": 425, "CGNG": 426, "CGNT": 427, "CGNC": 428, "CGNN": 429, "CTAA": 430, "CTAG": 431, "CTAT": 432, "CTAC": 433, "CTAN": 434, "CTGA": 435, "CTGG": 436, "CTGT": 437, "CTGC": 438, "CTGN": 439, "CTTA": 440, "CTTG": 441, "CTTT": 442, "CTTC": 443, "CTTN": 444, "CTCA": 445, "CTCG": 446, "CTCT": 447, "CTCC": 448, "CTCN": 449, "CTNA": 450, "CTNG": 451, "CTNT": 452, "CTNC": 453, "CTNN": 454, "CCAA": 455, "CCAG": 456, "CCAT": 457, "CCAC": 458, "CCAN": 459, "CCGA": 460, "CCGG": 461, "CCGT": 462, "CCGC": 463, "CCGN": 464, "CCTA": 465, "CCTG": 466, "CCTT": 467, "CCTC": 468, "CCTN": 469, "CCCA": 470, "CCCG": 471, "CCCT": 472, "CCCC": 473, "CCCN": 474, "CCNA": 475, "CCNG": 476, "CCNT": 477, "CCNC": 478, "CCNN": 479, "CNAA": 480, "CNAG": 481, "CNAT": 482, "CNAC": 483, "CNAN": 484, "CNGA": 485, "CNGG": 486, "CNGT": 487, "CNGC": 488, "CNGN": 489, "CNTA": 490, "CNTG": 491, "CNTT": 492, "CNTC": 493, "CNTN": 494, "CNCA": 495, "CNCG": 496, "CNCT": 497, "CNCC": 498, "CNCN": 499, "CNNA": 500, "CNNG": 501, "CNNT": 502, "CNNC": 503, "CNNN": 504, "NAAA": 505, "NAAG": 506, "NAAT": 507, "NAAC": 508, "NAAN": 509, "NAGA": 510, "NAGG": 511, "NAGT": 512, "NAGC": 513, "NAGN": 514, "NATA": 515, "NATG": 516, "NATT": 517, "NATC": 518, "NATN": 519, "NACA": 520, "NACG": 521, "NACT": 522, "NACC": 523, "NACN": 524, "NANA": 525, "NANG": 526, "NANT": 527, "NANC": 528, "NANN": 529, "NGAA": 530, "NGAG": 531, "NGAT": 532, "NGAC": 533, "NGAN": 534, "NGGA": 535, "NGGG": 536, "NGGT": 537, "NGGC": 538, "NGGN": 539, "NGTA": 540, "NGTG": 541, "NGTT": 542, "NGTC": 543, "NGTN": 544, "NGCA": 545, "NGCG": 546, "NGCT": 547, "NGCC": 548, "NGCN": 549, "NGNA": 550, "NGNG": 551, "NGNT": 552, "NGNC": 553, "NGNN": 554, "NTAA": 555, "NTAG": 556, "NTAT": 557, "NTAC": 558, "NTAN": 559, "NTGA": 560, "NTGG": 561, "NTGT": 562, "NTGC": 563, "NTGN": 564, "NTTA": 565, "NTTG": 566, "NTTT": 567, "NTTC": 568, "NTTN": 569, "NTCA": 570, "NTCG": 571, "NTCT": 572, "NTCC": 573, "NTCN": 574, "NTNA": 575, "NTNG": 576, "NTNT": 577, "NTNC": 578, "NTNN": 579, "NCAA": 580, "NCAG": 581, "NCAT": 582, "NCAC": 583, "NCAN": 584, "NCGA": 585, "NCGG": 586, "NCGT": 587, "NCGC": 588, "NCGN": 589, "NCTA": 590, "NCTG": 591, "NCTT": 592, "NCTC": 593, "NCTN": 594, "NCCA": 595, "NCCG": 596, "NCCT": 597, "NCCC": 598, "NCCN": 599, "NCNA": 600, "NCNG": 601, "NCNT": 602, "NCNC": 603, "NCNN": 604, "NNAA": 605, "NNAG": 606, "NNAT": 607, "NNAC": 608, "NNAN": 609, "NNGA": 610, "NNGG": 611, "NNGT": 612, "NNGC": 613, "NNGN": 614, "NNTA": 615, "NNTG": 616, "NNTT": 617, "NNTC": 618, "NNTN": 619, "NNCA": 620, "NNCG": 621, "NNCT": 622, "NNCC": 623, "NNCN": 624, "NNNA": 625, "NNNG": 626, "NNNT": 627, "NNNC": 628, "NNNN": 629}
