[PAD]
[UNK]
[CLS]
[SEP]
[MSK]
AAAA
AAAG
AAAT
AAAC
AAAN
AAGA
AAGG
AAGT
AAGC
AAGN
AATA
AATG
AATT
AATC
AATN
AACA
AACG
AACT
AACC
AACN
AANA
AANG
AANT
AANC
AANN
AGAA
AGAG
AGAT
AGAC
AGAN
AGGA
AGGG
AGGT
AGGC
AGGN
AGTA
AGTG
AGTT
AGTC
AGTN
AGCA
AGCG
AGCT
AGCC
AGCN
AGNA
AGNG
AGNT
AGNC
AGNN
ATAA
ATAG
ATAT
ATAC
ATAN
ATGA
ATGG
ATGT
ATGC
ATGN
ATTA
ATTG
ATTT
ATTC
ATTN
ATCA
ATCG
ATCT
ATCC
ATCN
ATNA
ATNG
ATNT
ATNC
ATNN
ACAA
ACAG
ACAT
ACAC
ACAN
ACGA
ACGG
ACGT
ACGC
ACGN
ACTA
ACTG
ACTT
ACTC
ACTN
ACCA
ACCG
ACCT
ACCC
ACCN
ACNA
ACNG
ACNT
ACNC
ACNN
ANAA
ANAG
ANAT
ANAC
ANAN
ANGA
ANGG
ANGT
ANGC
ANGN
ANTA
ANTG
ANTT
ANTC
ANTN
ANCA
ANCG
ANCT
ANCC
ANCN
ANNA
ANNG
ANNT
ANNC
ANNN
GAAA
GAAG
GAAT
GAAC
GAAN
GAGA
GAGG
GAGT
GAGC
GAGN
GATA
GATG
GATT
GATC
GATN
GACA
GACG
GACT
GACC
GACN
GANA
GANG
GANT
GANC
GANN
GGAA
GGAG
GGAT
GGAC
GGAN
GGGA
GGGG
GGGT
GGGC
GGGN
GGTA
GGTG
GGTT
GGTC
GGTN
GGCA
GGCG
GGCT
GGCC
GGCN
GGNA
GGNG
GGNT
GGNC
GGNN
GTAA
GTAG
GTAT
GTAC
GTAN
GTGA
GTGG
GTGT
GTGC
GTGN
GTTA
GTTG
GTTT
GTTC
GTTN
GTCA
GTCG
GTCT
GTCC
GTCN
GTNA
GTNG
GTNT
GTNC
GTNN
GCAA
GCAG
GCAT
GCAC
GCAN
GCGA
GCGG
GCGT
GCGC
GCGN
GCTA
GCTG
GCTT
GCTC
GCTN
GCCA
GCCG
GCCT
GCCC
GCCN
GCNA
GCNG
GCNT
GCNC
GCNN
GNAA
GNAG
GNAT
GNAC
GNAN
GNGA
GNGG
GNGT
GNGC
GNGN
GNTA
GNTG
GNTT
GNTC
GNTN
GNCA
GNCG
GNCT
GNCC
GNCN
GNNA
GNNG
GNNT
GNNC
GNNN
TAAA
TAAG
TAAT
TAAC
TAAN
TAGA
TAGG
TAGT
TAGC
TAGN
TATA
TATG
TATT
TATC
TATN
TACA
TACG
TACT
TACC
TACN
TANA
TANG
TANT
TANC
TANN
TGAA
TGAG
TGAT
TGAC
TGAN
TGGA
TGGG
TGGT
TGGC
TGGN
TGTA
TGTG
TGTT
TGTC
TGTN
TGCA
TGCG
TGCT
TGCC
TGCN
TGNA
TGNG
TGNT
TGNC
TGNN
TTAA
TTAG
TTAT
TTAC
TTAN
TTGA
TTGG
TTGT
TTGC
TTGN
TTTA
TTTG
TTTT
TTTC
TTTN
TTCA
TTCG
TTCT
TTCC
TTCN
TTNA
TTNG
TTNT
TTNC
TTNN
TCAA
TCAG
TCAT
TCAC
TCAN
TCGA
TCGG
TCGT
TCGC
TCGN
TCTA
TCTG
TCTT
TCTC
TCTN
TCCA
TCCG
TCCT
TCCC
TCCN
TCNA
TCNG
TCNT
TCNC
TCNN
TNAA
TNAG
TNAT
TNAC
TNAN
TNGA
TNGG
TNGT
TNGC
TNGN
TNTA
TNTG
TNTT
TNTC
TNTN
TNCA
TNCG
TNCT
TNCC
TNCN
TNNA
TNNG
TNNT
TNNC
TNNN
CAAA
CAAG
CAAT
CAAC
CAAN
CAGA
CAGG
CAGT
CAGC
CAGN
CATA
CATG
CATT
CATC
CATN
CACA
CACG
CACT
CACC
CACN
CANA
CANG
CANT
CANC
CANN
CGAA
CGAG
CGAT
CGAC
CGAN
CGGA
CGGG
CGGT
CGGC
CGGN
CGTA
CGTG
CGTT
CGTC
CGTN
CGCA
CGCG
CGCT
CGCC
CGCN
CGNA
CGNG
CGNT
CGNC
CGNN
CTAA
CTAG
CTAT
CTAC
CTAN
CTGA
CTGG
CTGT
CTGC
CTGN
CTTA
CTTG
CTTT
CTTC
CTTN
CTCA
CTCG
CTCT
CTCC
CTCN
CTNA
CTNG
CTNT
CTNC
CTNN
CCAA
CCAG
CCAT
CCAC
CCAN
CCGA
CCGG
CCGT
CCGC
CCGN
CCTA
CCTG
CCTT
CCTC
CCTN
CCCA
CCCG
CCCT
CCCC
CCCN
CCNA
CCNG
CCNT
CCNC
CCNN
CNAA
CNAG
CNAT
CNAC
CNAN
CNGA
CNGG
CNGT
CNGC
CNGN
CNTA
CNTG
CNTT
CNTC
CNTN
CNCA
CNCG
CNCT
CNCC
CNCN
CNNA
CNNG
CNNT
CNNC
CNNN
NAAA
NAAG
NAAT
NAAC
NAAN
NAGA
NAGG
NAGT
NAGC
NAGN
NATA
NATG
NATT
NATC
NATN
NACA
NACG
NACT
NACC
NACN
NANA
NANG
NANT
NANC
NANN
NGAA
NGAG
NGAT
NGAC
NGAN
NGGA
NGGG
NGGT
NGGC
NGGN
NGTA
NGTG
NGTT
NGTC
NGTN
NGCA
NGCG
NGCT
NGCC
NGCN
NGNA
NGNG
NGNT
NGNC
NGNN
NTAA
NTAG
NTAT
NTAC
NTAN
NTGA
NTGG
NTGT
NTGC
NTGN
NTTA
NTTG
NTTT
NTTC
NTTN
NTCA
NTCG
NTCT
NTCC
NTCN
NTNA
NTNG
NTNT
NTNC
NTNN
NCAA
NCAG
NCAT
NCAC
NCAN
NCGA
NCGG
NCGT
NCGC
NCGN
NCTA
NCTG
NCTT
NCTC
NCTN
NCCA
NCCG
NCCT
NCCC
NCCN
NCNA
NCNG
NCNT
NCNC
NCNN
NNAA
NNAG
NNAT
NNAC
NNAN
NNGA
NNGG
NNGT
NNGC
NNGN
NNTA
NNTG
NNTT
NNTC
NNTN
NNCA
NNCG
NNCT
NNCC
NNCN
NNNA
NNNG
NNNT
NNNC
NNNN