{"[PAD]" : 0, "[UNK]" : 1, "[CLS]" : 2, "[SEP]" : 3, "[MSK]" : 4, "AAAAA":5, "AAAAG":6, "AAAAT":7, "AAAAC":8, "AAAAN":9, "AAAGA":10, "AAAGG":11, "AAAGT":12, "AAAGC":13, "AAAGN":14, "AAATA":15, "AAATG":16, "AAATT":17, "AAATC":18, "AAATN":19, "AAACA":20, "AAACG":21, "AAACT":22, "AAACC":23, "AAACN":24, "AAANA":25, "AAANG":26, "AAANT":27, "AAANC":28, "AAANN":29, "AAGAA":30, "AAGAG":31, "AAGAT":32, "AAGAC":33, "AAGAN":34, "AAGGA":35, "AAGGG":36, "AAGGT":37, "AAGGC":38, "AAGGN":39, "AAGTA":40, "AAGTG":41, "AAGTT":42, "AAGTC":43, "AAGTN":44, "AAGCA":45, "AAGCG":46, "AAGCT":47, "AAGCC":48, "AAGCN":49, "AAGNA":50, "AAGNG":51, "AAGNT":52, "AAGNC":53, "AAGNN":54, "AATAA":55, "AATAG":56, "AATAT":57, "AATAC":58, "AATAN":59, "AATGA":60, "AATGG":61, "AATGT":62, "AATGC":63, "AATGN":64, "AATTA":65, "AATTG":66, "AATTT":67, "AATTC":68, "AATTN":69, "AATCA":70, "AATCG":71, "AATCT":72, "AATCC":73, "AATCN":74, "AATNA":75, "AATNG":76, "AATNT":77, "AATNC":78, "AATNN":79, "AACAA":80, "AACAG":81, "AACAT":82, "AACAC":83, "AACAN":84, "AACGA":85, "AACGG":86, "AACGT":87, "AACGC":88, "AACGN":89, "AACTA":90, "AACTG":91, "AACTT":92, "AACTC":93, "AACTN":94, "AACCA":95, "AACCG":96, "AACCT":97, "AACCC":98, "AACCN":99, "AACNA":100, "AACNG":101, "AACNT":102, "AACNC":103, "AACNN":104, "AANAA":105, "AANAG":106, "AANAT":107, "AANAC":108, "AANAN":109, "AANGA":110, "AANGG":111, "AANGT":112, "AANGC":113, "AANGN":114, "AANTA":115, "AANTG":116, "AANTT":117, "AANTC":118, "AANTN":119, "AANCA":120, "AANCG":121, "AANCT":122, "AANCC":123, "AANCN":124, "AANNA":125, "AANNG":126, "AANNT":127, "AANNC":128, "AANNN":129, "AGAAA":130, "AGAAG":131, "AGAAT":132, "AGAAC":133, "AGAAN":134, "AGAGA":135, "AGAGG":136, "AGAGT":137, "AGAGC":138, "AGAGN":139, "AGATA":140, "AGATG":141, "AGATT":142, "AGATC":143, "AGATN":144, "AGACA":145, "AGACG":146, "AGACT":147, "AGACC":148, "AGACN":149, "AGANA":150, "AGANG":151, "AGANT":152, "AGANC":153, "AGANN":154, "AGGAA":155, "AGGAG":156, "AGGAT":157, "AGGAC":158, "AGGAN":159, "AGGGA":160, "AGGGG":161, "AGGGT":162, "AGGGC":163, "AGGGN":164, "AGGTA":165, "AGGTG":166, "AGGTT":167, "AGGTC":168, "AGGTN":169, "AGGCA":170, "AGGCG":171, "AGGCT":172, "AGGCC":173, "AGGCN":174, "AGGNA":175, "AGGNG":176, "AGGNT":177, "AGGNC":178, "AGGNN":179, "AGTAA":180, "AGTAG":181, "AGTAT":182, "AGTAC":183, "AGTAN":184, "AGTGA":185, "AGTGG":186, "AGTGT":187, "AGTGC":188, "AGTGN":189, "AGTTA":190, "AGTTG":191, "AGTTT":192, "AGTTC":193, "AGTTN":194, "AGTCA":195, "AGTCG":196, "AGTCT":197, "AGTCC":198, "AGTCN":199, "AGTNA":200, "AGTNG":201, "AGTNT":202, "AGTNC":203, "AGTNN":204, "AGCAA":205, "AGCAG":206, "AGCAT":207, "AGCAC":208, "AGCAN":209, "AGCGA":210, "AGCGG":211, "AGCGT":212, "AGCGC":213, "AGCGN":214, "AGCTA":215, "AGCTG":216, "AGCTT":217, "AGCTC":218, "AGCTN":219, "AGCCA":220, "AGCCG":221, "AGCCT":222, "AGCCC":223, "AGCCN":224, "AGCNA":225, "AGCNG":226, "AGCNT":227, "AGCNC":228, "AGCNN":229, "AGNAA":230, "AGNAG":231, "AGNAT":232, "AGNAC":233, "AGNAN":234, "AGNGA":235, "AGNGG":236, "AGNGT":237, "AGNGC":238, "AGNGN":239, "AGNTA":240, "AGNTG":241, "AGNTT":242, "AGNTC":243, "AGNTN":244, "AGNCA":245, "AGNCG":246, "AGNCT":247, "AGNCC":248, "AGNCN":249, "AGNNA":250, "AGNNG":251, "AGNNT":252, "AGNNC":253, "AGNNN":254, "ATAAA":255, "ATAAG":256, "ATAAT":257, "ATAAC":258, "ATAAN":259, "ATAGA":260, "ATAGG":261, "ATAGT":262, "ATAGC":263, "ATAGN":264, "ATATA":265, "ATATG":266, "ATATT":267, "ATATC":268, "ATATN":269, "ATACA":270, "ATACG":271, "ATACT":272, "ATACC":273, "ATACN":274, "ATANA":275, "ATANG":276, "ATANT":277, "ATANC":278, "ATANN":279, "ATGAA":280, "ATGAG":281, "ATGAT":282, "ATGAC":283, "ATGAN":284, "ATGGA":285, "ATGGG":286, "ATGGT":287, "ATGGC":288, "ATGGN":289, "ATGTA":290, "ATGTG":291, "ATGTT":292, "ATGTC":293, "ATGTN":294, "ATGCA":295, "ATGCG":296, "ATGCT":297, "ATGCC":298, "ATGCN":299, "ATGNA":300, "ATGNG":301, "ATGNT":302, "ATGNC":303, "ATGNN":304, "ATTAA":305, "ATTAG":306, "ATTAT":307, "ATTAC":308, "ATTAN":309, "ATTGA":310, "ATTGG":311, "ATTGT":312, "ATTGC":313, "ATTGN":314, "ATTTA":315, "ATTTG":316, "ATTTT":317, "ATTTC":318, "ATTTN":319, "ATTCA":320, "ATTCG":321, "ATTCT":322, "ATTCC":323, "ATTCN":324, "ATTNA":325, "ATTNG":326, "ATTNT":327, "ATTNC":328, "ATTNN":329, "ATCAA":330, "ATCAG":331, "ATCAT":332, "ATCAC":333, "ATCAN":334, "ATCGA":335, "ATCGG":336, "ATCGT":337, "ATCGC":338, "ATCGN":339, "ATCTA":340, "ATCTG":341, "ATCTT":342, "ATCTC":343, "ATCTN":344, "ATCCA":345, "ATCCG":346, "ATCCT":347, "ATCCC":348, "ATCCN":349, "ATCNA":350, "ATCNG":351, "ATCNT":352, "ATCNC":353, "ATCNN":354, "ATNAA":355, "ATNAG":356, "ATNAT":357, "ATNAC":358, "ATNAN":359, "ATNGA":360, "ATNGG":361, "ATNGT":362, "ATNGC":363, "ATNGN":364, "ATNTA":365, "ATNTG":366, "ATNTT":367, "ATNTC":368, "ATNTN":369, "ATNCA":370, "ATNCG":371, "ATNCT":372, "ATNCC":373, "ATNCN":374, "ATNNA":375, "ATNNG":376, "ATNNT":377, "ATNNC":378, "ATNNN":379, "ACAAA":380, "ACAAG":381, "ACAAT":382, "ACAAC":383, "ACAAN":384, "ACAGA":385, "ACAGG":386, "ACAGT":387, "ACAGC":388, "ACAGN":389, "ACATA":390, "ACATG":391, "ACATT":392, "ACATC":393, "ACATN":394, "ACACA":395, "ACACG":396, "ACACT":397, "ACACC":398, "ACACN":399, "ACANA":400, "ACANG":401, "ACANT":402, "ACANC":403, "ACANN":404, "ACGAA":405, "ACGAG":406, "ACGAT":407, "ACGAC":408, "ACGAN":409, "ACGGA":410, "ACGGG":411, "ACGGT":412, "ACGGC":413, "ACGGN":414, "ACGTA":415, "ACGTG":416, "ACGTT":417, "ACGTC":418, "ACGTN":419, "ACGCA":420, "ACGCG":421, "ACGCT":422, "ACGCC":423, "ACGCN":424, "ACGNA":425, "ACGNG":426, "ACGNT":427, "ACGNC":428, "ACGNN":429, "ACTAA":430, "ACTAG":431, "ACTAT":432, "ACTAC":433, "ACTAN":434, "ACTGA":435, "ACTGG":436, "ACTGT":437, "ACTGC":438, "ACTGN":439, "ACTTA":440, "ACTTG":441, "ACTTT":442, "ACTTC":443, "ACTTN":444, "ACTCA":445, "ACTCG":446, "ACTCT":447, "ACTCC":448, "ACTCN":449, "ACTNA":450, "ACTNG":451, "ACTNT":452, "ACTNC":453, "ACTNN":454, "ACCAA":455, "ACCAG":456, "ACCAT":457, "ACCAC":458, "ACCAN":459, "ACCGA":460, "ACCGG":461, "ACCGT":462, "ACCGC":463, "ACCGN":464, "ACCTA":465, "ACCTG":466, "ACCTT":467, "ACCTC":468, "ACCTN":469, "ACCCA":470, "ACCCG":471, "ACCCT":472, "ACCCC":473, "ACCCN":474, "ACCNA":475, "ACCNG":476, "ACCNT":477, "ACCNC":478, "ACCNN":479, "ACNAA":480, "ACNAG":481, "ACNAT":482, "ACNAC":483, "ACNAN":484, "ACNGA":485, "ACNGG":486, "ACNGT":487, "ACNGC":488, "ACNGN":489, "ACNTA":490, "ACNTG":491, "ACNTT":492, "ACNTC":493, "ACNTN":494, "ACNCA":495, "ACNCG":496, "ACNCT":497, "ACNCC":498, "ACNCN":499, "ACNNA":500, "ACNNG":501, "ACNNT":502, "ACNNC":503, "ACNNN":504, "ANAAA":505, "ANAAG":506, "ANAAT":507, "ANAAC":508, "ANAAN":509, "ANAGA":510, "ANAGG":511, "ANAGT":512, "ANAGC":513, "ANAGN":514, "ANATA":515, "ANATG":516, "ANATT":517, "ANATC":518, "ANATN":519, "ANACA":520, "ANACG":521, "ANACT":522, "ANACC":523, "ANACN":524, "ANANA":525, "ANANG":526, "ANANT":527, "ANANC":528, "ANANN":529, "ANGAA":530, "ANGAG":531, "ANGAT":532, "ANGAC":533, "ANGAN":534, "ANGGA":535, "ANGGG":536, "ANGGT":537, "ANGGC":538, "ANGGN":539, "ANGTA":540, "ANGTG":541, "ANGTT":542, "ANGTC":543, "ANGTN":544, "ANGCA":545, "ANGCG":546, "ANGCT":547, "ANGCC":548, "ANGCN":549, "ANGNA":550, "ANGNG":551, "ANGNT":552, "ANGNC":553, "ANGNN":554, "ANTAA":555, "ANTAG":556, "ANTAT":557, "ANTAC":558, "ANTAN":559, "ANTGA":560, "ANTGG":561, "ANTGT":562, "ANTGC":563, "ANTGN":564, "ANTTA":565, "ANTTG":566, "ANTTT":567, "ANTTC":568, "ANTTN":569, "ANTCA":570, "ANTCG":571, "ANTCT":572, "ANTCC":573, "ANTCN":574, "ANTNA":575, "ANTNG":576, "ANTNT":577, "ANTNC":578, "ANTNN":579, "ANCAA":580, "ANCAG":581, "ANCAT":582, "ANCAC":583, "ANCAN":584, "ANCGA":585, "ANCGG":586, "ANCGT":587, "ANCGC":588, "ANCGN":589, "ANCTA":590, "ANCTG":591, "ANCTT":592, "ANCTC":593, "ANCTN":594, "ANCCA":595, "ANCCG":596, "ANCCT":597, "ANCCC":598, "ANCCN":599, "ANCNA":600, "ANCNG":601, "ANCNT":602, "ANCNC":603, "ANCNN":604, "ANNAA":605, "ANNAG":606, "ANNAT":607, "ANNAC":608, "ANNAN":609, "ANNGA":610, "ANNGG":611, "ANNGT":612, "ANNGC":613, "ANNGN":614, "ANNTA":615, "ANNTG":616, "ANNTT":617, "ANNTC":618, "ANNTN":619, "ANNCA":620, "ANNCG":621, "ANNCT":622, "ANNCC":623, "ANNCN":624, "ANNNA":625, "ANNNG":626, "ANNNT":627, "ANNNC":628, "ANNNN":629, "GAAAA":630, "GAAAG":631, "GAAAT":632, "GAAAC":633, "GAAAN":634, "GAAGA":635, "GAAGG":636, "GAAGT":637, "GAAGC":638, "GAAGN":639, "GAATA":640, "GAATG":641, "GAATT":642, "GAATC":643, "GAATN":644, "GAACA":645, "GAACG":646, "GAACT":647, "GAACC":648, "GAACN":649, "GAANA":650, "GAANG":651, "GAANT":652, "GAANC":653, "GAANN":654, "GAGAA":655, "GAGAG":656, "GAGAT":657, "GAGAC":658, "GAGAN":659, "GAGGA":660, "GAGGG":661, "GAGGT":662, "GAGGC":663, "GAGGN":664, "GAGTA":665, "GAGTG":666, "GAGTT":667, "GAGTC":668, "GAGTN":669, "GAGCA":670, "GAGCG":671, "GAGCT":672, "GAGCC":673, "GAGCN":674, "GAGNA":675, "GAGNG":676, "GAGNT":677, "GAGNC":678, "GAGNN":679, "GATAA":680, "GATAG":681, "GATAT":682, "GATAC":683, "GATAN":684, "GATGA":685, "GATGG":686, "GATGT":687, "GATGC":688, "GATGN":689, "GATTA":690, "GATTG":691, "GATTT":692, "GATTC":693, "GATTN":694, "GATCA":695, "GATCG":696, "GATCT":697, "GATCC":698, "GATCN":699, "GATNA":700, "GATNG":701, "GATNT":702, "GATNC":703, "GATNN":704, "GACAA":705, "GACAG":706, "GACAT":707, "GACAC":708, "GACAN":709, "GACGA":710, "GACGG":711, "GACGT":712, "GACGC":713, "GACGN":714, "GACTA":715, "GACTG":716, "GACTT":717, "GACTC":718, "GACTN":719, "GACCA":720, "GACCG":721, "GACCT":722, "GACCC":723, "GACCN":724, "GACNA":725, "GACNG":726, "GACNT":727, "GACNC":728, "GACNN":729, "GANAA":730, "GANAG":731, "GANAT":732, "GANAC":733, "GANAN":734, "GANGA":735, "GANGG":736, "GANGT":737, "GANGC":738, "GANGN":739, "GANTA":740, "GANTG":741, "GANTT":742, "GANTC":743, "GANTN":744, "GANCA":745, "GANCG":746, "GANCT":747, "GANCC":748, "GANCN":749, "GANNA":750, "GANNG":751, "GANNT":752, "GANNC":753, "GANNN":754, "GGAAA":755, "GGAAG":756, "GGAAT":757, "GGAAC":758, "GGAAN":759, "GGAGA":760, "GGAGG":761, "GGAGT":762, "GGAGC":763, "GGAGN":764, "GGATA":765, "GGATG":766, "GGATT":767, "GGATC":768, "GGATN":769, "GGACA":770, "GGACG":771, "GGACT":772, "GGACC":773, "GGACN":774, "GGANA":775, "GGANG":776, "GGANT":777, "GGANC":778, "GGANN":779, "GGGAA":780, "GGGAG":781, "GGGAT":782, "GGGAC":783, "GGGAN":784, "GGGGA":785, "GGGGG":786, "GGGGT":787, "GGGGC":788, "GGGGN":789, "GGGTA":790, "GGGTG":791, "GGGTT":792, "GGGTC":793, "GGGTN":794, "GGGCA":795, "GGGCG":796, "GGGCT":797, "GGGCC":798, "GGGCN":799, "GGGNA":800, "GGGNG":801, "GGGNT":802, "GGGNC":803, "GGGNN":804, "GGTAA":805, "GGTAG":806, "GGTAT":807, "GGTAC":808, "GGTAN":809, "GGTGA":810, "GGTGG":811, "GGTGT":812, "GGTGC":813, "GGTGN":814, "GGTTA":815, "GGTTG":816, "GGTTT":817, "GGTTC":818, "GGTTN":819, "GGTCA":820, "GGTCG":821, "GGTCT":822, "GGTCC":823, "GGTCN":824, "GGTNA":825, "GGTNG":826, "GGTNT":827, "GGTNC":828, "GGTNN":829, "GGCAA":830, "GGCAG":831, "GGCAT":832, "GGCAC":833, "GGCAN":834, "GGCGA":835, "GGCGG":836, "GGCGT":837, "GGCGC":838, "GGCGN":839, "GGCTA":840, "GGCTG":841, "GGCTT":842, "GGCTC":843, "GGCTN":844, "GGCCA":845, "GGCCG":846, "GGCCT":847, "GGCCC":848, "GGCCN":849, "GGCNA":850, "GGCNG":851, "GGCNT":852, "GGCNC":853, "GGCNN":854, "GGNAA":855, "GGNAG":856, "GGNAT":857, "GGNAC":858, "GGNAN":859, "GGNGA":860, "GGNGG":861, "GGNGT":862, "GGNGC":863, "GGNGN":864, "GGNTA":865, "GGNTG":866, "GGNTT":867, "GGNTC":868, "GGNTN":869, "GGNCA":870, "GGNCG":871, "GGNCT":872, "GGNCC":873, "GGNCN":874, "GGNNA":875, "GGNNG":876, "GGNNT":877, "GGNNC":878, "GGNNN":879, "GTAAA":880, "GTAAG":881, "GTAAT":882, "GTAAC":883, "GTAAN":884, "GTAGA":885, "GTAGG":886, "GTAGT":887, "GTAGC":888, "GTAGN":889, "GTATA":890, "GTATG":891, "GTATT":892, "GTATC":893, "GTATN":894, "GTACA":895, "GTACG":896, "GTACT":897, "GTACC":898, "GTACN":899, "GTANA":900, "GTANG":901, "GTANT":902, "GTANC":903, "GTANN":904, "GTGAA":905, "GTGAG":906, "GTGAT":907, "GTGAC":908, "GTGAN":909, "GTGGA":910, "GTGGG":911, "GTGGT":912, "GTGGC":913, "GTGGN":914, "GTGTA":915, "GTGTG":916, "GTGTT":917, "GTGTC":918, "GTGTN":919, "GTGCA":920, "GTGCG":921, "GTGCT":922, "GTGCC":923, "GTGCN":924, "GTGNA":925, "GTGNG":926, "GTGNT":927, "GTGNC":928, "GTGNN":929, "GTTAA":930, "GTTAG":931, "GTTAT":932, "GTTAC":933, "GTTAN":934, "GTTGA":935, "GTTGG":936, "GTTGT":937, "GTTGC":938, "GTTGN":939, "GTTTA":940, "GTTTG":941, "GTTTT":942, "GTTTC":943, "GTTTN":944, "GTTCA":945, "GTTCG":946, "GTTCT":947, "GTTCC":948, "GTTCN":949, "GTTNA":950, "GTTNG":951, "GTTNT":952, "GTTNC":953, "GTTNN":954, "GTCAA":955, "GTCAG":956, "GTCAT":957, "GTCAC":958, "GTCAN":959, "GTCGA":960, "GTCGG":961, "GTCGT":962, "GTCGC":963, "GTCGN":964, "GTCTA":965, "GTCTG":966, "GTCTT":967, "GTCTC":968, "GTCTN":969, "GTCCA":970, "GTCCG":971, "GTCCT":972, "GTCCC":973, "GTCCN":974, "GTCNA":975, "GTCNG":976, "GTCNT":977, "GTCNC":978, "GTCNN":979, "GTNAA":980, "GTNAG":981, "GTNAT":982, "GTNAC":983, "GTNAN":984, "GTNGA":985, "GTNGG":986, "GTNGT":987, "GTNGC":988, "GTNGN":989, "GTNTA":990, "GTNTG":991, "GTNTT":992, "GTNTC":993, "GTNTN":994, "GTNCA":995, "GTNCG":996, "GTNCT":997, "GTNCC":998, "GTNCN":999, "GTNNA":1000, "GTNNG":1001, "GTNNT":1002, "GTNNC":1003, "GTNNN":1004, "GCAAA":1005, "GCAAG":1006, "GCAAT":1007, "GCAAC":1008, "GCAAN":1009, "GCAGA":1010, "GCAGG":1011, "GCAGT":1012, "GCAGC":1013, "GCAGN":1014, "GCATA":1015, "GCATG":1016, "GCATT":1017, "GCATC":1018, "GCATN":1019, "GCACA":1020, "GCACG":1021, "GCACT":1022, "GCACC":1023, "GCACN":1024, "GCANA":1025, "GCANG":1026, "GCANT":1027, "GCANC":1028, "GCANN":1029, "GCGAA":1030, "GCGAG":1031, "GCGAT":1032, "GCGAC":1033, "GCGAN":1034, "GCGGA":1035, "GCGGG":1036, "GCGGT":1037, "GCGGC":1038, "GCGGN":1039, "GCGTA":1040, "GCGTG":1041, "GCGTT":1042, "GCGTC":1043, "GCGTN":1044, "GCGCA":1045, "GCGCG":1046, "GCGCT":1047, "GCGCC":1048, "GCGCN":1049, "GCGNA":1050, "GCGNG":1051, "GCGNT":1052, "GCGNC":1053, "GCGNN":1054, "GCTAA":1055, "GCTAG":1056, "GCTAT":1057, "GCTAC":1058, "GCTAN":1059, "GCTGA":1060, "GCTGG":1061, "GCTGT":1062, "GCTGC":1063, "GCTGN":1064, "GCTTA":1065, "GCTTG":1066, "GCTTT":1067, "GCTTC":1068, "GCTTN":1069, "GCTCA":1070, "GCTCG":1071, "GCTCT":1072, "GCTCC":1073, "GCTCN":1074, "GCTNA":1075, "GCTNG":1076, "GCTNT":1077, "GCTNC":1078, "GCTNN":1079, "GCCAA":1080, "GCCAG":1081, "GCCAT":1082, "GCCAC":1083, "GCCAN":1084, "GCCGA":1085, "GCCGG":1086, "GCCGT":1087, "GCCGC":1088, "GCCGN":1089, "GCCTA":1090, "GCCTG":1091, "GCCTT":1092, "GCCTC":1093, "GCCTN":1094, "GCCCA":1095, "GCCCG":1096, "GCCCT":1097, "GCCCC":1098, "GCCCN":1099, "GCCNA":1100, "GCCNG":1101, "GCCNT":1102, "GCCNC":1103, "GCCNN":1104, "GCNAA":1105, "GCNAG":1106, "GCNAT":1107, "GCNAC":1108, "GCNAN":1109, "GCNGA":1110, "GCNGG":1111, "GCNGT":1112, "GCNGC":1113, "GCNGN":1114, "GCNTA":1115, "GCNTG":1116, "GCNTT":1117, "GCNTC":1118, "GCNTN":1119, "GCNCA":1120, "GCNCG":1121, "GCNCT":1122, "GCNCC":1123, "GCNCN":1124, "GCNNA":1125, "GCNNG":1126, "GCNNT":1127, "GCNNC":1128, "GCNNN":1129, "GNAAA":1130, "GNAAG":1131, "GNAAT":1132, "GNAAC":1133, "GNAAN":1134, "GNAGA":1135, "GNAGG":1136, "GNAGT":1137, "GNAGC":1138, "GNAGN":1139, "GNATA":1140, "GNATG":1141, "GNATT":1142, "GNATC":1143, "GNATN":1144, "GNACA":1145, "GNACG":1146, "GNACT":1147, "GNACC":1148, "GNACN":1149, "GNANA":1150, "GNANG":1151, "GNANT":1152, "GNANC":1153, "GNANN":1154, "GNGAA":1155, "GNGAG":1156, "GNGAT":1157, "GNGAC":1158, "GNGAN":1159, "GNGGA":1160, "GNGGG":1161, "GNGGT":1162, "GNGGC":1163, "GNGGN":1164, "GNGTA":1165, "GNGTG":1166, "GNGTT":1167, "GNGTC":1168, "GNGTN":1169, "GNGCA":1170, "GNGCG":1171, "GNGCT":1172, "GNGCC":1173, "GNGCN":1174, "GNGNA":1175, "GNGNG":1176, "GNGNT":1177, "GNGNC":1178, "GNGNN":1179, "GNTAA":1180, "GNTAG":1181, "GNTAT":1182, "GNTAC":1183, "GNTAN":1184, "GNTGA":1185, "GNTGG":1186, "GNTGT":1187, "GNTGC":1188, "GNTGN":1189, "GNTTA":1190, "GNTTG":1191, "GNTTT":1192, "GNTTC":1193, "GNTTN":1194, "GNTCA":1195, "GNTCG":1196, "GNTCT":1197, "GNTCC":1198, "GNTCN":1199, "GNTNA":1200, "GNTNG":1201, "GNTNT":1202, "GNTNC":1203, "GNTNN":1204, "GNCAA":1205, "GNCAG":1206, "GNCAT":1207, "GNCAC":1208, "GNCAN":1209, "GNCGA":1210, "GNCGG":1211, "GNCGT":1212, "GNCGC":1213, "GNCGN":1214, "GNCTA":1215, "GNCTG":1216, "GNCTT":1217, "GNCTC":1218, "GNCTN":1219, "GNCCA":1220, "GNCCG":1221, "GNCCT":1222, "GNCCC":1223, "GNCCN":1224, "GNCNA":1225, "GNCNG":1226, "GNCNT":1227, "GNCNC":1228, "GNCNN":1229, "GNNAA":1230, "GNNAG":1231, "GNNAT":1232, "GNNAC":1233, "GNNAN":1234, "GNNGA":1235, "GNNGG":1236, "GNNGT":1237, "GNNGC":1238, "GNNGN":1239, "GNNTA":1240, "GNNTG":1241, "GNNTT":1242, "GNNTC":1243, "GNNTN":1244, "GNNCA":1245, "GNNCG":1246, "GNNCT":1247, "GNNCC":1248, "GNNCN":1249, "GNNNA":1250, "GNNNG":1251, "GNNNT":1252, "GNNNC":1253, "GNNNN":1254, "TAAAA":1255, "TAAAG":1256, "TAAAT":1257, "TAAAC":1258, "TAAAN":1259, "TAAGA":1260, "TAAGG":1261, "TAAGT":1262, "TAAGC":1263, "TAAGN":1264, "TAATA":1265, "TAATG":1266, "TAATT":1267, "TAATC":1268, "TAATN":1269, "TAACA":1270, "TAACG":1271, "TAACT":1272, "TAACC":1273, "TAACN":1274, "TAANA":1275, "TAANG":1276, "TAANT":1277, "TAANC":1278, "TAANN":1279, "TAGAA":1280, "TAGAG":1281, "TAGAT":1282, "TAGAC":1283, "TAGAN":1284, "TAGGA":1285, "TAGGG":1286, "TAGGT":1287, "TAGGC":1288, "TAGGN":1289, "TAGTA":1290, "TAGTG":1291, "TAGTT":1292, "TAGTC":1293, "TAGTN":1294, "TAGCA":1295, "TAGCG":1296, "TAGCT":1297, "TAGCC":1298, "TAGCN":1299, "TAGNA":1300, "TAGNG":1301, "TAGNT":1302, "TAGNC":1303, "TAGNN":1304, "TATAA":1305, "TATAG":1306, "TATAT":1307, "TATAC":1308, "TATAN":1309, "TATGA":1310, "TATGG":1311, "TATGT":1312, "TATGC":1313, "TATGN":1314, "TATTA":1315, "TATTG":1316, "TATTT":1317, "TATTC":1318, "TATTN":1319, "TATCA":1320, "TATCG":1321, "TATCT":1322, "TATCC":1323, "TATCN":1324, "TATNA":1325, "TATNG":1326, "TATNT":1327, "TATNC":1328, "TATNN":1329, "TACAA":1330, "TACAG":1331, "TACAT":1332, "TACAC":1333, "TACAN":1334, "TACGA":1335, "TACGG":1336, "TACGT":1337, "TACGC":1338, "TACGN":1339, "TACTA":1340, "TACTG":1341, "TACTT":1342, "TACTC":1343, "TACTN":1344, "TACCA":1345, "TACCG":1346, "TACCT":1347, "TACCC":1348, "TACCN":1349, "TACNA":1350, "TACNG":1351, "TACNT":1352, "TACNC":1353, "TACNN":1354, "TANAA":1355, "TANAG":1356, "TANAT":1357, "TANAC":1358, "TANAN":1359, "TANGA":1360, "TANGG":1361, "TANGT":1362, "TANGC":1363, "TANGN":1364, "TANTA":1365, "TANTG":1366, "TANTT":1367, "TANTC":1368, "TANTN":1369, "TANCA":1370, "TANCG":1371, "TANCT":1372, "TANCC":1373, "TANCN":1374, "TANNA":1375, "TANNG":1376, "TANNT":1377, "TANNC":1378, "TANNN":1379, "TGAAA":1380, "TGAAG":1381, "TGAAT":1382, "TGAAC":1383, "TGAAN":1384, "TGAGA":1385, "TGAGG":1386, "TGAGT":1387, "TGAGC":1388, "TGAGN":1389, "TGATA":1390, "TGATG":1391, "TGATT":1392, "TGATC":1393, "TGATN":1394, "TGACA":1395, "TGACG":1396, "TGACT":1397, "TGACC":1398, "TGACN":1399, "TGANA":1400, "TGANG":1401, "TGANT":1402, "TGANC":1403, "TGANN":1404, "TGGAA":1405, "TGGAG":1406, "TGGAT":1407, "TGGAC":1408, "TGGAN":1409, "TGGGA":1410, "TGGGG":1411, "TGGGT":1412, "TGGGC":1413, "TGGGN":1414, "TGGTA":1415, "TGGTG":1416, "TGGTT":1417, "TGGTC":1418, "TGGTN":1419, "TGGCA":1420, "TGGCG":1421, "TGGCT":1422, "TGGCC":1423, "TGGCN":1424, "TGGNA":1425, "TGGNG":1426, "TGGNT":1427, "TGGNC":1428, "TGGNN":1429, "TGTAA":1430, "TGTAG":1431, "TGTAT":1432, "TGTAC":1433, "TGTAN":1434, "TGTGA":1435, "TGTGG":1436, "TGTGT":1437, "TGTGC":1438, "TGTGN":1439, "TGTTA":1440, "TGTTG":1441, "TGTTT":1442, "TGTTC":1443, "TGTTN":1444, "TGTCA":1445, "TGTCG":1446, "TGTCT":1447, "TGTCC":1448, "TGTCN":1449, "TGTNA":1450, "TGTNG":1451, "TGTNT":1452, "TGTNC":1453, "TGTNN":1454, "TGCAA":1455, "TGCAG":1456, "TGCAT":1457, "TGCAC":1458, "TGCAN":1459, "TGCGA":1460, "TGCGG":1461, "TGCGT":1462, "TGCGC":1463, "TGCGN":1464, "TGCTA":1465, "TGCTG":1466, "TGCTT":1467, "TGCTC":1468, "TGCTN":1469, "TGCCA":1470, "TGCCG":1471, "TGCCT":1472, "TGCCC":1473, "TGCCN":1474, "TGCNA":1475, "TGCNG":1476, "TGCNT":1477, "TGCNC":1478, "TGCNN":1479, "TGNAA":1480, "TGNAG":1481, "TGNAT":1482, "TGNAC":1483, "TGNAN":1484, "TGNGA":1485, "TGNGG":1486, "TGNGT":1487, "TGNGC":1488, "TGNGN":1489, "TGNTA":1490, "TGNTG":1491, "TGNTT":1492, "TGNTC":1493, "TGNTN":1494, "TGNCA":1495, "TGNCG":1496, "TGNCT":1497, "TGNCC":1498, "TGNCN":1499, "TGNNA":1500, "TGNNG":1501, "TGNNT":1502, "TGNNC":1503, "TGNNN":1504, "TTAAA":1505, "TTAAG":1506, "TTAAT":1507, "TTAAC":1508, "TTAAN":1509, "TTAGA":1510, "TTAGG":1511, "TTAGT":1512, "TTAGC":1513, "TTAGN":1514, "TTATA":1515, "TTATG":1516, "TTATT":1517, "TTATC":1518, "TTATN":1519, "TTACA":1520, "TTACG":1521, "TTACT":1522, "TTACC":1523, "TTACN":1524, "TTANA":1525, "TTANG":1526, "TTANT":1527, "TTANC":1528, "TTANN":1529, "TTGAA":1530, "TTGAG":1531, "TTGAT":1532, "TTGAC":1533, "TTGAN":1534, "TTGGA":1535, "TTGGG":1536, "TTGGT":1537, "TTGGC":1538, "TTGGN":1539, "TTGTA":1540, "TTGTG":1541, "TTGTT":1542, "TTGTC":1543, "TTGTN":1544, "TTGCA":1545, "TTGCG":1546, "TTGCT":1547, "TTGCC":1548, "TTGCN":1549, "TTGNA":1550, "TTGNG":1551, "TTGNT":1552, "TTGNC":1553, "TTGNN":1554, "TTTAA":1555, "TTTAG":1556, "TTTAT":1557, "TTTAC":1558, "TTTAN":1559, "TTTGA":1560, "TTTGG":1561, "TTTGT":1562, "TTTGC":1563, "TTTGN":1564, "TTTTA":1565, "TTTTG":1566, "TTTTT":1567, "TTTTC":1568, "TTTTN":1569, "TTTCA":1570, "TTTCG":1571, "TTTCT":1572, "TTTCC":1573, "TTTCN":1574, "TTTNA":1575, "TTTNG":1576, "TTTNT":1577, "TTTNC":1578, "TTTNN":1579, "TTCAA":1580, "TTCAG":1581, "TTCAT":1582, "TTCAC":1583, "TTCAN":1584, "TTCGA":1585, "TTCGG":1586, "TTCGT":1587, "TTCGC":1588, "TTCGN":1589, "TTCTA":1590, "TTCTG":1591, "TTCTT":1592, "TTCTC":1593, "TTCTN":1594, "TTCCA":1595, "TTCCG":1596, "TTCCT":1597, "TTCCC":1598, "TTCCN":1599, "TTCNA":1600, "TTCNG":1601, "TTCNT":1602, "TTCNC":1603, "TTCNN":1604, "TTNAA":1605, "TTNAG":1606, "TTNAT":1607, "TTNAC":1608, "TTNAN":1609, "TTNGA":1610, "TTNGG":1611, "TTNGT":1612, "TTNGC":1613, "TTNGN":1614, "TTNTA":1615, "TTNTG":1616, "TTNTT":1617, "TTNTC":1618, "TTNTN":1619, "TTNCA":1620, "TTNCG":1621, "TTNCT":1622, "TTNCC":1623, "TTNCN":1624, "TTNNA":1625, "TTNNG":1626, "TTNNT":1627, "TTNNC":1628, "TTNNN":1629, "TCAAA":1630, "TCAAG":1631, "TCAAT":1632, "TCAAC":1633, "TCAAN":1634, "TCAGA":1635, "TCAGG":1636, "TCAGT":1637, "TCAGC":1638, "TCAGN":1639, "TCATA":1640, "TCATG":1641, "TCATT":1642, "TCATC":1643, "TCATN":1644, "TCACA":1645, "TCACG":1646, "TCACT":1647, "TCACC":1648, "TCACN":1649, "TCANA":1650, "TCANG":1651, "TCANT":1652, "TCANC":1653, "TCANN":1654, "TCGAA":1655, "TCGAG":1656, "TCGAT":1657, "TCGAC":1658, "TCGAN":1659, "TCGGA":1660, "TCGGG":1661, "TCGGT":1662, "TCGGC":1663, "TCGGN":1664, "TCGTA":1665, "TCGTG":1666, "TCGTT":1667, "TCGTC":1668, "TCGTN":1669, "TCGCA":1670, "TCGCG":1671, "TCGCT":1672, "TCGCC":1673, "TCGCN":1674, "TCGNA":1675, "TCGNG":1676, "TCGNT":1677, "TCGNC":1678, "TCGNN":1679, "TCTAA":1680, "TCTAG":1681, "TCTAT":1682, "TCTAC":1683, "TCTAN":1684, "TCTGA":1685, "TCTGG":1686, "TCTGT":1687, "TCTGC":1688, "TCTGN":1689, "TCTTA":1690, "TCTTG":1691, "TCTTT":1692, "TCTTC":1693, "TCTTN":1694, "TCTCA":1695, "TCTCG":1696, "TCTCT":1697, "TCTCC":1698, "TCTCN":1699, "TCTNA":1700, "TCTNG":1701, "TCTNT":1702, "TCTNC":1703, "TCTNN":1704, "TCCAA":1705, "TCCAG":1706, "TCCAT":1707, "TCCAC":1708, "TCCAN":1709, "TCCGA":1710, "TCCGG":1711, "TCCGT":1712, "TCCGC":1713, "TCCGN":1714, "TCCTA":1715, "TCCTG":1716, "TCCTT":1717, "TCCTC":1718, "TCCTN":1719, "TCCCA":1720, "TCCCG":1721, "TCCCT":1722, "TCCCC":1723, "TCCCN":1724, "TCCNA":1725, "TCCNG":1726, "TCCNT":1727, "TCCNC":1728, "TCCNN":1729, "TCNAA":1730, "TCNAG":1731, "TCNAT":1732, "TCNAC":1733, "TCNAN":1734, "TCNGA":1735, "TCNGG":1736, "TCNGT":1737, "TCNGC":1738, "TCNGN":1739, "TCNTA":1740, "TCNTG":1741, "TCNTT":1742, "TCNTC":1743, "TCNTN":1744, "TCNCA":1745, "TCNCG":1746, "TCNCT":1747, "TCNCC":1748, "TCNCN":1749, "TCNNA":1750, "TCNNG":1751, "TCNNT":1752, "TCNNC":1753, "TCNNN":1754, "TNAAA":1755, "TNAAG":1756, "TNAAT":1757, "TNAAC":1758, "TNAAN":1759, "TNAGA":1760, "TNAGG":1761, "TNAGT":1762, "TNAGC":1763, "TNAGN":1764, "TNATA":1765, "TNATG":1766, "TNATT":1767, "TNATC":1768, "TNATN":1769, "TNACA":1770, "TNACG":1771, "TNACT":1772, "TNACC":1773, "TNACN":1774, "TNANA":1775, "TNANG":1776, "TNANT":1777, "TNANC":1778, "TNANN":1779, "TNGAA":1780, "TNGAG":1781, "TNGAT":1782, "TNGAC":1783, "TNGAN":1784, "TNGGA":1785, "TNGGG":1786, "TNGGT":1787, "TNGGC":1788, "TNGGN":1789, "TNGTA":1790, "TNGTG":1791, "TNGTT":1792, "TNGTC":1793, "TNGTN":1794, "TNGCA":1795, "TNGCG":1796, "TNGCT":1797, "TNGCC":1798, "TNGCN":1799, "TNGNA":1800, "TNGNG":1801, "TNGNT":1802, "TNGNC":1803, "TNGNN":1804, "TNTAA":1805, "TNTAG":1806, "TNTAT":1807, "TNTAC":1808, "TNTAN":1809, "TNTGA":1810, "TNTGG":1811, "TNTGT":1812, "TNTGC":1813, "TNTGN":1814, "TNTTA":1815, "TNTTG":1816, "TNTTT":1817, "TNTTC":1818, "TNTTN":1819, "TNTCA":1820, "TNTCG":1821, "TNTCT":1822, "TNTCC":1823, "TNTCN":1824, "TNTNA":1825, "TNTNG":1826, "TNTNT":1827, "TNTNC":1828, "TNTNN":1829, "TNCAA":1830, "TNCAG":1831, "TNCAT":1832, "TNCAC":1833, "TNCAN":1834, "TNCGA":1835, "TNCGG":1836, "TNCGT":1837, "TNCGC":1838, "TNCGN":1839, "TNCTA":1840, "TNCTG":1841, "TNCTT":1842, "TNCTC":1843, "TNCTN":1844, "TNCCA":1845, "TNCCG":1846, "TNCCT":1847, "TNCCC":1848, "TNCCN":1849, "TNCNA":1850, "TNCNG":1851, "TNCNT":1852, "TNCNC":1853, "TNCNN":1854, "TNNAA":1855, "TNNAG":1856, "TNNAT":1857, "TNNAC":1858, "TNNAN":1859, "TNNGA":1860, "TNNGG":1861, "TNNGT":1862, "TNNGC":1863, "TNNGN":1864, "TNNTA":1865, "TNNTG":1866, "TNNTT":1867, "TNNTC":1868, "TNNTN":1869, "TNNCA":1870, "TNNCG":1871, "TNNCT":1872, "TNNCC":1873, "TNNCN":1874, "TNNNA":1875, "TNNNG":1876, "TNNNT":1877, "TNNNC":1878, "TNNNN":1879, "CAAAA":1880, "CAAAG":1881, "CAAAT":1882, "CAAAC":1883, "CAAAN":1884, "CAAGA":1885, "CAAGG":1886, "CAAGT":1887, "CAAGC":1888, "CAAGN":1889, "CAATA":1890, "CAATG":1891, "CAATT":1892, "CAATC":1893, "CAATN":1894, "CAACA":1895, "CAACG":1896, "CAACT":1897, "CAACC":1898, "CAACN":1899, "CAANA":1900, "CAANG":1901, "CAANT":1902, "CAANC":1903, "CAANN":1904, "CAGAA":1905, "CAGAG":1906, "CAGAT":1907, "CAGAC":1908, "CAGAN":1909, "CAGGA":1910, "CAGGG":1911, "CAGGT":1912, "CAGGC":1913, "CAGGN":1914, "CAGTA":1915, "CAGTG":1916, "CAGTT":1917, "CAGTC":1918, "CAGTN":1919, "CAGCA":1920, "CAGCG":1921, "CAGCT":1922, "CAGCC":1923, "CAGCN":1924, "CAGNA":1925, "CAGNG":1926, "CAGNT":1927, "CAGNC":1928, "CAGNN":1929, "CATAA":1930, "CATAG":1931, "CATAT":1932, "CATAC":1933, "CATAN":1934, "CATGA":1935, "CATGG":1936, "CATGT":1937, "CATGC":1938, "CATGN":1939, "CATTA":1940, "CATTG":1941, "CATTT":1942, "CATTC":1943, "CATTN":1944, "CATCA":1945, "CATCG":1946, "CATCT":1947, "CATCC":1948, "CATCN":1949, "CATNA":1950, "CATNG":1951, "CATNT":1952, "CATNC":1953, "CATNN":1954, "CACAA":1955, "CACAG":1956, "CACAT":1957, "CACAC":1958, "CACAN":1959, "CACGA":1960, "CACGG":1961, "CACGT":1962, "CACGC":1963, "CACGN":1964, "CACTA":1965, "CACTG":1966, "CACTT":1967, "CACTC":1968, "CACTN":1969, "CACCA":1970, "CACCG":1971, "CACCT":1972, "CACCC":1973, "CACCN":1974, "CACNA":1975, "CACNG":1976, "CACNT":1977, "CACNC":1978, "CACNN":1979, "CANAA":1980, "CANAG":1981, "CANAT":1982, "CANAC":1983, "CANAN":1984, "CANGA":1985, "CANGG":1986, "CANGT":1987, "CANGC":1988, "CANGN":1989, "CANTA":1990, "CANTG":1991, "CANTT":1992, "CANTC":1993, "CANTN":1994, "CANCA":1995, "CANCG":1996, "CANCT":1997, "CANCC":1998, "CANCN":1999, "CANNA":2000, "CANNG":2001, "CANNT":2002, "CANNC":2003, "CANNN":2004, "CGAAA":2005, "CGAAG":2006, "CGAAT":2007, "CGAAC":2008, "CGAAN":2009, "CGAGA":2010, "CGAGG":2011, "CGAGT":2012, "CGAGC":2013, "CGAGN":2014, "CGATA":2015, "CGATG":2016, "CGATT":2017, "CGATC":2018, "CGATN":2019, "CGACA":2020, "CGACG":2021, "CGACT":2022, "CGACC":2023, "CGACN":2024, "CGANA":2025, "CGANG":2026, "CGANT":2027, "CGANC":2028, "CGANN":2029, "CGGAA":2030, "CGGAG":2031, "CGGAT":2032, "CGGAC":2033, "CGGAN":2034, "CGGGA":2035, "CGGGG":2036, "CGGGT":2037, "CGGGC":2038, "CGGGN":2039, "CGGTA":2040, "CGGTG":2041, "CGGTT":2042, "CGGTC":2043, "CGGTN":2044, "CGGCA":2045, "CGGCG":2046, "CGGCT":2047, "CGGCC":2048, "CGGCN":2049, "CGGNA":2050, "CGGNG":2051, "CGGNT":2052, "CGGNC":2053, "CGGNN":2054, "CGTAA":2055, "CGTAG":2056, "CGTAT":2057, "CGTAC":2058, "CGTAN":2059, "CGTGA":2060, "CGTGG":2061, "CGTGT":2062, "CGTGC":2063, "CGTGN":2064, "CGTTA":2065, "CGTTG":2066, "CGTTT":2067, "CGTTC":2068, "CGTTN":2069, "CGTCA":2070, "CGTCG":2071, "CGTCT":2072, "CGTCC":2073, "CGTCN":2074, "CGTNA":2075, "CGTNG":2076, "CGTNT":2077, "CGTNC":2078, "CGTNN":2079, "CGCAA":2080, "CGCAG":2081, "CGCAT":2082, "CGCAC":2083, "CGCAN":2084, "CGCGA":2085, "CGCGG":2086, "CGCGT":2087, "CGCGC":2088, "CGCGN":2089, "CGCTA":2090, "CGCTG":2091, "CGCTT":2092, "CGCTC":2093, "CGCTN":2094, "CGCCA":2095, "CGCCG":2096, "CGCCT":2097, "CGCCC":2098, "CGCCN":2099, "CGCNA":2100, "CGCNG":2101, "CGCNT":2102, "CGCNC":2103, "CGCNN":2104, "CGNAA":2105, "CGNAG":2106, "CGNAT":2107, "CGNAC":2108, "CGNAN":2109, "CGNGA":2110, "CGNGG":2111, "CGNGT":2112, "CGNGC":2113, "CGNGN":2114, "CGNTA":2115, "CGNTG":2116, "CGNTT":2117, "CGNTC":2118, "CGNTN":2119, "CGNCA":2120, "CGNCG":2121, "CGNCT":2122, "CGNCC":2123, "CGNCN":2124, "CGNNA":2125, "CGNNG":2126, "CGNNT":2127, "CGNNC":2128, "CGNNN":2129, "CTAAA":2130, "CTAAG":2131, "CTAAT":2132, "CTAAC":2133, "CTAAN":2134, "CTAGA":2135, "CTAGG":2136, "CTAGT":2137, "CTAGC":2138, "CTAGN":2139, "CTATA":2140, "CTATG":2141, "CTATT":2142, "CTATC":2143, "CTATN":2144, "CTACA":2145, "CTACG":2146, "CTACT":2147, "CTACC":2148, "CTACN":2149, "CTANA":2150, "CTANG":2151, "CTANT":2152, "CTANC":2153, "CTANN":2154, "CTGAA":2155, "CTGAG":2156, "CTGAT":2157, "CTGAC":2158, "CTGAN":2159, "CTGGA":2160, "CTGGG":2161, "CTGGT":2162, "CTGGC":2163, "CTGGN":2164, "CTGTA":2165, "CTGTG":2166, "CTGTT":2167, "CTGTC":2168, "CTGTN":2169, "CTGCA":2170, "CTGCG":2171, "CTGCT":2172, "CTGCC":2173, "CTGCN":2174, "CTGNA":2175, "CTGNG":2176, "CTGNT":2177, "CTGNC":2178, "CTGNN":2179, "CTTAA":2180, "CTTAG":2181, "CTTAT":2182, "CTTAC":2183, "CTTAN":2184, "CTTGA":2185, "CTTGG":2186, "CTTGT":2187, "CTTGC":2188, "CTTGN":2189, "CTTTA":2190, "CTTTG":2191, "CTTTT":2192, "CTTTC":2193, "CTTTN":2194, "CTTCA":2195, "CTTCG":2196, "CTTCT":2197, "CTTCC":2198, "CTTCN":2199, "CTTNA":2200, "CTTNG":2201, "CTTNT":2202, "CTTNC":2203, "CTTNN":2204, "CTCAA":2205, "CTCAG":2206, "CTCAT":2207, "CTCAC":2208, "CTCAN":2209, "CTCGA":2210, "CTCGG":2211, "CTCGT":2212, "CTCGC":2213, "CTCGN":2214, "CTCTA":2215, "CTCTG":2216, "CTCTT":2217, "CTCTC":2218, "CTCTN":2219, "CTCCA":2220, "CTCCG":2221, "CTCCT":2222, "CTCCC":2223, "CTCCN":2224, "CTCNA":2225, "CTCNG":2226, "CTCNT":2227, "CTCNC":2228, "CTCNN":2229, "CTNAA":2230, "CTNAG":2231, "CTNAT":2232, "CTNAC":2233, "CTNAN":2234, "CTNGA":2235, "CTNGG":2236, "CTNGT":2237, "CTNGC":2238, "CTNGN":2239, "CTNTA":2240, "CTNTG":2241, "CTNTT":2242, "CTNTC":2243, "CTNTN":2244, "CTNCA":2245, "CTNCG":2246, "CTNCT":2247, "CTNCC":2248, "CTNCN":2249, "CTNNA":2250, "CTNNG":2251, "CTNNT":2252, "CTNNC":2253, "CTNNN":2254, "CCAAA":2255, "CCAAG":2256, "CCAAT":2257, "CCAAC":2258, "CCAAN":2259, "CCAGA":2260, "CCAGG":2261, "CCAGT":2262, "CCAGC":2263, "CCAGN":2264, "CCATA":2265, "CCATG":2266, "CCATT":2267, "CCATC":2268, "CCATN":2269, "CCACA":2270, "CCACG":2271, "CCACT":2272, "CCACC":2273, "CCACN":2274, "CCANA":2275, "CCANG":2276, "CCANT":2277, "CCANC":2278, "CCANN":2279, "CCGAA":2280, "CCGAG":2281, "CCGAT":2282, "CCGAC":2283, "CCGAN":2284, "CCGGA":2285, "CCGGG":2286, "CCGGT":2287, "CCGGC":2288, "CCGGN":2289, "CCGTA":2290, "CCGTG":2291, "CCGTT":2292, "CCGTC":2293, "CCGTN":2294, "CCGCA":2295, "CCGCG":2296, "CCGCT":2297, "CCGCC":2298, "CCGCN":2299, "CCGNA":2300, "CCGNG":2301, "CCGNT":2302, "CCGNC":2303, "CCGNN":2304, "CCTAA":2305, "CCTAG":2306, "CCTAT":2307, "CCTAC":2308, "CCTAN":2309, "CCTGA":2310, "CCTGG":2311, "CCTGT":2312, "CCTGC":2313, "CCTGN":2314, "CCTTA":2315, "CCTTG":2316, "CCTTT":2317, "CCTTC":2318, "CCTTN":2319, "CCTCA":2320, "CCTCG":2321, "CCTCT":2322, "CCTCC":2323, "CCTCN":2324, "CCTNA":2325, "CCTNG":2326, "CCTNT":2327, "CCTNC":2328, "CCTNN":2329, "CCCAA":2330, "CCCAG":2331, "CCCAT":2332, "CCCAC":2333, "CCCAN":2334, "CCCGA":2335, "CCCGG":2336, "CCCGT":2337, "CCCGC":2338, "CCCGN":2339, "CCCTA":2340, "CCCTG":2341, "CCCTT":2342, "CCCTC":2343, "CCCTN":2344, "CCCCA":2345, "CCCCG":2346, "CCCCT":2347, "CCCCC":2348, "CCCCN":2349, "CCCNA":2350, "CCCNG":2351, "CCCNT":2352, "CCCNC":2353, "CCCNN":2354, "CCNAA":2355, "CCNAG":2356, "CCNAT":2357, "CCNAC":2358, "CCNAN":2359, "CCNGA":2360, "CCNGG":2361, "CCNGT":2362, "CCNGC":2363, "CCNGN":2364, "CCNTA":2365, "CCNTG":2366, "CCNTT":2367, "CCNTC":2368, "CCNTN":2369, "CCNCA":2370, "CCNCG":2371, "CCNCT":2372, "CCNCC":2373, "CCNCN":2374, "CCNNA":2375, "CCNNG":2376, "CCNNT":2377, "CCNNC":2378, "CCNNN":2379, "CNAAA":2380, "CNAAG":2381, "CNAAT":2382, "CNAAC":2383, "CNAAN":2384, "CNAGA":2385, "CNAGG":2386, "CNAGT":2387, "CNAGC":2388, "CNAGN":2389, "CNATA":2390, "CNATG":2391, "CNATT":2392, "CNATC":2393, "CNATN":2394, "CNACA":2395, "CNACG":2396, "CNACT":2397, "CNACC":2398, "CNACN":2399, "CNANA":2400, "CNANG":2401, "CNANT":2402, "CNANC":2403, "CNANN":2404, "CNGAA":2405, "CNGAG":2406, "CNGAT":2407, "CNGAC":2408, "CNGAN":2409, "CNGGA":2410, "CNGGG":2411, "CNGGT":2412, "CNGGC":2413, "CNGGN":2414, "CNGTA":2415, "CNGTG":2416, "CNGTT":2417, "CNGTC":2418, "CNGTN":2419, "CNGCA":2420, "CNGCG":2421, "CNGCT":2422, "CNGCC":2423, "CNGCN":2424, "CNGNA":2425, "CNGNG":2426, "CNGNT":2427, "CNGNC":2428, "CNGNN":2429, "CNTAA":2430, "CNTAG":2431, "CNTAT":2432, "CNTAC":2433, "CNTAN":2434, "CNTGA":2435, "CNTGG":2436, "CNTGT":2437, "CNTGC":2438, "CNTGN":2439, "CNTTA":2440, "CNTTG":2441, "CNTTT":2442, "CNTTC":2443, "CNTTN":2444, "CNTCA":2445, "CNTCG":2446, "CNTCT":2447, "CNTCC":2448, "CNTCN":2449, "CNTNA":2450, "CNTNG":2451, "CNTNT":2452, "CNTNC":2453, "CNTNN":2454, "CNCAA":2455, "CNCAG":2456, "CNCAT":2457, "CNCAC":2458, "CNCAN":2459, "CNCGA":2460, "CNCGG":2461, "CNCGT":2462, "CNCGC":2463, "CNCGN":2464, "CNCTA":2465, "CNCTG":2466, "CNCTT":2467, "CNCTC":2468, "CNCTN":2469, "CNCCA":2470, "CNCCG":2471, "CNCCT":2472, "CNCCC":2473, "CNCCN":2474, "CNCNA":2475, "CNCNG":2476, "CNCNT":2477, "CNCNC":2478, "CNCNN":2479, "CNNAA":2480, "CNNAG":2481, "CNNAT":2482, "CNNAC":2483, "CNNAN":2484, "CNNGA":2485, "CNNGG":2486, "CNNGT":2487, "CNNGC":2488, "CNNGN":2489, "CNNTA":2490, "CNNTG":2491, "CNNTT":2492, "CNNTC":2493, "CNNTN":2494, "CNNCA":2495, "CNNCG":2496, "CNNCT":2497, "CNNCC":2498, "CNNCN":2499, "CNNNA":2500, "CNNNG":2501, "CNNNT":2502, "CNNNC":2503, "CNNNN":2504, "NAAAA":2505, "NAAAG":2506, "NAAAT":2507, "NAAAC":2508, "NAAAN":2509, "NAAGA":2510, "NAAGG":2511, "NAAGT":2512, "NAAGC":2513, "NAAGN":2514, "NAATA":2515, "NAATG":2516, "NAATT":2517, "NAATC":2518, "NAATN":2519, "NAACA":2520, "NAACG":2521, "NAACT":2522, "NAACC":2523, "NAACN":2524, "NAANA":2525, "NAANG":2526, "NAANT":2527, "NAANC":2528, "NAANN":2529, "NAGAA":2530, "NAGAG":2531, "NAGAT":2532, "NAGAC":2533, "NAGAN":2534, "NAGGA":2535, "NAGGG":2536, "NAGGT":2537, "NAGGC":2538, "NAGGN":2539, "NAGTA":2540, "NAGTG":2541, "NAGTT":2542, "NAGTC":2543, "NAGTN":2544, "NAGCA":2545, "NAGCG":2546, "NAGCT":2547, "NAGCC":2548, "NAGCN":2549, "NAGNA":2550, "NAGNG":2551, "NAGNT":2552, "NAGNC":2553, "NAGNN":2554, "NATAA":2555, "NATAG":2556, "NATAT":2557, "NATAC":2558, "NATAN":2559, "NATGA":2560, "NATGG":2561, "NATGT":2562, "NATGC":2563, "NATGN":2564, "NATTA":2565, "NATTG":2566, "NATTT":2567, "NATTC":2568, "NATTN":2569, "NATCA":2570, "NATCG":2571, "NATCT":2572, "NATCC":2573, "NATCN":2574, "NATNA":2575, "NATNG":2576, "NATNT":2577, "NATNC":2578, "NATNN":2579, "NACAA":2580, "NACAG":2581, "NACAT":2582, "NACAC":2583, "NACAN":2584, "NACGA":2585, "NACGG":2586, "NACGT":2587, "NACGC":2588, "NACGN":2589, "NACTA":2590, "NACTG":2591, "NACTT":2592, "NACTC":2593, "NACTN":2594, "NACCA":2595, "NACCG":2596, "NACCT":2597, "NACCC":2598, "NACCN":2599, "NACNA":2600, "NACNG":2601, "NACNT":2602, "NACNC":2603, "NACNN":2604, "NANAA":2605, "NANAG":2606, "NANAT":2607, "NANAC":2608, "NANAN":2609, "NANGA":2610, "NANGG":2611, "NANGT":2612, "NANGC":2613, "NANGN":2614, "NANTA":2615, "NANTG":2616, "NANTT":2617, "NANTC":2618, "NANTN":2619, "NANCA":2620, "NANCG":2621, "NANCT":2622, "NANCC":2623, "NANCN":2624, "NANNA":2625, "NANNG":2626, "NANNT":2627, "NANNC":2628, "NANNN":2629, "NGAAA":2630, "NGAAG":2631, "NGAAT":2632, "NGAAC":2633, "NGAAN":2634, "NGAGA":2635, "NGAGG":2636, "NGAGT":2637, "NGAGC":2638, "NGAGN":2639, "NGATA":2640, "NGATG":2641, "NGATT":2642, "NGATC":2643, "NGATN":2644, "NGACA":2645, "NGACG":2646, "NGACT":2647, "NGACC":2648, "NGACN":2649, "NGANA":2650, "NGANG":2651, "NGANT":2652, "NGANC":2653, "NGANN":2654, "NGGAA":2655, "NGGAG":2656, "NGGAT":2657, "NGGAC":2658, "NGGAN":2659, "NGGGA":2660, "NGGGG":2661, "NGGGT":2662, "NGGGC":2663, "NGGGN":2664, "NGGTA":2665, "NGGTG":2666, "NGGTT":2667, "NGGTC":2668, "NGGTN":2669, "NGGCA":2670, "NGGCG":2671, "NGGCT":2672, "NGGCC":2673, "NGGCN":2674, "NGGNA":2675, "NGGNG":2676, "NGGNT":2677, "NGGNC":2678, "NGGNN":2679, "NGTAA":2680, "NGTAG":2681, "NGTAT":2682, "NGTAC":2683, "NGTAN":2684, "NGTGA":2685, "NGTGG":2686, "NGTGT":2687, "NGTGC":2688, "NGTGN":2689, "NGTTA":2690, "NGTTG":2691, "NGTTT":2692, "NGTTC":2693, "NGTTN":2694, "NGTCA":2695, "NGTCG":2696, "NGTCT":2697, "NGTCC":2698, "NGTCN":2699, "NGTNA":2700, "NGTNG":2701, "NGTNT":2702, "NGTNC":2703, "NGTNN":2704, "NGCAA":2705, "NGCAG":2706, "NGCAT":2707, "NGCAC":2708, "NGCAN":2709, "NGCGA":2710, "NGCGG":2711, "NGCGT":2712, "NGCGC":2713, "NGCGN":2714, "NGCTA":2715, "NGCTG":2716, "NGCTT":2717, "NGCTC":2718, "NGCTN":2719, "NGCCA":2720, "NGCCG":2721, "NGCCT":2722, "NGCCC":2723, "NGCCN":2724, "NGCNA":2725, "NGCNG":2726, "NGCNT":2727, "NGCNC":2728, "NGCNN":2729, "NGNAA":2730, "NGNAG":2731, "NGNAT":2732, "NGNAC":2733, "NGNAN":2734, "NGNGA":2735, "NGNGG":2736, "NGNGT":2737, "NGNGC":2738, "NGNGN":2739, "NGNTA":2740, "NGNTG":2741, "NGNTT":2742, "NGNTC":2743, "NGNTN":2744, "NGNCA":2745, "NGNCG":2746, "NGNCT":2747, "NGNCC":2748, "NGNCN":2749, "NGNNA":2750, "NGNNG":2751, "NGNNT":2752, "NGNNC":2753, "NGNNN":2754, "NTAAA":2755, "NTAAG":2756, "NTAAT":2757, "NTAAC":2758, "NTAAN":2759, "NTAGA":2760, "NTAGG":2761, "NTAGT":2762, "NTAGC":2763, "NTAGN":2764, "NTATA":2765, "NTATG":2766, "NTATT":2767, "NTATC":2768, "NTATN":2769, "NTACA":2770, "NTACG":2771, "NTACT":2772, "NTACC":2773, "NTACN":2774, "NTANA":2775, "NTANG":2776, "NTANT":2777, "NTANC":2778, "NTANN":2779, "NTGAA":2780, "NTGAG":2781, "NTGAT":2782, "NTGAC":2783, "NTGAN":2784, "NTGGA":2785, "NTGGG":2786, "NTGGT":2787, "NTGGC":2788, "NTGGN":2789, "NTGTA":2790, "NTGTG":2791, "NTGTT":2792, "NTGTC":2793, "NTGTN":2794, "NTGCA":2795, "NTGCG":2796, "NTGCT":2797, "NTGCC":2798, "NTGCN":2799, "NTGNA":2800, "NTGNG":2801, "NTGNT":2802, "NTGNC":2803, "NTGNN":2804, "NTTAA":2805, "NTTAG":2806, "NTTAT":2807, "NTTAC":2808, "NTTAN":2809, "NTTGA":2810, "NTTGG":2811, "NTTGT":2812, "NTTGC":2813, "NTTGN":2814, "NTTTA":2815, "NTTTG":2816, "NTTTT":2817, "NTTTC":2818, "NTTTN":2819, "NTTCA":2820, "NTTCG":2821, "NTTCT":2822, "NTTCC":2823, "NTTCN":2824, "NTTNA":2825, "NTTNG":2826, "NTTNT":2827, "NTTNC":2828, "NTTNN":2829, "NTCAA":2830, "NTCAG":2831, "NTCAT":2832, "NTCAC":2833, "NTCAN":2834, "NTCGA":2835, "NTCGG":2836, "NTCGT":2837, "NTCGC":2838, "NTCGN":2839, "NTCTA":2840, "NTCTG":2841, "NTCTT":2842, "NTCTC":2843, "NTCTN":2844, "NTCCA":2845, "NTCCG":2846, "NTCCT":2847, "NTCCC":2848, "NTCCN":2849, "NTCNA":2850, "NTCNG":2851, "NTCNT":2852, "NTCNC":2853, "NTCNN":2854, "NTNAA":2855, "NTNAG":2856, "NTNAT":2857, "NTNAC":2858, "NTNAN":2859, "NTNGA":2860, "NTNGG":2861, "NTNGT":2862, "NTNGC":2863, "NTNGN":2864, "NTNTA":2865, "NTNTG":2866, "NTNTT":2867, "NTNTC":2868, "NTNTN":2869, "NTNCA":2870, "NTNCG":2871, "NTNCT":2872, "NTNCC":2873, "NTNCN":2874, "NTNNA":2875, "NTNNG":2876, "NTNNT":2877, "NTNNC":2878, "NTNNN":2879, "NCAAA":2880, "NCAAG":2881, "NCAAT":2882, "NCAAC":2883, "NCAAN":2884, "NCAGA":2885, "NCAGG":2886, "NCAGT":2887, "NCAGC":2888, "NCAGN":2889, "NCATA":2890, "NCATG":2891, "NCATT":2892, "NCATC":2893, "NCATN":2894, "NCACA":2895, "NCACG":2896, "NCACT":2897, "NCACC":2898, "NCACN":2899, "NCANA":2900, "NCANG":2901, "NCANT":2902, "NCANC":2903, "NCANN":2904, "NCGAA":2905, "NCGAG":2906, "NCGAT":2907, "NCGAC":2908, "NCGAN":2909, "NCGGA":2910, "NCGGG":2911, "NCGGT":2912, "NCGGC":2913, "NCGGN":2914, "NCGTA":2915, "NCGTG":2916, "NCGTT":2917, "NCGTC":2918, "NCGTN":2919, "NCGCA":2920, "NCGCG":2921, "NCGCT":2922, "NCGCC":2923, "NCGCN":2924, "NCGNA":2925, "NCGNG":2926, "NCGNT":2927, "NCGNC":2928, "NCGNN":2929, "NCTAA":2930, "NCTAG":2931, "NCTAT":2932, "NCTAC":2933, "NCTAN":2934, "NCTGA":2935, "NCTGG":2936, "NCTGT":2937, "NCTGC":2938, "NCTGN":2939, "NCTTA":2940, "NCTTG":2941, "NCTTT":2942, "NCTTC":2943, "NCTTN":2944, "NCTCA":2945, "NCTCG":2946, "NCTCT":2947, "NCTCC":2948, "NCTCN":2949, "NCTNA":2950, "NCTNG":2951, "NCTNT":2952, "NCTNC":2953, "NCTNN":2954, "NCCAA":2955, "NCCAG":2956, "NCCAT":2957, "NCCAC":2958, "NCCAN":2959, "NCCGA":2960, "NCCGG":2961, "NCCGT":2962, "NCCGC":2963, "NCCGN":2964, "NCCTA":2965, "NCCTG":2966, "NCCTT":2967, "NCCTC":2968, "NCCTN":2969, "NCCCA":2970, "NCCCG":2971, "NCCCT":2972, "NCCCC":2973, "NCCCN":2974, "NCCNA":2975, "NCCNG":2976, "NCCNT":2977, "NCCNC":2978, "NCCNN":2979, "NCNAA":2980, "NCNAG":2981, "NCNAT":2982, "NCNAC":2983, "NCNAN":2984, "NCNGA":2985, "NCNGG":2986, "NCNGT":2987, "NCNGC":2988, "NCNGN":2989, "NCNTA":2990, "NCNTG":2991, "NCNTT":2992, "NCNTC":2993, "NCNTN":2994, "NCNCA":2995, "NCNCG":2996, "NCNCT":2997, "NCNCC":2998, "NCNCN":2999, "NCNNA":3000, "NCNNG":3001, "NCNNT":3002, "NCNNC":3003, "NCNNN":3004, "NNAAA":3005, "NNAAG":3006, "NNAAT":3007, "NNAAC":3008, "NNAAN":3009, "NNAGA":3010, "NNAGG":3011, "NNAGT":3012, "NNAGC":3013, "NNAGN":3014, "NNATA":3015, "NNATG":3016, "NNATT":3017, "NNATC":3018, "NNATN":3019, "NNACA":3020, "NNACG":3021, "NNACT":3022, "NNACC":3023, "NNACN":3024, "NNANA":3025, "NNANG":3026, "NNANT":3027, "NNANC":3028, "NNANN":3029, "NNGAA":3030, "NNGAG":3031, "NNGAT":3032, "NNGAC":3033, "NNGAN":3034, "NNGGA":3035, "NNGGG":3036, "NNGGT":3037, "NNGGC":3038, "NNGGN":3039, "NNGTA":3040, "NNGTG":3041, "NNGTT":3042, "NNGTC":3043, "NNGTN":3044, "NNGCA":3045, "NNGCG":3046, "NNGCT":3047, "NNGCC":3048, "NNGCN":3049, "NNGNA":3050, "NNGNG":3051, "NNGNT":3052, "NNGNC":3053, "NNGNN":3054, "NNTAA":3055, "NNTAG":3056, "NNTAT":3057, "NNTAC":3058, "NNTAN":3059, "NNTGA":3060, "NNTGG":3061, "NNTGT":3062, "NNTGC":3063, "NNTGN":3064, "NNTTA":3065, "NNTTG":3066, "NNTTT":3067, "NNTTC":3068, "NNTTN":3069, "NNTCA":3070, "NNTCG":3071, "NNTCT":3072, "NNTCC":3073, "NNTCN":3074, "NNTNA":3075, "NNTNG":3076, "NNTNT":3077, "NNTNC":3078, "NNTNN":3079, "NNCAA":3080, "NNCAG":3081, "NNCAT":3082, "NNCAC":3083, "NNCAN":3084, "NNCGA":3085, "NNCGG":3086, "NNCGT":3087, "NNCGC":3088, "NNCGN":3089, "NNCTA":3090, "NNCTG":3091, "NNCTT":3092, "NNCTC":3093, "NNCTN":3094, "NNCCA":3095, "NNCCG":3096, "NNCCT":3097, "NNCCC":3098, "NNCCN":3099, "NNCNA":3100, "NNCNG":3101, "NNCNT":3102, "NNCNC":3103, "NNCNN":3104, "NNNAA":3105, "NNNAG":3106, "NNNAT":3107, "NNNAC":3108, "NNNAN":3109, "NNNGA":3110, "NNNGG":3111, "NNNGT":3112, "NNNGC":3113, "NNNGN":3114, "NNNTA":3115, "NNNTG":3116, "NNNTT":3117, "NNNTC":3118, "NNNTN":3119, "NNNCA":3120, "NNNCG":3121, "NNNCT":3122, "NNNCC":3123, "NNNCN":3124, "NNNNA":3125, "NNNNG":3126, "NNNNT":3127, "NNNNC":3128, "NNNNN":3129
}