[PAD]
[UNK]
[CLS]
[SEP]
[MSK]
AAAAA
AAAAG
AAAAT
AAAAC
AAAAN
AAAGA
AAAGG
AAAGT
AAAGC
AAAGN
AAATA
AAATG
AAATT
AAATC
AAATN
AAACA
AAACG
AAACT
AAACC
AAACN
AAANA
AAANG
AAANT
AAANC
AAANN
AAGAA
AAGAG
AAGAT
AAGAC
AAGAN
AAGGA
AAGGG
AAGGT
AAGGC
AAGGN
AAGTA
AAGTG
AAGTT
AAGTC
AAGTN
AAGCA
AAGCG
AAGCT
AAGCC
AAGCN
AAGNA
AAGNG
AAGNT
AAGNC
AAGNN
AATAA
AATAG
AATAT
AATAC
AATAN
AATGA
AATGG
AATGT
AATGC
AATGN
AATTA
AATTG
AATTT
AATTC
AATTN
AATCA
AATCG
AATCT
AATCC
AATCN
AATNA
AATNG
AATNT
AATNC
AATNN
AACAA
AACAG
AACAT
AACAC
AACAN
AACGA
AACGG
AACGT
AACGC
AACGN
AACTA
AACTG
AACTT
AACTC
AACTN
AACCA
AACCG
AACCT
AACCC
AACCN
AACNA
AACNG
AACNT
AACNC
AACNN
AANAA
AANAG
AANAT
AANAC
AANAN
AANGA
AANGG
AANGT
AANGC
AANGN
AANTA
AANTG
AANTT
AANTC
AANTN
AANCA
AANCG
AANCT
AANCC
AANCN
AANNA
AANNG
AANNT
AANNC
AANNN
AGAAA
AGAAG
AGAAT
AGAAC
AGAAN
AGAGA
AGAGG
AGAGT
AGAGC
AGAGN
AGATA
AGATG
AGATT
AGATC
AGATN
AGACA
AGACG
AGACT
AGACC
AGACN
AGANA
AGANG
AGANT
AGANC
AGANN
AGGAA
AGGAG
AGGAT
AGGAC
AGGAN
AGGGA
AGGGG
AGGGT
AGGGC
AGGGN
AGGTA
AGGTG
AGGTT
AGGTC
AGGTN
AGGCA
AGGCG
AGGCT
AGGCC
AGGCN
AGGNA
AGGNG
AGGNT
AGGNC
AGGNN
AGTAA
AGTAG
AGTAT
AGTAC
AGTAN
AGTGA
AGTGG
AGTGT
AGTGC
AGTGN
AGTTA
AGTTG
AGTTT
AGTTC
AGTTN
AGTCA
AGTCG
AGTCT
AGTCC
AGTCN
AGTNA
AGTNG
AGTNT
AGTNC
AGTNN
AGCAA
AGCAG
AGCAT
AGCAC
AGCAN
AGCGA
AGCGG
AGCGT
AGCGC
AGCGN
AGCTA
AGCTG
AGCTT
AGCTC
AGCTN
AGCCA
AGCCG
AGCCT
AGCCC
AGCCN
AGCNA
AGCNG
AGCNT
AGCNC
AGCNN
AGNAA
AGNAG
AGNAT
AGNAC
AGNAN
AGNGA
AGNGG
AGNGT
AGNGC
AGNGN
AGNTA
AGNTG
AGNTT
AGNTC
AGNTN
AGNCA
AGNCG
AGNCT
AGNCC
AGNCN
AGNNA
AGNNG
AGNNT
AGNNC
AGNNN
ATAAA
ATAAG
ATAAT
ATAAC
ATAAN
ATAGA
ATAGG
ATAGT
ATAGC
ATAGN
ATATA
ATATG
ATATT
ATATC
ATATN
ATACA
ATACG
ATACT
ATACC
ATACN
ATANA
ATANG
ATANT
ATANC
ATANN
ATGAA
ATGAG
ATGAT
ATGAC
ATGAN
ATGGA
ATGGG
ATGGT
ATGGC
ATGGN
ATGTA
ATGTG
ATGTT
ATGTC
ATGTN
ATGCA
ATGCG
ATGCT
ATGCC
ATGCN
ATGNA
ATGNG
ATGNT
ATGNC
ATGNN
ATTAA
ATTAG
ATTAT
ATTAC
ATTAN
ATTGA
ATTGG
ATTGT
ATTGC
ATTGN
ATTTA
ATTTG
ATTTT
ATTTC
ATTTN
ATTCA
ATTCG
ATTCT
ATTCC
ATTCN
ATTNA
ATTNG
ATTNT
ATTNC
ATTNN
ATCAA
ATCAG
ATCAT
ATCAC
ATCAN
ATCGA
ATCGG
ATCGT
ATCGC
ATCGN
ATCTA
ATCTG
ATCTT
ATCTC
ATCTN
ATCCA
ATCCG
ATCCT
ATCCC
ATCCN
ATCNA
ATCNG
ATCNT
ATCNC
ATCNN
ATNAA
ATNAG
ATNAT
ATNAC
ATNAN
ATNGA
ATNGG
ATNGT
ATNGC
ATNGN
ATNTA
ATNTG
ATNTT
ATNTC
ATNTN
ATNCA
ATNCG
ATNCT
ATNCC
ATNCN
ATNNA
ATNNG
ATNNT
ATNNC
ATNNN
ACAAA
ACAAG
ACAAT
ACAAC
ACAAN
ACAGA
ACAGG
ACAGT
ACAGC
ACAGN
ACATA
ACATG
ACATT
ACATC
ACATN
ACACA
ACACG
ACACT
ACACC
ACACN
ACANA
ACANG
ACANT
ACANC
ACANN
ACGAA
ACGAG
ACGAT
ACGAC
ACGAN
ACGGA
ACGGG
ACGGT
ACGGC
ACGGN
ACGTA
ACGTG
ACGTT
ACGTC
ACGTN
ACGCA
ACGCG
ACGCT
ACGCC
ACGCN
ACGNA
ACGNG
ACGNT
ACGNC
ACGNN
ACTAA
ACTAG
ACTAT
ACTAC
ACTAN
ACTGA
ACTGG
ACTGT
ACTGC
ACTGN
ACTTA
ACTTG
ACTTT
ACTTC
ACTTN
ACTCA
ACTCG
ACTCT
ACTCC
ACTCN
ACTNA
ACTNG
ACTNT
ACTNC
ACTNN
ACCAA
ACCAG
ACCAT
ACCAC
ACCAN
ACCGA
ACCGG
ACCGT
ACCGC
ACCGN
ACCTA
ACCTG
ACCTT
ACCTC
ACCTN
ACCCA
ACCCG
ACCCT
ACCCC
ACCCN
ACCNA
ACCNG
ACCNT
ACCNC
ACCNN
ACNAA
ACNAG
ACNAT
ACNAC
ACNAN
ACNGA
ACNGG
ACNGT
ACNGC
ACNGN
ACNTA
ACNTG
ACNTT
ACNTC
ACNTN
ACNCA
ACNCG
ACNCT
ACNCC
ACNCN
ACNNA
ACNNG
ACNNT
ACNNC
ACNNN
ANAAA
ANAAG
ANAAT
ANAAC
ANAAN
ANAGA
ANAGG
ANAGT
ANAGC
ANAGN
ANATA
ANATG
ANATT
ANATC
ANATN
ANACA
ANACG
ANACT
ANACC
ANACN
ANANA
ANANG
ANANT
ANANC
ANANN
ANGAA
ANGAG
ANGAT
ANGAC
ANGAN
ANGGA
ANGGG
ANGGT
ANGGC
ANGGN
ANGTA
ANGTG
ANGTT
ANGTC
ANGTN
ANGCA
ANGCG
ANGCT
ANGCC
ANGCN
ANGNA
ANGNG
ANGNT
ANGNC
ANGNN
ANTAA
ANTAG
ANTAT
ANTAC
ANTAN
ANTGA
ANTGG
ANTGT
ANTGC
ANTGN
ANTTA
ANTTG
ANTTT
ANTTC
ANTTN
ANTCA
ANTCG
ANTCT
ANTCC
ANTCN
ANTNA
ANTNG
ANTNT
ANTNC
ANTNN
ANCAA
ANCAG
ANCAT
ANCAC
ANCAN
ANCGA
ANCGG
ANCGT
ANCGC
ANCGN
ANCTA
ANCTG
ANCTT
ANCTC
ANCTN
ANCCA
ANCCG
ANCCT
ANCCC
ANCCN
ANCNA
ANCNG
ANCNT
ANCNC
ANCNN
ANNAA
ANNAG
ANNAT
ANNAC
ANNAN
ANNGA
ANNGG
ANNGT
ANNGC
ANNGN
ANNTA
ANNTG
ANNTT
ANNTC
ANNTN
ANNCA
ANNCG
ANNCT
ANNCC
ANNCN
ANNNA
ANNNG
ANNNT
ANNNC
ANNNN
GAAAA
GAAAG
GAAAT
GAAAC
GAAAN
GAAGA
GAAGG
GAAGT
GAAGC
GAAGN
GAATA
GAATG
GAATT
GAATC
GAATN
GAACA
GAACG
GAACT
GAACC
GAACN
GAANA
GAANG
GAANT
GAANC
GAANN
GAGAA
GAGAG
GAGAT
GAGAC
GAGAN
GAGGA
GAGGG
GAGGT
GAGGC
GAGGN
GAGTA
GAGTG
GAGTT
GAGTC
GAGTN
GAGCA
GAGCG
GAGCT
GAGCC
GAGCN
GAGNA
GAGNG
GAGNT
GAGNC
GAGNN
GATAA
GATAG
GATAT
GATAC
GATAN
GATGA
GATGG
GATGT
GATGC
GATGN
GATTA
GATTG
GATTT
GATTC
GATTN
GATCA
GATCG
GATCT
GATCC
GATCN
GATNA
GATNG
GATNT
GATNC
GATNN
GACAA
GACAG
GACAT
GACAC
GACAN
GACGA
GACGG
GACGT
GACGC
GACGN
GACTA
GACTG
GACTT
GACTC
GACTN
GACCA
GACCG
GACCT
GACCC
GACCN
GACNA
GACNG
GACNT
GACNC
GACNN
GANAA
GANAG
GANAT
GANAC
GANAN
GANGA
GANGG
GANGT
GANGC
GANGN
GANTA
GANTG
GANTT
GANTC
GANTN
GANCA
GANCG
GANCT
GANCC
GANCN
GANNA
GANNG
GANNT
GANNC
GANNN
GGAAA
GGAAG
GGAAT
GGAAC
GGAAN
GGAGA
GGAGG
GGAGT
GGAGC
GGAGN
GGATA
GGATG
GGATT
GGATC
GGATN
GGACA
GGACG
GGACT
GGACC
GGACN
GGANA
GGANG
GGANT
GGANC
GGANN
GGGAA
GGGAG
GGGAT
GGGAC
GGGAN
GGGGA
GGGGG
GGGGT
GGGGC
GGGGN
GGGTA
GGGTG
GGGTT
GGGTC
GGGTN
GGGCA
GGGCG
GGGCT
GGGCC
GGGCN
GGGNA
GGGNG
GGGNT
GGGNC
GGGNN
GGTAA
GGTAG
GGTAT
GGTAC
GGTAN
GGTGA
GGTGG
GGTGT
GGTGC
GGTGN
GGTTA
GGTTG
GGTTT
GGTTC
GGTTN
GGTCA
GGTCG
GGTCT
GGTCC
GGTCN
GGTNA
GGTNG
GGTNT
GGTNC
GGTNN
GGCAA
GGCAG
GGCAT
GGCAC
GGCAN
GGCGA
GGCGG
GGCGT
GGCGC
GGCGN
GGCTA
GGCTG
GGCTT
GGCTC
GGCTN
GGCCA
GGCCG
GGCCT
GGCCC
GGCCN
GGCNA
GGCNG
GGCNT
GGCNC
GGCNN
GGNAA
GGNAG
GGNAT
GGNAC
GGNAN
GGNGA
GGNGG
GGNGT
GGNGC
GGNGN
GGNTA
GGNTG
GGNTT
GGNTC
GGNTN
GGNCA
GGNCG
GGNCT
GGNCC
GGNCN
GGNNA
GGNNG
GGNNT
GGNNC
GGNNN
GTAAA
GTAAG
GTAAT
GTAAC
GTAAN
GTAGA
GTAGG
GTAGT
GTAGC
GTAGN
GTATA
GTATG
GTATT
GTATC
GTATN
GTACA
GTACG
GTACT
GTACC
GTACN
GTANA
GTANG
GTANT
GTANC
GTANN
GTGAA
GTGAG
GTGAT
GTGAC
GTGAN
GTGGA
GTGGG
GTGGT
GTGGC
GTGGN
GTGTA
GTGTG
GTGTT
GTGTC
GTGTN
GTGCA
GTGCG
GTGCT
GTGCC
GTGCN
GTGNA
GTGNG
GTGNT
GTGNC
GTGNN
GTTAA
GTTAG
GTTAT
GTTAC
GTTAN
GTTGA
GTTGG
GTTGT
GTTGC
GTTGN
GTTTA
GTTTG
GTTTT
GTTTC
GTTTN
GTTCA
GTTCG
GTTCT
GTTCC
GTTCN
GTTNA
GTTNG
GTTNT
GTTNC
GTTNN
GTCAA
GTCAG
GTCAT
GTCAC
GTCAN
GTCGA
GTCGG
GTCGT
GTCGC
GTCGN
GTCTA
GTCTG
GTCTT
GTCTC
GTCTN
GTCCA
GTCCG
GTCCT
GTCCC
GTCCN
GTCNA
GTCNG
GTCNT
GTCNC
GTCNN
GTNAA
GTNAG
GTNAT
GTNAC
GTNAN
GTNGA
GTNGG
GTNGT
GTNGC
GTNGN
GTNTA
GTNTG
GTNTT
GTNTC
GTNTN
GTNCA
GTNCG
GTNCT
GTNCC
GTNCN
GTNNA
GTNNG
GTNNT
GTNNC
GTNNN
GCAAA
GCAAG
GCAAT
GCAAC
GCAAN
GCAGA
GCAGG
GCAGT
GCAGC
GCAGN
GCATA
GCATG
GCATT
GCATC
GCATN
GCACA
GCACG
GCACT
GCACC
GCACN
GCANA
GCANG
GCANT
GCANC
GCANN
GCGAA
GCGAG
GCGAT
GCGAC
GCGAN
GCGGA
GCGGG
GCGGT
GCGGC
GCGGN
GCGTA
GCGTG
GCGTT
GCGTC
GCGTN
GCGCA
GCGCG
GCGCT
GCGCC
GCGCN
GCGNA
GCGNG
GCGNT
GCGNC
GCGNN
GCTAA
GCTAG
GCTAT
GCTAC
GCTAN
GCTGA
GCTGG
GCTGT
GCTGC
GCTGN
GCTTA
GCTTG
GCTTT
GCTTC
GCTTN
GCTCA
GCTCG
GCTCT
GCTCC
GCTCN
GCTNA
GCTNG
GCTNT
GCTNC
GCTNN
GCCAA
GCCAG
GCCAT
GCCAC
GCCAN
GCCGA
GCCGG
GCCGT
GCCGC
GCCGN
GCCTA
GCCTG
GCCTT
GCCTC
GCCTN
GCCCA
GCCCG
GCCCT
GCCCC
GCCCN
GCCNA
GCCNG
GCCNT
GCCNC
GCCNN
GCNAA
GCNAG
GCNAT
GCNAC
GCNAN
GCNGA
GCNGG
GCNGT
GCNGC
GCNGN
GCNTA
GCNTG
GCNTT
GCNTC
GCNTN
GCNCA
GCNCG
GCNCT
GCNCC
GCNCN
GCNNA
GCNNG
GCNNT
GCNNC
GCNNN
GNAAA
GNAAG
GNAAT
GNAAC
GNAAN
GNAGA
GNAGG
GNAGT
GNAGC
GNAGN
GNATA
GNATG
GNATT
GNATC
GNATN
GNACA
GNACG
GNACT
GNACC
GNACN
GNANA
GNANG
GNANT
GNANC
GNANN
GNGAA
GNGAG
GNGAT
GNGAC
GNGAN
GNGGA
GNGGG
GNGGT
GNGGC
GNGGN
GNGTA
GNGTG
GNGTT
GNGTC
GNGTN
GNGCA
GNGCG
GNGCT
GNGCC
GNGCN
GNGNA
GNGNG
GNGNT
GNGNC
GNGNN
GNTAA
GNTAG
GNTAT
GNTAC
GNTAN
GNTGA
GNTGG
GNTGT
GNTGC
GNTGN
GNTTA
GNTTG
GNTTT
GNTTC
GNTTN
GNTCA
GNTCG
GNTCT
GNTCC
GNTCN
GNTNA
GNTNG
GNTNT
GNTNC
GNTNN
GNCAA
GNCAG
GNCAT
GNCAC
GNCAN
GNCGA
GNCGG
GNCGT
GNCGC
GNCGN
GNCTA
GNCTG
GNCTT
GNCTC
GNCTN
GNCCA
GNCCG
GNCCT
GNCCC
GNCCN
GNCNA
GNCNG
GNCNT
GNCNC
GNCNN
GNNAA
GNNAG
GNNAT
GNNAC
GNNAN
GNNGA
GNNGG
GNNGT
GNNGC
GNNGN
GNNTA
GNNTG
GNNTT
GNNTC
GNNTN
GNNCA
GNNCG
GNNCT
GNNCC
GNNCN
GNNNA
GNNNG
GNNNT
GNNNC
GNNNN
TAAAA
TAAAG
TAAAT
TAAAC
TAAAN
TAAGA
TAAGG
TAAGT
TAAGC
TAAGN
TAATA
TAATG
TAATT
TAATC
TAATN
TAACA
TAACG
TAACT
TAACC
TAACN
TAANA
TAANG
TAANT
TAANC
TAANN
TAGAA
TAGAG
TAGAT
TAGAC
TAGAN
TAGGA
TAGGG
TAGGT
TAGGC
TAGGN
TAGTA
TAGTG
TAGTT
TAGTC
TAGTN
TAGCA
TAGCG
TAGCT
TAGCC
TAGCN
TAGNA
TAGNG
TAGNT
TAGNC
TAGNN
TATAA
TATAG
TATAT
TATAC
TATAN
TATGA
TATGG
TATGT
TATGC
TATGN
TATTA
TATTG
TATTT
TATTC
TATTN
TATCA
TATCG
TATCT
TATCC
TATCN
TATNA
TATNG
TATNT
TATNC
TATNN
TACAA
TACAG
TACAT
TACAC
TACAN
TACGA
TACGG
TACGT
TACGC
TACGN
TACTA
TACTG
TACTT
TACTC
TACTN
TACCA
TACCG
TACCT
TACCC
TACCN
TACNA
TACNG
TACNT
TACNC
TACNN
TANAA
TANAG
TANAT
TANAC
TANAN
TANGA
TANGG
TANGT
TANGC
TANGN
TANTA
TANTG
TANTT
TANTC
TANTN
TANCA
TANCG
TANCT
TANCC
TANCN
TANNA
TANNG
TANNT
TANNC
TANNN
TGAAA
TGAAG
TGAAT
TGAAC
TGAAN
TGAGA
TGAGG
TGAGT
TGAGC
TGAGN
TGATA
TGATG
TGATT
TGATC
TGATN
TGACA
TGACG
TGACT
TGACC
TGACN
TGANA
TGANG
TGANT
TGANC
TGANN
TGGAA
TGGAG
TGGAT
TGGAC
TGGAN
TGGGA
TGGGG
TGGGT
TGGGC
TGGGN
TGGTA
TGGTG
TGGTT
TGGTC
TGGTN
TGGCA
TGGCG
TGGCT
TGGCC
TGGCN
TGGNA
TGGNG
TGGNT
TGGNC
TGGNN
TGTAA
TGTAG
TGTAT
TGTAC
TGTAN
TGTGA
TGTGG
TGTGT
TGTGC
TGTGN
TGTTA
TGTTG
TGTTT
TGTTC
TGTTN
TGTCA
TGTCG
TGTCT
TGTCC
TGTCN
TGTNA
TGTNG
TGTNT
TGTNC
TGTNN
TGCAA
TGCAG
TGCAT
TGCAC
TGCAN
TGCGA
TGCGG
TGCGT
TGCGC
TGCGN
TGCTA
TGCTG
TGCTT
TGCTC
TGCTN
TGCCA
TGCCG
TGCCT
TGCCC
TGCCN
TGCNA
TGCNG
TGCNT
TGCNC
TGCNN
TGNAA
TGNAG
TGNAT
TGNAC
TGNAN
TGNGA
TGNGG
TGNGT
TGNGC
TGNGN
TGNTA
TGNTG
TGNTT
TGNTC
TGNTN
TGNCA
TGNCG
TGNCT
TGNCC
TGNCN
TGNNA
TGNNG
TGNNT
TGNNC
TGNNN
TTAAA
TTAAG
TTAAT
TTAAC
TTAAN
TTAGA
TTAGG
TTAGT
TTAGC
TTAGN
TTATA
TTATG
TTATT
TTATC
TTATN
TTACA
TTACG
TTACT
TTACC
TTACN
TTANA
TTANG
TTANT
TTANC
TTANN
TTGAA
TTGAG
TTGAT
TTGAC
TTGAN
TTGGA
TTGGG
TTGGT
TTGGC
TTGGN
TTGTA
TTGTG
TTGTT
TTGTC
TTGTN
TTGCA
TTGCG
TTGCT
TTGCC
TTGCN
TTGNA
TTGNG
TTGNT
TTGNC
TTGNN
TTTAA
TTTAG
TTTAT
TTTAC
TTTAN
TTTGA
TTTGG
TTTGT
TTTGC
TTTGN
TTTTA
TTTTG
TTTTT
TTTTC
TTTTN
TTTCA
TTTCG
TTTCT
TTTCC
TTTCN
TTTNA
TTTNG
TTTNT
TTTNC
TTTNN
TTCAA
TTCAG
TTCAT
TTCAC
TTCAN
TTCGA
TTCGG
TTCGT
TTCGC
TTCGN
TTCTA
TTCTG
TTCTT
TTCTC
TTCTN
TTCCA
TTCCG
TTCCT
TTCCC
TTCCN
TTCNA
TTCNG
TTCNT
TTCNC
TTCNN
TTNAA
TTNAG
TTNAT
TTNAC
TTNAN
TTNGA
TTNGG
TTNGT
TTNGC
TTNGN
TTNTA
TTNTG
TTNTT
TTNTC
TTNTN
TTNCA
TTNCG
TTNCT
TTNCC
TTNCN
TTNNA
TTNNG
TTNNT
TTNNC
TTNNN
TCAAA
TCAAG
TCAAT
TCAAC
TCAAN
TCAGA
TCAGG
TCAGT
TCAGC
TCAGN
TCATA
TCATG
TCATT
TCATC
TCATN
TCACA
TCACG
TCACT
TCACC
TCACN
TCANA
TCANG
TCANT
TCANC
TCANN
TCGAA
TCGAG
TCGAT
TCGAC
TCGAN
TCGGA
TCGGG
TCGGT
TCGGC
TCGGN
TCGTA
TCGTG
TCGTT
TCGTC
TCGTN
TCGCA
TCGCG
TCGCT
TCGCC
TCGCN
TCGNA
TCGNG
TCGNT
TCGNC
TCGNN
TCTAA
TCTAG
TCTAT
TCTAC
TCTAN
TCTGA
TCTGG
TCTGT
TCTGC
TCTGN
TCTTA
TCTTG
TCTTT
TCTTC
TCTTN
TCTCA
TCTCG
TCTCT
TCTCC
TCTCN
TCTNA
TCTNG
TCTNT
TCTNC
TCTNN
TCCAA
TCCAG
TCCAT
TCCAC
TCCAN
TCCGA
TCCGG
TCCGT
TCCGC
TCCGN
TCCTA
TCCTG
TCCTT
TCCTC
TCCTN
TCCCA
TCCCG
TCCCT
TCCCC
TCCCN
TCCNA
TCCNG
TCCNT
TCCNC
TCCNN
TCNAA
TCNAG
TCNAT
TCNAC
TCNAN
TCNGA
TCNGG
TCNGT
TCNGC
TCNGN
TCNTA
TCNTG
TCNTT
TCNTC
TCNTN
TCNCA
TCNCG
TCNCT
TCNCC
TCNCN
TCNNA
TCNNG
TCNNT
TCNNC
TCNNN
TNAAA
TNAAG
TNAAT
TNAAC
TNAAN
TNAGA
TNAGG
TNAGT
TNAGC
TNAGN
TNATA
TNATG
TNATT
TNATC
TNATN
TNACA
TNACG
TNACT
TNACC
TNACN
TNANA
TNANG
TNANT
TNANC
TNANN
TNGAA
TNGAG
TNGAT
TNGAC
TNGAN
TNGGA
TNGGG
TNGGT
TNGGC
TNGGN
TNGTA
TNGTG
TNGTT
TNGTC
TNGTN
TNGCA
TNGCG
TNGCT
TNGCC
TNGCN
TNGNA
TNGNG
TNGNT
TNGNC
TNGNN
TNTAA
TNTAG
TNTAT
TNTAC
TNTAN
TNTGA
TNTGG
TNTGT
TNTGC
TNTGN
TNTTA
TNTTG
TNTTT
TNTTC
TNTTN
TNTCA
TNTCG
TNTCT
TNTCC
TNTCN
TNTNA
TNTNG
TNTNT
TNTNC
TNTNN
TNCAA
TNCAG
TNCAT
TNCAC
TNCAN
TNCGA
TNCGG
TNCGT
TNCGC
TNCGN
TNCTA
TNCTG
TNCTT
TNCTC
TNCTN
TNCCA
TNCCG
TNCCT
TNCCC
TNCCN
TNCNA
TNCNG
TNCNT
TNCNC
TNCNN
TNNAA
TNNAG
TNNAT
TNNAC
TNNAN
TNNGA
TNNGG
TNNGT
TNNGC
TNNGN
TNNTA
TNNTG
TNNTT
TNNTC
TNNTN
TNNCA
TNNCG
TNNCT
TNNCC
TNNCN
TNNNA
TNNNG
TNNNT
TNNNC
TNNNN
CAAAA
CAAAG
CAAAT
CAAAC
CAAAN
CAAGA
CAAGG
CAAGT
CAAGC
CAAGN
CAATA
CAATG
CAATT
CAATC
CAATN
CAACA
CAACG
CAACT
CAACC
CAACN
CAANA
CAANG
CAANT
CAANC
CAANN
CAGAA
CAGAG
CAGAT
CAGAC
CAGAN
CAGGA
CAGGG
CAGGT
CAGGC
CAGGN
CAGTA
CAGTG
CAGTT
CAGTC
CAGTN
CAGCA
CAGCG
CAGCT
CAGCC
CAGCN
CAGNA
CAGNG
CAGNT
CAGNC
CAGNN
CATAA
CATAG
CATAT
CATAC
CATAN
CATGA
CATGG
CATGT
CATGC
CATGN
CATTA
CATTG
CATTT
CATTC
CATTN
CATCA
CATCG
CATCT
CATCC
CATCN
CATNA
CATNG
CATNT
CATNC
CATNN
CACAA
CACAG
CACAT
CACAC
CACAN
CACGA
CACGG
CACGT
CACGC
CACGN
CACTA
CACTG
CACTT
CACTC
CACTN
CACCA
CACCG
CACCT
CACCC
CACCN
CACNA
CACNG
CACNT
CACNC
CACNN
CANAA
CANAG
CANAT
CANAC
CANAN
CANGA
CANGG
CANGT
CANGC
CANGN
CANTA
CANTG
CANTT
CANTC
CANTN
CANCA
CANCG
CANCT
CANCC
CANCN
CANNA
CANNG
CANNT
CANNC
CANNN
CGAAA
CGAAG
CGAAT
CGAAC
CGAAN
CGAGA
CGAGG
CGAGT
CGAGC
CGAGN
CGATA
CGATG
CGATT
CGATC
CGATN
CGACA
CGACG
CGACT
CGACC
CGACN
CGANA
CGANG
CGANT
CGANC
CGANN
CGGAA
CGGAG
CGGAT
CGGAC
CGGAN
CGGGA
CGGGG
CGGGT
CGGGC
CGGGN
CGGTA
CGGTG
CGGTT
CGGTC
CGGTN
CGGCA
CGGCG
CGGCT
CGGCC
CGGCN
CGGNA
CGGNG
CGGNT
CGGNC
CGGNN
CGTAA
CGTAG
CGTAT
CGTAC
CGTAN
CGTGA
CGTGG
CGTGT
CGTGC
CGTGN
CGTTA
CGTTG
CGTTT
CGTTC
CGTTN
CGTCA
CGTCG
CGTCT
CGTCC
CGTCN
CGTNA
CGTNG
CGTNT
CGTNC
CGTNN
CGCAA
CGCAG
CGCAT
CGCAC
CGCAN
CGCGA
CGCGG
CGCGT
CGCGC
CGCGN
CGCTA
CGCTG
CGCTT
CGCTC
CGCTN
CGCCA
CGCCG
CGCCT
CGCCC
CGCCN
CGCNA
CGCNG
CGCNT
CGCNC
CGCNN
CGNAA
CGNAG
CGNAT
CGNAC
CGNAN
CGNGA
CGNGG
CGNGT
CGNGC
CGNGN
CGNTA
CGNTG
CGNTT
CGNTC
CGNTN
CGNCA
CGNCG
CGNCT
CGNCC
CGNCN
CGNNA
CGNNG
CGNNT
CGNNC
CGNNN
CTAAA
CTAAG
CTAAT
CTAAC
CTAAN
CTAGA
CTAGG
CTAGT
CTAGC
CTAGN
CTATA
CTATG
CTATT
CTATC
CTATN
CTACA
CTACG
CTACT
CTACC
CTACN
CTANA
CTANG
CTANT
CTANC
CTANN
CTGAA
CTGAG
CTGAT
CTGAC
CTGAN
CTGGA
CTGGG
CTGGT
CTGGC
CTGGN
CTGTA
CTGTG
CTGTT
CTGTC
CTGTN
CTGCA
CTGCG
CTGCT
CTGCC
CTGCN
CTGNA
CTGNG
CTGNT
CTGNC
CTGNN
CTTAA
CTTAG
CTTAT
CTTAC
CTTAN
CTTGA
CTTGG
CTTGT
CTTGC
CTTGN
CTTTA
CTTTG
CTTTT
CTTTC
CTTTN
CTTCA
CTTCG
CTTCT
CTTCC
CTTCN
CTTNA
CTTNG
CTTNT
CTTNC
CTTNN
CTCAA
CTCAG
CTCAT
CTCAC
CTCAN
CTCGA
CTCGG
CTCGT
CTCGC
CTCGN
CTCTA
CTCTG
CTCTT
CTCTC
CTCTN
CTCCA
CTCCG
CTCCT
CTCCC
CTCCN
CTCNA
CTCNG
CTCNT
CTCNC
CTCNN
CTNAA
CTNAG
CTNAT
CTNAC
CTNAN
CTNGA
CTNGG
CTNGT
CTNGC
CTNGN
CTNTA
CTNTG
CTNTT
CTNTC
CTNTN
CTNCA
CTNCG
CTNCT
CTNCC
CTNCN
CTNNA
CTNNG
CTNNT
CTNNC
CTNNN
CCAAA
CCAAG
CCAAT
CCAAC
CCAAN
CCAGA
CCAGG
CCAGT
CCAGC
CCAGN
CCATA
CCATG
CCATT
CCATC
CCATN
CCACA
CCACG
CCACT
CCACC
CCACN
CCANA
CCANG
CCANT
CCANC
CCANN
CCGAA
CCGAG
CCGAT
CCGAC
CCGAN
CCGGA
CCGGG
CCGGT
CCGGC
CCGGN
CCGTA
CCGTG
CCGTT
CCGTC
CCGTN
CCGCA
CCGCG
CCGCT
CCGCC
CCGCN
CCGNA
CCGNG
CCGNT
CCGNC
CCGNN
CCTAA
CCTAG
CCTAT
CCTAC
CCTAN
CCTGA
CCTGG
CCTGT
CCTGC
CCTGN
CCTTA
CCTTG
CCTTT
CCTTC
CCTTN
CCTCA
CCTCG
CCTCT
CCTCC
CCTCN
CCTNA
CCTNG
CCTNT
CCTNC
CCTNN
CCCAA
CCCAG
CCCAT
CCCAC
CCCAN
CCCGA
CCCGG
CCCGT
CCCGC
CCCGN
CCCTA
CCCTG
CCCTT
CCCTC
CCCTN
CCCCA
CCCCG
CCCCT
CCCCC
CCCCN
CCCNA
CCCNG
CCCNT
CCCNC
CCCNN
CCNAA
CCNAG
CCNAT
CCNAC
CCNAN
CCNGA
CCNGG
CCNGT
CCNGC
CCNGN
CCNTA
CCNTG
CCNTT
CCNTC
CCNTN
CCNCA
CCNCG
CCNCT
CCNCC
CCNCN
CCNNA
CCNNG
CCNNT
CCNNC
CCNNN
CNAAA
CNAAG
CNAAT
CNAAC
CNAAN
CNAGA
CNAGG
CNAGT
CNAGC
CNAGN
CNATA
CNATG
CNATT
CNATC
CNATN
CNACA
CNACG
CNACT
CNACC
CNACN
CNANA
CNANG
CNANT
CNANC
CNANN
CNGAA
CNGAG
CNGAT
CNGAC
CNGAN
CNGGA
CNGGG
CNGGT
CNGGC
CNGGN
CNGTA
CNGTG
CNGTT
CNGTC
CNGTN
CNGCA
CNGCG
CNGCT
CNGCC
CNGCN
CNGNA
CNGNG
CNGNT
CNGNC
CNGNN
CNTAA
CNTAG
CNTAT
CNTAC
CNTAN
CNTGA
CNTGG
CNTGT
CNTGC
CNTGN
CNTTA
CNTTG
CNTTT
CNTTC
CNTTN
CNTCA
CNTCG
CNTCT
CNTCC
CNTCN
CNTNA
CNTNG
CNTNT
CNTNC
CNTNN
CNCAA
CNCAG
CNCAT
CNCAC
CNCAN
CNCGA
CNCGG
CNCGT
CNCGC
CNCGN
CNCTA
CNCTG
CNCTT
CNCTC
CNCTN
CNCCA
CNCCG
CNCCT
CNCCC
CNCCN
CNCNA
CNCNG
CNCNT
CNCNC
CNCNN
CNNAA
CNNAG
CNNAT
CNNAC
CNNAN
CNNGA
CNNGG
CNNGT
CNNGC
CNNGN
CNNTA
CNNTG
CNNTT
CNNTC
CNNTN
CNNCA
CNNCG
CNNCT
CNNCC
CNNCN
CNNNA
CNNNG
CNNNT
CNNNC
CNNNN
NAAAA
NAAAG
NAAAT
NAAAC
NAAAN
NAAGA
NAAGG
NAAGT
NAAGC
NAAGN
NAATA
NAATG
NAATT
NAATC
NAATN
NAACA
NAACG
NAACT
NAACC
NAACN
NAANA
NAANG
NAANT
NAANC
NAANN
NAGAA
NAGAG
NAGAT
NAGAC
NAGAN
NAGGA
NAGGG
NAGGT
NAGGC
NAGGN
NAGTA
NAGTG
NAGTT
NAGTC
NAGTN
NAGCA
NAGCG
NAGCT
NAGCC
NAGCN
NAGNA
NAGNG
NAGNT
NAGNC
NAGNN
NATAA
NATAG
NATAT
NATAC
NATAN
NATGA
NATGG
NATGT
NATGC
NATGN
NATTA
NATTG
NATTT
NATTC
NATTN
NATCA
NATCG
NATCT
NATCC
NATCN
NATNA
NATNG
NATNT
NATNC
NATNN
NACAA
NACAG
NACAT
NACAC
NACAN
NACGA
NACGG
NACGT
NACGC
NACGN
NACTA
NACTG
NACTT
NACTC
NACTN
NACCA
NACCG
NACCT
NACCC
NACCN
NACNA
NACNG
NACNT
NACNC
NACNN
NANAA
NANAG
NANAT
NANAC
NANAN
NANGA
NANGG
NANGT
NANGC
NANGN
NANTA
NANTG
NANTT
NANTC
NANTN
NANCA
NANCG
NANCT
NANCC
NANCN
NANNA
NANNG
NANNT
NANNC
NANNN
NGAAA
NGAAG
NGAAT
NGAAC
NGAAN
NGAGA
NGAGG
NGAGT
NGAGC
NGAGN
NGATA
NGATG
NGATT
NGATC
NGATN
NGACA
NGACG
NGACT
NGACC
NGACN
NGANA
NGANG
NGANT
NGANC
NGANN
NGGAA
NGGAG
NGGAT
NGGAC
NGGAN
NGGGA
NGGGG
NGGGT
NGGGC
NGGGN
NGGTA
NGGTG
NGGTT
NGGTC
NGGTN
NGGCA
NGGCG
NGGCT
NGGCC
NGGCN
NGGNA
NGGNG
NGGNT
NGGNC
NGGNN
NGTAA
NGTAG
NGTAT
NGTAC
NGTAN
NGTGA
NGTGG
NGTGT
NGTGC
NGTGN
NGTTA
NGTTG
NGTTT
NGTTC
NGTTN
NGTCA
NGTCG
NGTCT
NGTCC
NGTCN
NGTNA
NGTNG
NGTNT
NGTNC
NGTNN
NGCAA
NGCAG
NGCAT
NGCAC
NGCAN
NGCGA
NGCGG
NGCGT
NGCGC
NGCGN
NGCTA
NGCTG
NGCTT
NGCTC
NGCTN
NGCCA
NGCCG
NGCCT
NGCCC
NGCCN
NGCNA
NGCNG
NGCNT
NGCNC
NGCNN
NGNAA
NGNAG
NGNAT
NGNAC
NGNAN
NGNGA
NGNGG
NGNGT
NGNGC
NGNGN
NGNTA
NGNTG
NGNTT
NGNTC
NGNTN
NGNCA
NGNCG
NGNCT
NGNCC
NGNCN
NGNNA
NGNNG
NGNNT
NGNNC
NGNNN
NTAAA
NTAAG
NTAAT
NTAAC
NTAAN
NTAGA
NTAGG
NTAGT
NTAGC
NTAGN
NTATA
NTATG
NTATT
NTATC
NTATN
NTACA
NTACG
NTACT
NTACC
NTACN
NTANA
NTANG
NTANT
NTANC
NTANN
NTGAA
NTGAG
NTGAT
NTGAC
NTGAN
NTGGA
NTGGG
NTGGT
NTGGC
NTGGN
NTGTA
NTGTG
NTGTT
NTGTC
NTGTN
NTGCA
NTGCG
NTGCT
NTGCC
NTGCN
NTGNA
NTGNG
NTGNT
NTGNC
NTGNN
NTTAA
NTTAG
NTTAT
NTTAC
NTTAN
NTTGA
NTTGG
NTTGT
NTTGC
NTTGN
NTTTA
NTTTG
NTTTT
NTTTC
NTTTN
NTTCA
NTTCG
NTTCT
NTTCC
NTTCN
NTTNA
NTTNG
NTTNT
NTTNC
NTTNN
NTCAA
NTCAG
NTCAT
NTCAC
NTCAN
NTCGA
NTCGG
NTCGT
NTCGC
NTCGN
NTCTA
NTCTG
NTCTT
NTCTC
NTCTN
NTCCA
NTCCG
NTCCT
NTCCC
NTCCN
NTCNA
NTCNG
NTCNT
NTCNC
NTCNN
NTNAA
NTNAG
NTNAT
NTNAC
NTNAN
NTNGA
NTNGG
NTNGT
NTNGC
NTNGN
NTNTA
NTNTG
NTNTT
NTNTC
NTNTN
NTNCA
NTNCG
NTNCT
NTNCC
NTNCN
NTNNA
NTNNG
NTNNT
NTNNC
NTNNN
NCAAA
NCAAG
NCAAT
NCAAC
NCAAN
NCAGA
NCAGG
NCAGT
NCAGC
NCAGN
NCATA
NCATG
NCATT
NCATC
NCATN
NCACA
NCACG
NCACT
NCACC
NCACN
NCANA
NCANG
NCANT
NCANC
NCANN
NCGAA
NCGAG
NCGAT
NCGAC
NCGAN
NCGGA
NCGGG
NCGGT
NCGGC
NCGGN
NCGTA
NCGTG
NCGTT
NCGTC
NCGTN
NCGCA
NCGCG
NCGCT
NCGCC
NCGCN
NCGNA
NCGNG
NCGNT
NCGNC
NCGNN
NCTAA
NCTAG
NCTAT
NCTAC
NCTAN
NCTGA
NCTGG
NCTGT
NCTGC
NCTGN
NCTTA
NCTTG
NCTTT
NCTTC
NCTTN
NCTCA
NCTCG
NCTCT
NCTCC
NCTCN
NCTNA
NCTNG
NCTNT
NCTNC
NCTNN
NCCAA
NCCAG
NCCAT
NCCAC
NCCAN
NCCGA
NCCGG
NCCGT
NCCGC
NCCGN
NCCTA
NCCTG
NCCTT
NCCTC
NCCTN
NCCCA
NCCCG
NCCCT
NCCCC
NCCCN
NCCNA
NCCNG
NCCNT
NCCNC
NCCNN
NCNAA
NCNAG
NCNAT
NCNAC
NCNAN
NCNGA
NCNGG
NCNGT
NCNGC
NCNGN
NCNTA
NCNTG
NCNTT
NCNTC
NCNTN
NCNCA
NCNCG
NCNCT
NCNCC
NCNCN
NCNNA
NCNNG
NCNNT
NCNNC
NCNNN
NNAAA
NNAAG
NNAAT
NNAAC
NNAAN
NNAGA
NNAGG
NNAGT
NNAGC
NNAGN
NNATA
NNATG
NNATT
NNATC
NNATN
NNACA
NNACG
NNACT
NNACC
NNACN
NNANA
NNANG
NNANT
NNANC
NNANN
NNGAA
NNGAG
NNGAT
NNGAC
NNGAN
NNGGA
NNGGG
NNGGT
NNGGC
NNGGN
NNGTA
NNGTG
NNGTT
NNGTC
NNGTN
NNGCA
NNGCG
NNGCT
NNGCC
NNGCN
NNGNA
NNGNG
NNGNT
NNGNC
NNGNN
NNTAA
NNTAG
NNTAT
NNTAC
NNTAN
NNTGA
NNTGG
NNTGT
NNTGC
NNTGN
NNTTA
NNTTG
NNTTT
NNTTC
NNTTN
NNTCA
NNTCG
NNTCT
NNTCC
NNTCN
NNTNA
NNTNG
NNTNT
NNTNC
NNTNN
NNCAA
NNCAG
NNCAT
NNCAC
NNCAN
NNCGA
NNCGG
NNCGT
NNCGC
NNCGN
NNCTA
NNCTG
NNCTT
NNCTC
NNCTN
NNCCA
NNCCG
NNCCT
NNCCC
NNCCN
NNCNA
NNCNG
NNCNT
NNCNC
NNCNN
NNNAA
NNNAG
NNNAT
NNNAC
NNNAN
NNNGA
NNNGG
NNNGT
NNNGC
NNNGN
NNNTA
NNNTG
NNNTT
NNNTC
NNNTN
NNNCA
NNNCG
NNNCT
NNNCC
NNNCN
NNNNA
NNNNG
NNNNT
NNNNC
NNNNN