[PAD]
[UNK]
[CLS]
[SEP]
[MSK]
AAAAAA
AAAAAG
AAAAAT
AAAAAC
AAAAAN
AAAAGA
AAAAGG
AAAAGT
AAAAGC
AAAAGN
AAAATA
AAAATG
AAAATT
AAAATC
AAAATN
AAAACA
AAAACG
AAAACT
AAAACC
AAAACN
AAAANA
AAAANG
AAAANT
AAAANC
AAAANN
AAAGAA
AAAGAG
AAAGAT
AAAGAC
AAAGAN
AAAGGA
AAAGGG
AAAGGT
AAAGGC
AAAGGN
AAAGTA
AAAGTG
AAAGTT
AAAGTC
AAAGTN
AAAGCA
AAAGCG
AAAGCT
AAAGCC
AAAGCN
AAAGNA
AAAGNG
AAAGNT
AAAGNC
AAAGNN
AAATAA
AAATAG
AAATAT
AAATAC
AAATAN
AAATGA
AAATGG
AAATGT
AAATGC
AAATGN
AAATTA
AAATTG
AAATTT
AAATTC
AAATTN
AAATCA
AAATCG
AAATCT
AAATCC
AAATCN
AAATNA
AAATNG
AAATNT
AAATNC
AAATNN
AAACAA
AAACAG
AAACAT
AAACAC
AAACAN
AAACGA
AAACGG
AAACGT
AAACGC
AAACGN
AAACTA
AAACTG
AAACTT
AAACTC
AAACTN
AAACCA
AAACCG
AAACCT
AAACCC
AAACCN
AAACNA
AAACNG
AAACNT
AAACNC
AAACNN
AAANAA
AAANAG
AAANAT
AAANAC
AAANAN
AAANGA
AAANGG
AAANGT
AAANGC
AAANGN
AAANTA
AAANTG
AAANTT
AAANTC
AAANTN
AAANCA
AAANCG
AAANCT
AAANCC
AAANCN
AAANNA
AAANNG
AAANNT
AAANNC
AAANNN
AAGAAA
AAGAAG
AAGAAT
AAGAAC
AAGAAN
AAGAGA
AAGAGG
AAGAGT
AAGAGC
AAGAGN
AAGATA
AAGATG
AAGATT
AAGATC
AAGATN
AAGACA
AAGACG
AAGACT
AAGACC
AAGACN
AAGANA
AAGANG
AAGANT
AAGANC
AAGANN
AAGGAA
AAGGAG
AAGGAT
AAGGAC
AAGGAN
AAGGGA
AAGGGG
AAGGGT
AAGGGC
AAGGGN
AAGGTA
AAGGTG
AAGGTT
AAGGTC
AAGGTN
AAGGCA
AAGGCG
AAGGCT
AAGGCC
AAGGCN
AAGGNA
AAGGNG
AAGGNT
AAGGNC
AAGGNN
AAGTAA
AAGTAG
AAGTAT
AAGTAC
AAGTAN
AAGTGA
AAGTGG
AAGTGT
AAGTGC
AAGTGN
AAGTTA
AAGTTG
AAGTTT
AAGTTC
AAGTTN
AAGTCA
AAGTCG
AAGTCT
AAGTCC
AAGTCN
AAGTNA
AAGTNG
AAGTNT
AAGTNC
AAGTNN
AAGCAA
AAGCAG
AAGCAT
AAGCAC
AAGCAN
AAGCGA
AAGCGG
AAGCGT
AAGCGC
AAGCGN
AAGCTA
AAGCTG
AAGCTT
AAGCTC
AAGCTN
AAGCCA
AAGCCG
AAGCCT
AAGCCC
AAGCCN
AAGCNA
AAGCNG
AAGCNT
AAGCNC
AAGCNN
AAGNAA
AAGNAG
AAGNAT
AAGNAC
AAGNAN
AAGNGA
AAGNGG
AAGNGT
AAGNGC
AAGNGN
AAGNTA
AAGNTG
AAGNTT
AAGNTC
AAGNTN
AAGNCA
AAGNCG
AAGNCT
AAGNCC
AAGNCN
AAGNNA
AAGNNG
AAGNNT
AAGNNC
AAGNNN
AATAAA
AATAAG
AATAAT
AATAAC
AATAAN
AATAGA
AATAGG
AATAGT
AATAGC
AATAGN
AATATA
AATATG
AATATT
AATATC
AATATN
AATACA
AATACG
AATACT
AATACC
AATACN
AATANA
AATANG
AATANT
AATANC
AATANN
AATGAA
AATGAG
AATGAT
AATGAC
AATGAN
AATGGA
AATGGG
AATGGT
AATGGC
AATGGN
AATGTA
AATGTG
AATGTT
AATGTC
AATGTN
AATGCA
AATGCG
AATGCT
AATGCC
AATGCN
AATGNA
AATGNG
AATGNT
AATGNC
AATGNN
AATTAA
AATTAG
AATTAT
AATTAC
AATTAN
AATTGA
AATTGG
AATTGT
AATTGC
AATTGN
AATTTA
AATTTG
AATTTT
AATTTC
AATTTN
AATTCA
AATTCG
AATTCT
AATTCC
AATTCN
AATTNA
AATTNG
AATTNT
AATTNC
AATTNN
AATCAA
AATCAG
AATCAT
AATCAC
AATCAN
AATCGA
AATCGG
AATCGT
AATCGC
AATCGN
AATCTA
AATCTG
AATCTT
AATCTC
AATCTN
AATCCA
AATCCG
AATCCT
AATCCC
AATCCN
AATCNA
AATCNG
AATCNT
AATCNC
AATCNN
AATNAA
AATNAG
AATNAT
AATNAC
AATNAN
AATNGA
AATNGG
AATNGT
AATNGC
AATNGN
AATNTA
AATNTG
AATNTT
AATNTC
AATNTN
AATNCA
AATNCG
AATNCT
AATNCC
AATNCN
AATNNA
AATNNG
AATNNT
AATNNC
AATNNN
AACAAA
AACAAG
AACAAT
AACAAC
AACAAN
AACAGA
AACAGG
AACAGT
AACAGC
AACAGN
AACATA
AACATG
AACATT
AACATC
AACATN
AACACA
AACACG
AACACT
AACACC
AACACN
AACANA
AACANG
AACANT
AACANC
AACANN
AACGAA
AACGAG
AACGAT
AACGAC
AACGAN
AACGGA
AACGGG
AACGGT
AACGGC
AACGGN
AACGTA
AACGTG
AACGTT
AACGTC
AACGTN
AACGCA
AACGCG
AACGCT
AACGCC
AACGCN
AACGNA
AACGNG
AACGNT
AACGNC
AACGNN
AACTAA
AACTAG
AACTAT
AACTAC
AACTAN
AACTGA
AACTGG
AACTGT
AACTGC
AACTGN
AACTTA
AACTTG
AACTTT
AACTTC
AACTTN
AACTCA
AACTCG
AACTCT
AACTCC
AACTCN
AACTNA
AACTNG
AACTNT
AACTNC
AACTNN
AACCAA
AACCAG
AACCAT
AACCAC
AACCAN
AACCGA
AACCGG
AACCGT
AACCGC
AACCGN
AACCTA
AACCTG
AACCTT
AACCTC
AACCTN
AACCCA
AACCCG
AACCCT
AACCCC
AACCCN
AACCNA
AACCNG
AACCNT
AACCNC
AACCNN
AACNAA
AACNAG
AACNAT
AACNAC
AACNAN
AACNGA
AACNGG
AACNGT
AACNGC
AACNGN
AACNTA
AACNTG
AACNTT
AACNTC
AACNTN
AACNCA
AACNCG
AACNCT
AACNCC
AACNCN
AACNNA
AACNNG
AACNNT
AACNNC
AACNNN
AANAAA
AANAAG
AANAAT
AANAAC
AANAAN
AANAGA
AANAGG
AANAGT
AANAGC
AANAGN
AANATA
AANATG
AANATT
AANATC
AANATN
AANACA
AANACG
AANACT
AANACC
AANACN
AANANA
AANANG
AANANT
AANANC
AANANN
AANGAA
AANGAG
AANGAT
AANGAC
AANGAN
AANGGA
AANGGG
AANGGT
AANGGC
AANGGN
AANGTA
AANGTG
AANGTT
AANGTC
AANGTN
AANGCA
AANGCG
AANGCT
AANGCC
AANGCN
AANGNA
AANGNG
AANGNT
AANGNC
AANGNN
AANTAA
AANTAG
AANTAT
AANTAC
AANTAN
AANTGA
AANTGG
AANTGT
AANTGC
AANTGN
AANTTA
AANTTG
AANTTT
AANTTC
AANTTN
AANTCA
AANTCG
AANTCT
AANTCC
AANTCN
AANTNA
AANTNG
AANTNT
AANTNC
AANTNN
AANCAA
AANCAG
AANCAT
AANCAC
AANCAN
AANCGA
AANCGG
AANCGT
AANCGC
AANCGN
AANCTA
AANCTG
AANCTT
AANCTC
AANCTN
AANCCA
AANCCG
AANCCT
AANCCC
AANCCN
AANCNA
AANCNG
AANCNT
AANCNC
AANCNN
AANNAA
AANNAG
AANNAT
AANNAC
AANNAN
AANNGA
AANNGG
AANNGT
AANNGC
AANNGN
AANNTA
AANNTG
AANNTT
AANNTC
AANNTN
AANNCA
AANNCG
AANNCT
AANNCC
AANNCN
AANNNA
AANNNG
AANNNT
AANNNC
AANNNN
AGAAAA
AGAAAG
AGAAAT
AGAAAC
AGAAAN
AGAAGA
AGAAGG
AGAAGT
AGAAGC
AGAAGN
AGAATA
AGAATG
AGAATT
AGAATC
AGAATN
AGAACA
AGAACG
AGAACT
AGAACC
AGAACN
AGAANA
AGAANG
AGAANT
AGAANC
AGAANN
AGAGAA
AGAGAG
AGAGAT
AGAGAC
AGAGAN
AGAGGA
AGAGGG
AGAGGT
AGAGGC
AGAGGN
AGAGTA
AGAGTG
AGAGTT
AGAGTC
AGAGTN
AGAGCA
AGAGCG
AGAGCT
AGAGCC
AGAGCN
AGAGNA
AGAGNG
AGAGNT
AGAGNC
AGAGNN
AGATAA
AGATAG
AGATAT
AGATAC
AGATAN
AGATGA
AGATGG
AGATGT
AGATGC
AGATGN
AGATTA
AGATTG
AGATTT
AGATTC
AGATTN
AGATCA
AGATCG
AGATCT
AGATCC
AGATCN
AGATNA
AGATNG
AGATNT
AGATNC
AGATNN
AGACAA
AGACAG
AGACAT
AGACAC
AGACAN
AGACGA
AGACGG
AGACGT
AGACGC
AGACGN
AGACTA
AGACTG
AGACTT
AGACTC
AGACTN
AGACCA
AGACCG
AGACCT
AGACCC
AGACCN
AGACNA
AGACNG
AGACNT
AGACNC
AGACNN
AGANAA
AGANAG
AGANAT
AGANAC
AGANAN
AGANGA
AGANGG
AGANGT
AGANGC
AGANGN
AGANTA
AGANTG
AGANTT
AGANTC
AGANTN
AGANCA
AGANCG
AGANCT
AGANCC
AGANCN
AGANNA
AGANNG
AGANNT
AGANNC
AGANNN
AGGAAA
AGGAAG
AGGAAT
AGGAAC
AGGAAN
AGGAGA
AGGAGG
AGGAGT
AGGAGC
AGGAGN
AGGATA
AGGATG
AGGATT
AGGATC
AGGATN
AGGACA
AGGACG
AGGACT
AGGACC
AGGACN
AGGANA
AGGANG
AGGANT
AGGANC
AGGANN
AGGGAA
AGGGAG
AGGGAT
AGGGAC
AGGGAN
AGGGGA
AGGGGG
AGGGGT
AGGGGC
AGGGGN
AGGGTA
AGGGTG
AGGGTT
AGGGTC
AGGGTN
AGGGCA
AGGGCG
AGGGCT
AGGGCC
AGGGCN
AGGGNA
AGGGNG
AGGGNT
AGGGNC
AGGGNN
AGGTAA
AGGTAG
AGGTAT
AGGTAC
AGGTAN
AGGTGA
AGGTGG
AGGTGT
AGGTGC
AGGTGN
AGGTTA
AGGTTG
AGGTTT
AGGTTC
AGGTTN
AGGTCA
AGGTCG
AGGTCT
AGGTCC
AGGTCN
AGGTNA
AGGTNG
AGGTNT
AGGTNC
AGGTNN
AGGCAA
AGGCAG
AGGCAT
AGGCAC
AGGCAN
AGGCGA
AGGCGG
AGGCGT
AGGCGC
AGGCGN
AGGCTA
AGGCTG
AGGCTT
AGGCTC
AGGCTN
AGGCCA
AGGCCG
AGGCCT
AGGCCC
AGGCCN
AGGCNA
AGGCNG
AGGCNT
AGGCNC
AGGCNN
AGGNAA
AGGNAG
AGGNAT
AGGNAC
AGGNAN
AGGNGA
AGGNGG
AGGNGT
AGGNGC
AGGNGN
AGGNTA
AGGNTG
AGGNTT
AGGNTC
AGGNTN
AGGNCA
AGGNCG
AGGNCT
AGGNCC
AGGNCN
AGGNNA
AGGNNG
AGGNNT
AGGNNC
AGGNNN
AGTAAA
AGTAAG
AGTAAT
AGTAAC
AGTAAN
AGTAGA
AGTAGG
AGTAGT
AGTAGC
AGTAGN
AGTATA
AGTATG
AGTATT
AGTATC
AGTATN
AGTACA
AGTACG
AGTACT
AGTACC
AGTACN
AGTANA
AGTANG
AGTANT
AGTANC
AGTANN
AGTGAA
AGTGAG
AGTGAT
AGTGAC
AGTGAN
AGTGGA
AGTGGG
AGTGGT
AGTGGC
AGTGGN
AGTGTA
AGTGTG
AGTGTT
AGTGTC
AGTGTN
AGTGCA
AGTGCG
AGTGCT
AGTGCC
AGTGCN
AGTGNA
AGTGNG
AGTGNT
AGTGNC
AGTGNN
AGTTAA
AGTTAG
AGTTAT
AGTTAC
AGTTAN
AGTTGA
AGTTGG
AGTTGT
AGTTGC
AGTTGN
AGTTTA
AGTTTG
AGTTTT
AGTTTC
AGTTTN
AGTTCA
AGTTCG
AGTTCT
AGTTCC
AGTTCN
AGTTNA
AGTTNG
AGTTNT
AGTTNC
AGTTNN
AGTCAA
AGTCAG
AGTCAT
AGTCAC
AGTCAN
AGTCGA
AGTCGG
AGTCGT
AGTCGC
AGTCGN
AGTCTA
AGTCTG
AGTCTT
AGTCTC
AGTCTN
AGTCCA
AGTCCG
AGTCCT
AGTCCC
AGTCCN
AGTCNA
AGTCNG
AGTCNT
AGTCNC
AGTCNN
AGTNAA
AGTNAG
AGTNAT
AGTNAC
AGTNAN
AGTNGA
AGTNGG
AGTNGT
AGTNGC
AGTNGN
AGTNTA
AGTNTG
AGTNTT
AGTNTC
AGTNTN
AGTNCA
AGTNCG
AGTNCT
AGTNCC
AGTNCN
AGTNNA
AGTNNG
AGTNNT
AGTNNC
AGTNNN
AGCAAA
AGCAAG
AGCAAT
AGCAAC
AGCAAN
AGCAGA
AGCAGG
AGCAGT
AGCAGC
AGCAGN
AGCATA
AGCATG
AGCATT
AGCATC
AGCATN
AGCACA
AGCACG
AGCACT
AGCACC
AGCACN
AGCANA
AGCANG
AGCANT
AGCANC
AGCANN
AGCGAA
AGCGAG
AGCGAT
AGCGAC
AGCGAN
AGCGGA
AGCGGG
AGCGGT
AGCGGC
AGCGGN
AGCGTA
AGCGTG
AGCGTT
AGCGTC
AGCGTN
AGCGCA
AGCGCG
AGCGCT
AGCGCC
AGCGCN
AGCGNA
AGCGNG
AGCGNT
AGCGNC
AGCGNN
AGCTAA
AGCTAG
AGCTAT
AGCTAC
AGCTAN
AGCTGA
AGCTGG
AGCTGT
AGCTGC
AGCTGN
AGCTTA
AGCTTG
AGCTTT
AGCTTC
AGCTTN
AGCTCA
AGCTCG
AGCTCT
AGCTCC
AGCTCN
AGCTNA
AGCTNG
AGCTNT
AGCTNC
AGCTNN
AGCCAA
AGCCAG
AGCCAT
AGCCAC
AGCCAN
AGCCGA
AGCCGG
AGCCGT
AGCCGC
AGCCGN
AGCCTA
AGCCTG
AGCCTT
AGCCTC
AGCCTN
AGCCCA
AGCCCG
AGCCCT
AGCCCC
AGCCCN
AGCCNA
AGCCNG
AGCCNT
AGCCNC
AGCCNN
AGCNAA
AGCNAG
AGCNAT
AGCNAC
AGCNAN
AGCNGA
AGCNGG
AGCNGT
AGCNGC
AGCNGN
AGCNTA
AGCNTG
AGCNTT
AGCNTC
AGCNTN
AGCNCA
AGCNCG
AGCNCT
AGCNCC
AGCNCN
AGCNNA
AGCNNG
AGCNNT
AGCNNC
AGCNNN
AGNAAA
AGNAAG
AGNAAT
AGNAAC
AGNAAN
AGNAGA
AGNAGG
AGNAGT
AGNAGC
AGNAGN
AGNATA
AGNATG
AGNATT
AGNATC
AGNATN
AGNACA
AGNACG
AGNACT
AGNACC
AGNACN
AGNANA
AGNANG
AGNANT
AGNANC
AGNANN
AGNGAA
AGNGAG
AGNGAT
AGNGAC
AGNGAN
AGNGGA
AGNGGG
AGNGGT
AGNGGC
AGNGGN
AGNGTA
AGNGTG
AGNGTT
AGNGTC
AGNGTN
AGNGCA
AGNGCG
AGNGCT
AGNGCC
AGNGCN
AGNGNA
AGNGNG
AGNGNT
AGNGNC
AGNGNN
AGNTAA
AGNTAG
AGNTAT
AGNTAC
AGNTAN
AGNTGA
AGNTGG
AGNTGT
AGNTGC
AGNTGN
AGNTTA
AGNTTG
AGNTTT
AGNTTC
AGNTTN
AGNTCA
AGNTCG
AGNTCT
AGNTCC
AGNTCN
AGNTNA
AGNTNG
AGNTNT
AGNTNC
AGNTNN
AGNCAA
AGNCAG
AGNCAT
AGNCAC
AGNCAN
AGNCGA
AGNCGG
AGNCGT
AGNCGC
AGNCGN
AGNCTA
AGNCTG
AGNCTT
AGNCTC
AGNCTN
AGNCCA
AGNCCG
AGNCCT
AGNCCC
AGNCCN
AGNCNA
AGNCNG
AGNCNT
AGNCNC
AGNCNN
AGNNAA
AGNNAG
AGNNAT
AGNNAC
AGNNAN
AGNNGA
AGNNGG
AGNNGT
AGNNGC
AGNNGN
AGNNTA
AGNNTG
AGNNTT
AGNNTC
AGNNTN
AGNNCA
AGNNCG
AGNNCT
AGNNCC
AGNNCN
AGNNNA
AGNNNG
AGNNNT
AGNNNC
AGNNNN
ATAAAA
ATAAAG
ATAAAT
ATAAAC
ATAAAN
ATAAGA
ATAAGG
ATAAGT
ATAAGC
ATAAGN
ATAATA
ATAATG
ATAATT
ATAATC
ATAATN
ATAACA
ATAACG
ATAACT
ATAACC
ATAACN
ATAANA
ATAANG
ATAANT
ATAANC
ATAANN
ATAGAA
ATAGAG
ATAGAT
ATAGAC
ATAGAN
ATAGGA
ATAGGG
ATAGGT
ATAGGC
ATAGGN
ATAGTA
ATAGTG
ATAGTT
ATAGTC
ATAGTN
ATAGCA
ATAGCG
ATAGCT
ATAGCC
ATAGCN
ATAGNA
ATAGNG
ATAGNT
ATAGNC
ATAGNN
ATATAA
ATATAG
ATATAT
ATATAC
ATATAN
ATATGA
ATATGG
ATATGT
ATATGC
ATATGN
ATATTA
ATATTG
ATATTT
ATATTC
ATATTN
ATATCA
ATATCG
ATATCT
ATATCC
ATATCN
ATATNA
ATATNG
ATATNT
ATATNC
ATATNN
ATACAA
ATACAG
ATACAT
ATACAC
ATACAN
ATACGA
ATACGG
ATACGT
ATACGC
ATACGN
ATACTA
ATACTG
ATACTT
ATACTC
ATACTN
ATACCA
ATACCG
ATACCT
ATACCC
ATACCN
ATACNA
ATACNG
ATACNT
ATACNC
ATACNN
ATANAA
ATANAG
ATANAT
ATANAC
ATANAN
ATANGA
ATANGG
ATANGT
ATANGC
ATANGN
ATANTA
ATANTG
ATANTT
ATANTC
ATANTN
ATANCA
ATANCG
ATANCT
ATANCC
ATANCN
ATANNA
ATANNG
ATANNT
ATANNC
ATANNN
ATGAAA
ATGAAG
ATGAAT
ATGAAC
ATGAAN
ATGAGA
ATGAGG
ATGAGT
ATGAGC
ATGAGN
ATGATA
ATGATG
ATGATT
ATGATC
ATGATN
ATGACA
ATGACG
ATGACT
ATGACC
ATGACN
ATGANA
ATGANG
ATGANT
ATGANC
ATGANN
ATGGAA
ATGGAG
ATGGAT
ATGGAC
ATGGAN
ATGGGA
ATGGGG
ATGGGT
ATGGGC
ATGGGN
ATGGTA
ATGGTG
ATGGTT
ATGGTC
ATGGTN
ATGGCA
ATGGCG
ATGGCT
ATGGCC
ATGGCN
ATGGNA
ATGGNG
ATGGNT
ATGGNC
ATGGNN
ATGTAA
ATGTAG
ATGTAT
ATGTAC
ATGTAN
ATGTGA
ATGTGG
ATGTGT
ATGTGC
ATGTGN
ATGTTA
ATGTTG
ATGTTT
ATGTTC
ATGTTN
ATGTCA
ATGTCG
ATGTCT
ATGTCC
ATGTCN
ATGTNA
ATGTNG
ATGTNT
ATGTNC
ATGTNN
ATGCAA
ATGCAG
ATGCAT
ATGCAC
ATGCAN
ATGCGA
ATGCGG
ATGCGT
ATGCGC
ATGCGN
ATGCTA
ATGCTG
ATGCTT
ATGCTC
ATGCTN
ATGCCA
ATGCCG
ATGCCT
ATGCCC
ATGCCN
ATGCNA
ATGCNG
ATGCNT
ATGCNC
ATGCNN
ATGNAA
ATGNAG
ATGNAT
ATGNAC
ATGNAN
ATGNGA
ATGNGG
ATGNGT
ATGNGC
ATGNGN
ATGNTA
ATGNTG
ATGNTT
ATGNTC
ATGNTN
ATGNCA
ATGNCG
ATGNCT
ATGNCC
ATGNCN
ATGNNA
ATGNNG
ATGNNT
ATGNNC
ATGNNN
ATTAAA
ATTAAG
ATTAAT
ATTAAC
ATTAAN
ATTAGA
ATTAGG
ATTAGT
ATTAGC
ATTAGN
ATTATA
ATTATG
ATTATT
ATTATC
ATTATN
ATTACA
ATTACG
ATTACT
ATTACC
ATTACN
ATTANA
ATTANG
ATTANT
ATTANC
ATTANN
ATTGAA
ATTGAG
ATTGAT
ATTGAC
ATTGAN
ATTGGA
ATTGGG
ATTGGT
ATTGGC
ATTGGN
ATTGTA
ATTGTG
ATTGTT
ATTGTC
ATTGTN
ATTGCA
ATTGCG
ATTGCT
ATTGCC
ATTGCN
ATTGNA
ATTGNG
ATTGNT
ATTGNC
ATTGNN
ATTTAA
ATTTAG
ATTTAT
ATTTAC
ATTTAN
ATTTGA
ATTTGG
ATTTGT
ATTTGC
ATTTGN
ATTTTA
ATTTTG
ATTTTT
ATTTTC
ATTTTN
ATTTCA
ATTTCG
ATTTCT
ATTTCC
ATTTCN
ATTTNA
ATTTNG
ATTTNT
ATTTNC
ATTTNN
ATTCAA
ATTCAG
ATTCAT
ATTCAC
ATTCAN
ATTCGA
ATTCGG
ATTCGT
ATTCGC
ATTCGN
ATTCTA
ATTCTG
ATTCTT
ATTCTC
ATTCTN
ATTCCA
ATTCCG
ATTCCT
ATTCCC
ATTCCN
ATTCNA
ATTCNG
ATTCNT
ATTCNC
ATTCNN
ATTNAA
ATTNAG
ATTNAT
ATTNAC
ATTNAN
ATTNGA
ATTNGG
ATTNGT
ATTNGC
ATTNGN
ATTNTA
ATTNTG
ATTNTT
ATTNTC
ATTNTN
ATTNCA
ATTNCG
ATTNCT
ATTNCC
ATTNCN
ATTNNA
ATTNNG
ATTNNT
ATTNNC
ATTNNN
ATCAAA
ATCAAG
ATCAAT
ATCAAC
ATCAAN
ATCAGA
ATCAGG
ATCAGT
ATCAGC
ATCAGN
ATCATA
ATCATG
ATCATT
ATCATC
ATCATN
ATCACA
ATCACG
ATCACT
ATCACC
ATCACN
ATCANA
ATCANG
ATCANT
ATCANC
ATCANN
ATCGAA
ATCGAG
ATCGAT
ATCGAC
ATCGAN
ATCGGA
ATCGGG
ATCGGT
ATCGGC
ATCGGN
ATCGTA
ATCGTG
ATCGTT
ATCGTC
ATCGTN
ATCGCA
ATCGCG
ATCGCT
ATCGCC
ATCGCN
ATCGNA
ATCGNG
ATCGNT
ATCGNC
ATCGNN
ATCTAA
ATCTAG
ATCTAT
ATCTAC
ATCTAN
ATCTGA
ATCTGG
ATCTGT
ATCTGC
ATCTGN
ATCTTA
ATCTTG
ATCTTT
ATCTTC
ATCTTN
ATCTCA
ATCTCG
ATCTCT
ATCTCC
ATCTCN
ATCTNA
ATCTNG
ATCTNT
ATCTNC
ATCTNN
ATCCAA
ATCCAG
ATCCAT
ATCCAC
ATCCAN
ATCCGA
ATCCGG
ATCCGT
ATCCGC
ATCCGN
ATCCTA
ATCCTG
ATCCTT
ATCCTC
ATCCTN
ATCCCA
ATCCCG
ATCCCT
ATCCCC
ATCCCN
ATCCNA
ATCCNG
ATCCNT
ATCCNC
ATCCNN
ATCNAA
ATCNAG
ATCNAT
ATCNAC
ATCNAN
ATCNGA
ATCNGG
ATCNGT
ATCNGC
ATCNGN
ATCNTA
ATCNTG
ATCNTT
ATCNTC
ATCNTN
ATCNCA
ATCNCG
ATCNCT
ATCNCC
ATCNCN
ATCNNA
ATCNNG
ATCNNT
ATCNNC
ATCNNN
ATNAAA
ATNAAG
ATNAAT
ATNAAC
ATNAAN
ATNAGA
ATNAGG
ATNAGT
ATNAGC
ATNAGN
ATNATA
ATNATG
ATNATT
ATNATC
ATNATN
ATNACA
ATNACG
ATNACT
ATNACC
ATNACN
ATNANA
ATNANG
ATNANT
ATNANC
ATNANN
ATNGAA
ATNGAG
ATNGAT
ATNGAC
ATNGAN
ATNGGA
ATNGGG
ATNGGT
ATNGGC
ATNGGN
ATNGTA
ATNGTG
ATNGTT
ATNGTC
ATNGTN
ATNGCA
ATNGCG
ATNGCT
ATNGCC
ATNGCN
ATNGNA
ATNGNG
ATNGNT
ATNGNC
ATNGNN
ATNTAA
ATNTAG
ATNTAT
ATNTAC
ATNTAN
ATNTGA
ATNTGG
ATNTGT
ATNTGC
ATNTGN
ATNTTA
ATNTTG
ATNTTT
ATNTTC
ATNTTN
ATNTCA
ATNTCG
ATNTCT
ATNTCC
ATNTCN
ATNTNA
ATNTNG
ATNTNT
ATNTNC
ATNTNN
ATNCAA
ATNCAG
ATNCAT
ATNCAC
ATNCAN
ATNCGA
ATNCGG
ATNCGT
ATNCGC
ATNCGN
ATNCTA
ATNCTG
ATNCTT
ATNCTC
ATNCTN
ATNCCA
ATNCCG
ATNCCT
ATNCCC
ATNCCN
ATNCNA
ATNCNG
ATNCNT
ATNCNC
ATNCNN
ATNNAA
ATNNAG
ATNNAT
ATNNAC
ATNNAN
ATNNGA
ATNNGG
ATNNGT
ATNNGC
ATNNGN
ATNNTA
ATNNTG
ATNNTT
ATNNTC
ATNNTN
ATNNCA
ATNNCG
ATNNCT
ATNNCC
ATNNCN
ATNNNA
ATNNNG
ATNNNT
ATNNNC
ATNNNN
ACAAAA
ACAAAG
ACAAAT
ACAAAC
ACAAAN
ACAAGA
ACAAGG
ACAAGT
ACAAGC
ACAAGN
ACAATA
ACAATG
ACAATT
ACAATC
ACAATN
ACAACA
ACAACG
ACAACT
ACAACC
ACAACN
ACAANA
ACAANG
ACAANT
ACAANC
ACAANN
ACAGAA
ACAGAG
ACAGAT
ACAGAC
ACAGAN
ACAGGA
ACAGGG
ACAGGT
ACAGGC
ACAGGN
ACAGTA
ACAGTG
ACAGTT
ACAGTC
ACAGTN
ACAGCA
ACAGCG
ACAGCT
ACAGCC
ACAGCN
ACAGNA
ACAGNG
ACAGNT
ACAGNC
ACAGNN
ACATAA
ACATAG
ACATAT
ACATAC
ACATAN
ACATGA
ACATGG
ACATGT
ACATGC
ACATGN
ACATTA
ACATTG
ACATTT
ACATTC
ACATTN
ACATCA
ACATCG
ACATCT
ACATCC
ACATCN
ACATNA
ACATNG
ACATNT
ACATNC
ACATNN
ACACAA
ACACAG
ACACAT
ACACAC
ACACAN
ACACGA
ACACGG
ACACGT
ACACGC
ACACGN
ACACTA
ACACTG
ACACTT
ACACTC
ACACTN
ACACCA
ACACCG
ACACCT
ACACCC
ACACCN
ACACNA
ACACNG
ACACNT
ACACNC
ACACNN
ACANAA
ACANAG
ACANAT
ACANAC
ACANAN
ACANGA
ACANGG
ACANGT
ACANGC
ACANGN
ACANTA
ACANTG
ACANTT
ACANTC
ACANTN
ACANCA
ACANCG
ACANCT
ACANCC
ACANCN
ACANNA
ACANNG
ACANNT
ACANNC
ACANNN
ACGAAA
ACGAAG
ACGAAT
ACGAAC
ACGAAN
ACGAGA
ACGAGG
ACGAGT
ACGAGC
ACGAGN
ACGATA
ACGATG
ACGATT
ACGATC
ACGATN
ACGACA
ACGACG
ACGACT
ACGACC
ACGACN
ACGANA
ACGANG
ACGANT
ACGANC
ACGANN
ACGGAA
ACGGAG
ACGGAT
ACGGAC
ACGGAN
ACGGGA
ACGGGG
ACGGGT
ACGGGC
ACGGGN
ACGGTA
ACGGTG
ACGGTT
ACGGTC
ACGGTN
ACGGCA
ACGGCG
ACGGCT
ACGGCC
ACGGCN
ACGGNA
ACGGNG
ACGGNT
ACGGNC
ACGGNN
ACGTAA
ACGTAG
ACGTAT
ACGTAC
ACGTAN
ACGTGA
ACGTGG
ACGTGT
ACGTGC
ACGTGN
ACGTTA
ACGTTG
ACGTTT
ACGTTC
ACGTTN
ACGTCA
ACGTCG
ACGTCT
ACGTCC
ACGTCN
ACGTNA
ACGTNG
ACGTNT
ACGTNC
ACGTNN
ACGCAA
ACGCAG
ACGCAT
ACGCAC
ACGCAN
ACGCGA
ACGCGG
ACGCGT
ACGCGC
ACGCGN
ACGCTA
ACGCTG
ACGCTT
ACGCTC
ACGCTN
ACGCCA
ACGCCG
ACGCCT
ACGCCC
ACGCCN
ACGCNA
ACGCNG
ACGCNT
ACGCNC
ACGCNN
ACGNAA
ACGNAG
ACGNAT
ACGNAC
ACGNAN
ACGNGA
ACGNGG
ACGNGT
ACGNGC
ACGNGN
ACGNTA
ACGNTG
ACGNTT
ACGNTC
ACGNTN
ACGNCA
ACGNCG
ACGNCT
ACGNCC
ACGNCN
ACGNNA
ACGNNG
ACGNNT
ACGNNC
ACGNNN
ACTAAA
ACTAAG
ACTAAT
ACTAAC
ACTAAN
ACTAGA
ACTAGG
ACTAGT
ACTAGC
ACTAGN
ACTATA
ACTATG
ACTATT
ACTATC
ACTATN
ACTACA
ACTACG
ACTACT
ACTACC
ACTACN
ACTANA
ACTANG
ACTANT
ACTANC
ACTANN
ACTGAA
ACTGAG
ACTGAT
ACTGAC
ACTGAN
ACTGGA
ACTGGG
ACTGGT
ACTGGC
ACTGGN
ACTGTA
ACTGTG
ACTGTT
ACTGTC
ACTGTN
ACTGCA
ACTGCG
ACTGCT
ACTGCC
ACTGCN
ACTGNA
ACTGNG
ACTGNT
ACTGNC
ACTGNN
ACTTAA
ACTTAG
ACTTAT
ACTTAC
ACTTAN
ACTTGA
ACTTGG
ACTTGT
ACTTGC
ACTTGN
ACTTTA
ACTTTG
ACTTTT
ACTTTC
ACTTTN
ACTTCA
ACTTCG
ACTTCT
ACTTCC
ACTTCN
ACTTNA
ACTTNG
ACTTNT
ACTTNC
ACTTNN
ACTCAA
ACTCAG
ACTCAT
ACTCAC
ACTCAN
ACTCGA
ACTCGG
ACTCGT
ACTCGC
ACTCGN
ACTCTA
ACTCTG
ACTCTT
ACTCTC
ACTCTN
ACTCCA
ACTCCG
ACTCCT
ACTCCC
ACTCCN
ACTCNA
ACTCNG
ACTCNT
ACTCNC
ACTCNN
ACTNAA
ACTNAG
ACTNAT
ACTNAC
ACTNAN
ACTNGA
ACTNGG
ACTNGT
ACTNGC
ACTNGN
ACTNTA
ACTNTG
ACTNTT
ACTNTC
ACTNTN
ACTNCA
ACTNCG
ACTNCT
ACTNCC
ACTNCN
ACTNNA
ACTNNG
ACTNNT
ACTNNC
ACTNNN
ACCAAA
ACCAAG
ACCAAT
ACCAAC
ACCAAN
ACCAGA
ACCAGG
ACCAGT
ACCAGC
ACCAGN
ACCATA
ACCATG
ACCATT
ACCATC
ACCATN
ACCACA
ACCACG
ACCACT
ACCACC
ACCACN
ACCANA
ACCANG
ACCANT
ACCANC
ACCANN
ACCGAA
ACCGAG
ACCGAT
ACCGAC
ACCGAN
ACCGGA
ACCGGG
ACCGGT
ACCGGC
ACCGGN
ACCGTA
ACCGTG
ACCGTT
ACCGTC
ACCGTN
ACCGCA
ACCGCG
ACCGCT
ACCGCC
ACCGCN
ACCGNA
ACCGNG
ACCGNT
ACCGNC
ACCGNN
ACCTAA
ACCTAG
ACCTAT
ACCTAC
ACCTAN
ACCTGA
ACCTGG
ACCTGT
ACCTGC
ACCTGN
ACCTTA
ACCTTG
ACCTTT
ACCTTC
ACCTTN
ACCTCA
ACCTCG
ACCTCT
ACCTCC
ACCTCN
ACCTNA
ACCTNG
ACCTNT
ACCTNC
ACCTNN
ACCCAA
ACCCAG
ACCCAT
ACCCAC
ACCCAN
ACCCGA
ACCCGG
ACCCGT
ACCCGC
ACCCGN
ACCCTA
ACCCTG
ACCCTT
ACCCTC
ACCCTN
ACCCCA
ACCCCG
ACCCCT
ACCCCC
ACCCCN
ACCCNA
ACCCNG
ACCCNT
ACCCNC
ACCCNN
ACCNAA
ACCNAG
ACCNAT
ACCNAC
ACCNAN
ACCNGA
ACCNGG
ACCNGT
ACCNGC
ACCNGN
ACCNTA
ACCNTG
ACCNTT
ACCNTC
ACCNTN
ACCNCA
ACCNCG
ACCNCT
ACCNCC
ACCNCN
ACCNNA
ACCNNG
ACCNNT
ACCNNC
ACCNNN
ACNAAA
ACNAAG
ACNAAT
ACNAAC
ACNAAN
ACNAGA
ACNAGG
ACNAGT
ACNAGC
ACNAGN
ACNATA
ACNATG
ACNATT
ACNATC
ACNATN
ACNACA
ACNACG
ACNACT
ACNACC
ACNACN
ACNANA
ACNANG
ACNANT
ACNANC
ACNANN
ACNGAA
ACNGAG
ACNGAT
ACNGAC
ACNGAN
ACNGGA
ACNGGG
ACNGGT
ACNGGC
ACNGGN
ACNGTA
ACNGTG
ACNGTT
ACNGTC
ACNGTN
ACNGCA
ACNGCG
ACNGCT
ACNGCC
ACNGCN
ACNGNA
ACNGNG
ACNGNT
ACNGNC
ACNGNN
ACNTAA
ACNTAG
ACNTAT
ACNTAC
ACNTAN
ACNTGA
ACNTGG
ACNTGT
ACNTGC
ACNTGN
ACNTTA
ACNTTG
ACNTTT
ACNTTC
ACNTTN
ACNTCA
ACNTCG
ACNTCT
ACNTCC
ACNTCN
ACNTNA
ACNTNG
ACNTNT
ACNTNC
ACNTNN
ACNCAA
ACNCAG
ACNCAT
ACNCAC
ACNCAN
ACNCGA
ACNCGG
ACNCGT
ACNCGC
ACNCGN
ACNCTA
ACNCTG
ACNCTT
ACNCTC
ACNCTN
ACNCCA
ACNCCG
ACNCCT
ACNCCC
ACNCCN
ACNCNA
ACNCNG
ACNCNT
ACNCNC
ACNCNN
ACNNAA
ACNNAG
ACNNAT
ACNNAC
ACNNAN
ACNNGA
ACNNGG
ACNNGT
ACNNGC
ACNNGN
ACNNTA
ACNNTG
ACNNTT
ACNNTC
ACNNTN
ACNNCA
ACNNCG
ACNNCT
ACNNCC
ACNNCN
ACNNNA
ACNNNG
ACNNNT
ACNNNC
ACNNNN
ANAAAA
ANAAAG
ANAAAT
ANAAAC
ANAAAN
ANAAGA
ANAAGG
ANAAGT
ANAAGC
ANAAGN
ANAATA
ANAATG
ANAATT
ANAATC
ANAATN
ANAACA
ANAACG
ANAACT
ANAACC
ANAACN
ANAANA
ANAANG
ANAANT
ANAANC
ANAANN
ANAGAA
ANAGAG
ANAGAT
ANAGAC
ANAGAN
ANAGGA
ANAGGG
ANAGGT
ANAGGC
ANAGGN
ANAGTA
ANAGTG
ANAGTT
ANAGTC
ANAGTN
ANAGCA
ANAGCG
ANAGCT
ANAGCC
ANAGCN
ANAGNA
ANAGNG
ANAGNT
ANAGNC
ANAGNN
ANATAA
ANATAG
ANATAT
ANATAC
ANATAN
ANATGA
ANATGG
ANATGT
ANATGC
ANATGN
ANATTA
ANATTG
ANATTT
ANATTC
ANATTN
ANATCA
ANATCG
ANATCT
ANATCC
ANATCN
ANATNA
ANATNG
ANATNT
ANATNC
ANATNN
ANACAA
ANACAG
ANACAT
ANACAC
ANACAN
ANACGA
ANACGG
ANACGT
ANACGC
ANACGN
ANACTA
ANACTG
ANACTT
ANACTC
ANACTN
ANACCA
ANACCG
ANACCT
ANACCC
ANACCN
ANACNA
ANACNG
ANACNT
ANACNC
ANACNN
ANANAA
ANANAG
ANANAT
ANANAC
ANANAN
ANANGA
ANANGG
ANANGT
ANANGC
ANANGN
ANANTA
ANANTG
ANANTT
ANANTC
ANANTN
ANANCA
ANANCG
ANANCT
ANANCC
ANANCN
ANANNA
ANANNG
ANANNT
ANANNC
ANANNN
ANGAAA
ANGAAG
ANGAAT
ANGAAC
ANGAAN
ANGAGA
ANGAGG
ANGAGT
ANGAGC
ANGAGN
ANGATA
ANGATG
ANGATT
ANGATC
ANGATN
ANGACA
ANGACG
ANGACT
ANGACC
ANGACN
ANGANA
ANGANG
ANGANT
ANGANC
ANGANN
ANGGAA
ANGGAG
ANGGAT
ANGGAC
ANGGAN
ANGGGA
ANGGGG
ANGGGT
ANGGGC
ANGGGN
ANGGTA
ANGGTG
ANGGTT
ANGGTC
ANGGTN
ANGGCA
ANGGCG
ANGGCT
ANGGCC
ANGGCN
ANGGNA
ANGGNG
ANGGNT
ANGGNC
ANGGNN
ANGTAA
ANGTAG
ANGTAT
ANGTAC
ANGTAN
ANGTGA
ANGTGG
ANGTGT
ANGTGC
ANGTGN
ANGTTA
ANGTTG
ANGTTT
ANGTTC
ANGTTN
ANGTCA
ANGTCG
ANGTCT
ANGTCC
ANGTCN
ANGTNA
ANGTNG
ANGTNT
ANGTNC
ANGTNN
ANGCAA
ANGCAG
ANGCAT
ANGCAC
ANGCAN
ANGCGA
ANGCGG
ANGCGT
ANGCGC
ANGCGN
ANGCTA
ANGCTG
ANGCTT
ANGCTC
ANGCTN
ANGCCA
ANGCCG
ANGCCT
ANGCCC
ANGCCN
ANGCNA
ANGCNG
ANGCNT
ANGCNC
ANGCNN
ANGNAA
ANGNAG
ANGNAT
ANGNAC
ANGNAN
ANGNGA
ANGNGG
ANGNGT
ANGNGC
ANGNGN
ANGNTA
ANGNTG
ANGNTT
ANGNTC
ANGNTN
ANGNCA
ANGNCG
ANGNCT
ANGNCC
ANGNCN
ANGNNA
ANGNNG
ANGNNT
ANGNNC
ANGNNN
ANTAAA
ANTAAG
ANTAAT
ANTAAC
ANTAAN
ANTAGA
ANTAGG
ANTAGT
ANTAGC
ANTAGN
ANTATA
ANTATG
ANTATT
ANTATC
ANTATN
ANTACA
ANTACG
ANTACT
ANTACC
ANTACN
ANTANA
ANTANG
ANTANT
ANTANC
ANTANN
ANTGAA
ANTGAG
ANTGAT
ANTGAC
ANTGAN
ANTGGA
ANTGGG
ANTGGT
ANTGGC
ANTGGN
ANTGTA
ANTGTG
ANTGTT
ANTGTC
ANTGTN
ANTGCA
ANTGCG
ANTGCT
ANTGCC
ANTGCN
ANTGNA
ANTGNG
ANTGNT
ANTGNC
ANTGNN
ANTTAA
ANTTAG
ANTTAT
ANTTAC
ANTTAN
ANTTGA
ANTTGG
ANTTGT
ANTTGC
ANTTGN
ANTTTA
ANTTTG
ANTTTT
ANTTTC
ANTTTN
ANTTCA
ANTTCG
ANTTCT
ANTTCC
ANTTCN
ANTTNA
ANTTNG
ANTTNT
ANTTNC
ANTTNN
ANTCAA
ANTCAG
ANTCAT
ANTCAC
ANTCAN
ANTCGA
ANTCGG
ANTCGT
ANTCGC
ANTCGN
ANTCTA
ANTCTG
ANTCTT
ANTCTC
ANTCTN
ANTCCA
ANTCCG
ANTCCT
ANTCCC
ANTCCN
ANTCNA
ANTCNG
ANTCNT
ANTCNC
ANTCNN
ANTNAA
ANTNAG
ANTNAT
ANTNAC
ANTNAN
ANTNGA
ANTNGG
ANTNGT
ANTNGC
ANTNGN
ANTNTA
ANTNTG
ANTNTT
ANTNTC
ANTNTN
ANTNCA
ANTNCG
ANTNCT
ANTNCC
ANTNCN
ANTNNA
ANTNNG
ANTNNT
ANTNNC
ANTNNN
ANCAAA
ANCAAG
ANCAAT
ANCAAC
ANCAAN
ANCAGA
ANCAGG
ANCAGT
ANCAGC
ANCAGN
ANCATA
ANCATG
ANCATT
ANCATC
ANCATN
ANCACA
ANCACG
ANCACT
ANCACC
ANCACN
ANCANA
ANCANG
ANCANT
ANCANC
ANCANN
ANCGAA
ANCGAG
ANCGAT
ANCGAC
ANCGAN
ANCGGA
ANCGGG
ANCGGT
ANCGGC
ANCGGN
ANCGTA
ANCGTG
ANCGTT
ANCGTC
ANCGTN
ANCGCA
ANCGCG
ANCGCT
ANCGCC
ANCGCN
ANCGNA
ANCGNG
ANCGNT
ANCGNC
ANCGNN
ANCTAA
ANCTAG
ANCTAT
ANCTAC
ANCTAN
ANCTGA
ANCTGG
ANCTGT
ANCTGC
ANCTGN
ANCTTA
ANCTTG
ANCTTT
ANCTTC
ANCTTN
ANCTCA
ANCTCG
ANCTCT
ANCTCC
ANCTCN
ANCTNA
ANCTNG
ANCTNT
ANCTNC
ANCTNN
ANCCAA
ANCCAG
ANCCAT
ANCCAC
ANCCAN
ANCCGA
ANCCGG
ANCCGT
ANCCGC
ANCCGN
ANCCTA
ANCCTG
ANCCTT
ANCCTC
ANCCTN
ANCCCA
ANCCCG
ANCCCT
ANCCCC
ANCCCN
ANCCNA
ANCCNG
ANCCNT
ANCCNC
ANCCNN
ANCNAA
ANCNAG
ANCNAT
ANCNAC
ANCNAN
ANCNGA
ANCNGG
ANCNGT
ANCNGC
ANCNGN
ANCNTA
ANCNTG
ANCNTT
ANCNTC
ANCNTN
ANCNCA
ANCNCG
ANCNCT
ANCNCC
ANCNCN
ANCNNA
ANCNNG
ANCNNT
ANCNNC
ANCNNN
ANNAAA
ANNAAG
ANNAAT
ANNAAC
ANNAAN
ANNAGA
ANNAGG
ANNAGT
ANNAGC
ANNAGN
ANNATA
ANNATG
ANNATT
ANNATC
ANNATN
ANNACA
ANNACG
ANNACT
ANNACC
ANNACN
ANNANA
ANNANG
ANNANT
ANNANC
ANNANN
ANNGAA
ANNGAG
ANNGAT
ANNGAC
ANNGAN
ANNGGA
ANNGGG
ANNGGT
ANNGGC
ANNGGN
ANNGTA
ANNGTG
ANNGTT
ANNGTC
ANNGTN
ANNGCA
ANNGCG
ANNGCT
ANNGCC
ANNGCN
ANNGNA
ANNGNG
ANNGNT
ANNGNC
ANNGNN
ANNTAA
ANNTAG
ANNTAT
ANNTAC
ANNTAN
ANNTGA
ANNTGG
ANNTGT
ANNTGC
ANNTGN
ANNTTA
ANNTTG
ANNTTT
ANNTTC
ANNTTN
ANNTCA
ANNTCG
ANNTCT
ANNTCC
ANNTCN
ANNTNA
ANNTNG
ANNTNT
ANNTNC
ANNTNN
ANNCAA
ANNCAG
ANNCAT
ANNCAC
ANNCAN
ANNCGA
ANNCGG
ANNCGT
ANNCGC
ANNCGN
ANNCTA
ANNCTG
ANNCTT
ANNCTC
ANNCTN
ANNCCA
ANNCCG
ANNCCT
ANNCCC
ANNCCN
ANNCNA
ANNCNG
ANNCNT
ANNCNC
ANNCNN
ANNNAA
ANNNAG
ANNNAT
ANNNAC
ANNNAN
ANNNGA
ANNNGG
ANNNGT
ANNNGC
ANNNGN
ANNNTA
ANNNTG
ANNNTT
ANNNTC
ANNNTN
ANNNCA
ANNNCG
ANNNCT
ANNNCC
ANNNCN
ANNNNA
ANNNNG
ANNNNT
ANNNNC
ANNNNN
GAAAAA
GAAAAG
GAAAAT
GAAAAC
GAAAAN
GAAAGA
GAAAGG
GAAAGT
GAAAGC
GAAAGN
GAAATA
GAAATG
GAAATT
GAAATC
GAAATN
GAAACA
GAAACG
GAAACT
GAAACC
GAAACN
GAAANA
GAAANG
GAAANT
GAAANC
GAAANN
GAAGAA
GAAGAG
GAAGAT
GAAGAC
GAAGAN
GAAGGA
GAAGGG
GAAGGT
GAAGGC
GAAGGN
GAAGTA
GAAGTG
GAAGTT
GAAGTC
GAAGTN
GAAGCA
GAAGCG
GAAGCT
GAAGCC
GAAGCN
GAAGNA
GAAGNG
GAAGNT
GAAGNC
GAAGNN
GAATAA
GAATAG
GAATAT
GAATAC
GAATAN
GAATGA
GAATGG
GAATGT
GAATGC
GAATGN
GAATTA
GAATTG
GAATTT
GAATTC
GAATTN
GAATCA
GAATCG
GAATCT
GAATCC
GAATCN
GAATNA
GAATNG
GAATNT
GAATNC
GAATNN
GAACAA
GAACAG
GAACAT
GAACAC
GAACAN
GAACGA
GAACGG
GAACGT
GAACGC
GAACGN
GAACTA
GAACTG
GAACTT
GAACTC
GAACTN
GAACCA
GAACCG
GAACCT
GAACCC
GAACCN
GAACNA
GAACNG
GAACNT
GAACNC
GAACNN
GAANAA
GAANAG
GAANAT
GAANAC
GAANAN
GAANGA
GAANGG
GAANGT
GAANGC
GAANGN
GAANTA
GAANTG
GAANTT
GAANTC
GAANTN
GAANCA
GAANCG
GAANCT
GAANCC
GAANCN
GAANNA
GAANNG
GAANNT
GAANNC
GAANNN
GAGAAA
GAGAAG
GAGAAT
GAGAAC
GAGAAN
GAGAGA
GAGAGG
GAGAGT
GAGAGC
GAGAGN
GAGATA
GAGATG
GAGATT
GAGATC
GAGATN
GAGACA
GAGACG
GAGACT
GAGACC
GAGACN
GAGANA
GAGANG
GAGANT
GAGANC
GAGANN
GAGGAA
GAGGAG
GAGGAT
GAGGAC
GAGGAN
GAGGGA
GAGGGG
GAGGGT
GAGGGC
GAGGGN
GAGGTA
GAGGTG
GAGGTT
GAGGTC
GAGGTN
GAGGCA
GAGGCG
GAGGCT
GAGGCC
GAGGCN
GAGGNA
GAGGNG
GAGGNT
GAGGNC
GAGGNN
GAGTAA
GAGTAG
GAGTAT
GAGTAC
GAGTAN
GAGTGA
GAGTGG
GAGTGT
GAGTGC
GAGTGN
GAGTTA
GAGTTG
GAGTTT
GAGTTC
GAGTTN
GAGTCA
GAGTCG
GAGTCT
GAGTCC
GAGTCN
GAGTNA
GAGTNG
GAGTNT
GAGTNC
GAGTNN
GAGCAA
GAGCAG
GAGCAT
GAGCAC
GAGCAN
GAGCGA
GAGCGG
GAGCGT
GAGCGC
GAGCGN
GAGCTA
GAGCTG
GAGCTT
GAGCTC
GAGCTN
GAGCCA
GAGCCG
GAGCCT
GAGCCC
GAGCCN
GAGCNA
GAGCNG
GAGCNT
GAGCNC
GAGCNN
GAGNAA
GAGNAG
GAGNAT
GAGNAC
GAGNAN
GAGNGA
GAGNGG
GAGNGT
GAGNGC
GAGNGN
GAGNTA
GAGNTG
GAGNTT
GAGNTC
GAGNTN
GAGNCA
GAGNCG
GAGNCT
GAGNCC
GAGNCN
GAGNNA
GAGNNG
GAGNNT
GAGNNC
GAGNNN
GATAAA
GATAAG
GATAAT
GATAAC
GATAAN
GATAGA
GATAGG
GATAGT
GATAGC
GATAGN
GATATA
GATATG
GATATT
GATATC
GATATN
GATACA
GATACG
GATACT
GATACC
GATACN
GATANA
GATANG
GATANT
GATANC
GATANN
GATGAA
GATGAG
GATGAT
GATGAC
GATGAN
GATGGA
GATGGG
GATGGT
GATGGC
GATGGN
GATGTA
GATGTG
GATGTT
GATGTC
GATGTN
GATGCA
GATGCG
GATGCT
GATGCC
GATGCN
GATGNA
GATGNG
GATGNT
GATGNC
GATGNN
GATTAA
GATTAG
GATTAT
GATTAC
GATTAN
GATTGA
GATTGG
GATTGT
GATTGC
GATTGN
GATTTA
GATTTG
GATTTT
GATTTC
GATTTN
GATTCA
GATTCG
GATTCT
GATTCC
GATTCN
GATTNA
GATTNG
GATTNT
GATTNC
GATTNN
GATCAA
GATCAG
GATCAT
GATCAC
GATCAN
GATCGA
GATCGG
GATCGT
GATCGC
GATCGN
GATCTA
GATCTG
GATCTT
GATCTC
GATCTN
GATCCA
GATCCG
GATCCT
GATCCC
GATCCN
GATCNA
GATCNG
GATCNT
GATCNC
GATCNN
GATNAA
GATNAG
GATNAT
GATNAC
GATNAN
GATNGA
GATNGG
GATNGT
GATNGC
GATNGN
GATNTA
GATNTG
GATNTT
GATNTC
GATNTN
GATNCA
GATNCG
GATNCT
GATNCC
GATNCN
GATNNA
GATNNG
GATNNT
GATNNC
GATNNN
GACAAA
GACAAG
GACAAT
GACAAC
GACAAN
GACAGA
GACAGG
GACAGT
GACAGC
GACAGN
GACATA
GACATG
GACATT
GACATC
GACATN
GACACA
GACACG
GACACT
GACACC
GACACN
GACANA
GACANG
GACANT
GACANC
GACANN
GACGAA
GACGAG
GACGAT
GACGAC
GACGAN
GACGGA
GACGGG
GACGGT
GACGGC
GACGGN
GACGTA
GACGTG
GACGTT
GACGTC
GACGTN
GACGCA
GACGCG
GACGCT
GACGCC
GACGCN
GACGNA
GACGNG
GACGNT
GACGNC
GACGNN
GACTAA
GACTAG
GACTAT
GACTAC
GACTAN
GACTGA
GACTGG
GACTGT
GACTGC
GACTGN
GACTTA
GACTTG
GACTTT
GACTTC
GACTTN
GACTCA
GACTCG
GACTCT
GACTCC
GACTCN
GACTNA
GACTNG
GACTNT
GACTNC
GACTNN
GACCAA
GACCAG
GACCAT
GACCAC
GACCAN
GACCGA
GACCGG
GACCGT
GACCGC
GACCGN
GACCTA
GACCTG
GACCTT
GACCTC
GACCTN
GACCCA
GACCCG
GACCCT
GACCCC
GACCCN
GACCNA
GACCNG
GACCNT
GACCNC
GACCNN
GACNAA
GACNAG
GACNAT
GACNAC
GACNAN
GACNGA
GACNGG
GACNGT
GACNGC
GACNGN
GACNTA
GACNTG
GACNTT
GACNTC
GACNTN
GACNCA
GACNCG
GACNCT
GACNCC
GACNCN
GACNNA
GACNNG
GACNNT
GACNNC
GACNNN
GANAAA
GANAAG
GANAAT
GANAAC
GANAAN
GANAGA
GANAGG
GANAGT
GANAGC
GANAGN
GANATA
GANATG
GANATT
GANATC
GANATN
GANACA
GANACG
GANACT
GANACC
GANACN
GANANA
GANANG
GANANT
GANANC
GANANN
GANGAA
GANGAG
GANGAT
GANGAC
GANGAN
GANGGA
GANGGG
GANGGT
GANGGC
GANGGN
GANGTA
GANGTG
GANGTT
GANGTC
GANGTN
GANGCA
GANGCG
GANGCT
GANGCC
GANGCN
GANGNA
GANGNG
GANGNT
GANGNC
GANGNN
GANTAA
GANTAG
GANTAT
GANTAC
GANTAN
GANTGA
GANTGG
GANTGT
GANTGC
GANTGN
GANTTA
GANTTG
GANTTT
GANTTC
GANTTN
GANTCA
GANTCG
GANTCT
GANTCC
GANTCN
GANTNA
GANTNG
GANTNT
GANTNC
GANTNN
GANCAA
GANCAG
GANCAT
GANCAC
GANCAN
GANCGA
GANCGG
GANCGT
GANCGC
GANCGN
GANCTA
GANCTG
GANCTT
GANCTC
GANCTN
GANCCA
GANCCG
GANCCT
GANCCC
GANCCN
GANCNA
GANCNG
GANCNT
GANCNC
GANCNN
GANNAA
GANNAG
GANNAT
GANNAC
GANNAN
GANNGA
GANNGG
GANNGT
GANNGC
GANNGN
GANNTA
GANNTG
GANNTT
GANNTC
GANNTN
GANNCA
GANNCG
GANNCT
GANNCC
GANNCN
GANNNA
GANNNG
GANNNT
GANNNC
GANNNN
GGAAAA
GGAAAG
GGAAAT
GGAAAC
GGAAAN
GGAAGA
GGAAGG
GGAAGT
GGAAGC
GGAAGN
GGAATA
GGAATG
GGAATT
GGAATC
GGAATN
GGAACA
GGAACG
GGAACT
GGAACC
GGAACN
GGAANA
GGAANG
GGAANT
GGAANC
GGAANN
GGAGAA
GGAGAG
GGAGAT
GGAGAC
GGAGAN
GGAGGA
GGAGGG
GGAGGT
GGAGGC
GGAGGN
GGAGTA
GGAGTG
GGAGTT
GGAGTC
GGAGTN
GGAGCA
GGAGCG
GGAGCT
GGAGCC
GGAGCN
GGAGNA
GGAGNG
GGAGNT
GGAGNC
GGAGNN
GGATAA
GGATAG
GGATAT
GGATAC
GGATAN
GGATGA
GGATGG
GGATGT
GGATGC
GGATGN
GGATTA
GGATTG
GGATTT
GGATTC
GGATTN
GGATCA
GGATCG
GGATCT
GGATCC
GGATCN
GGATNA
GGATNG
GGATNT
GGATNC
GGATNN
GGACAA
GGACAG
GGACAT
GGACAC
GGACAN
GGACGA
GGACGG
GGACGT
GGACGC
GGACGN
GGACTA
GGACTG
GGACTT
GGACTC
GGACTN
GGACCA
GGACCG
GGACCT
GGACCC
GGACCN
GGACNA
GGACNG
GGACNT
GGACNC
GGACNN
GGANAA
GGANAG
GGANAT
GGANAC
GGANAN
GGANGA
GGANGG
GGANGT
GGANGC
GGANGN
GGANTA
GGANTG
GGANTT
GGANTC
GGANTN
GGANCA
GGANCG
GGANCT
GGANCC
GGANCN
GGANNA
GGANNG
GGANNT
GGANNC
GGANNN
GGGAAA
GGGAAG
GGGAAT
GGGAAC
GGGAAN
GGGAGA
GGGAGG
GGGAGT
GGGAGC
GGGAGN
GGGATA
GGGATG
GGGATT
GGGATC
GGGATN
GGGACA
GGGACG
GGGACT
GGGACC
GGGACN
GGGANA
GGGANG
GGGANT
GGGANC
GGGANN
GGGGAA
GGGGAG
GGGGAT
GGGGAC
GGGGAN
GGGGGA
GGGGGG
GGGGGT
GGGGGC
GGGGGN
GGGGTA
GGGGTG
GGGGTT
GGGGTC
GGGGTN
GGGGCA
GGGGCG
GGGGCT
GGGGCC
GGGGCN
GGGGNA
GGGGNG
GGGGNT
GGGGNC
GGGGNN
GGGTAA
GGGTAG
GGGTAT
GGGTAC
GGGTAN
GGGTGA
GGGTGG
GGGTGT
GGGTGC
GGGTGN
GGGTTA
GGGTTG
GGGTTT
GGGTTC
GGGTTN
GGGTCA
GGGTCG
GGGTCT
GGGTCC
GGGTCN
GGGTNA
GGGTNG
GGGTNT
GGGTNC
GGGTNN
GGGCAA
GGGCAG
GGGCAT
GGGCAC
GGGCAN
GGGCGA
GGGCGG
GGGCGT
GGGCGC
GGGCGN
GGGCTA
GGGCTG
GGGCTT
GGGCTC
GGGCTN
GGGCCA
GGGCCG
GGGCCT
GGGCCC
GGGCCN
GGGCNA
GGGCNG
GGGCNT
GGGCNC
GGGCNN
GGGNAA
GGGNAG
GGGNAT
GGGNAC
GGGNAN
GGGNGA
GGGNGG
GGGNGT
GGGNGC
GGGNGN
GGGNTA
GGGNTG
GGGNTT
GGGNTC
GGGNTN
GGGNCA
GGGNCG
GGGNCT
GGGNCC
GGGNCN
GGGNNA
GGGNNG
GGGNNT
GGGNNC
GGGNNN
GGTAAA
GGTAAG
GGTAAT
GGTAAC
GGTAAN
GGTAGA
GGTAGG
GGTAGT
GGTAGC
GGTAGN
GGTATA
GGTATG
GGTATT
GGTATC
GGTATN
GGTACA
GGTACG
GGTACT
GGTACC
GGTACN
GGTANA
GGTANG
GGTANT
GGTANC
GGTANN
GGTGAA
GGTGAG
GGTGAT
GGTGAC
GGTGAN
GGTGGA
GGTGGG
GGTGGT
GGTGGC
GGTGGN
GGTGTA
GGTGTG
GGTGTT
GGTGTC
GGTGTN
GGTGCA
GGTGCG
GGTGCT
GGTGCC
GGTGCN
GGTGNA
GGTGNG
GGTGNT
GGTGNC
GGTGNN
GGTTAA
GGTTAG
GGTTAT
GGTTAC
GGTTAN
GGTTGA
GGTTGG
GGTTGT
GGTTGC
GGTTGN
GGTTTA
GGTTTG
GGTTTT
GGTTTC
GGTTTN
GGTTCA
GGTTCG
GGTTCT
GGTTCC
GGTTCN
GGTTNA
GGTTNG
GGTTNT
GGTTNC
GGTTNN
GGTCAA
GGTCAG
GGTCAT
GGTCAC
GGTCAN
GGTCGA
GGTCGG
GGTCGT
GGTCGC
GGTCGN
GGTCTA
GGTCTG
GGTCTT
GGTCTC
GGTCTN
GGTCCA
GGTCCG
GGTCCT
GGTCCC
GGTCCN
GGTCNA
GGTCNG
GGTCNT
GGTCNC
GGTCNN
GGTNAA
GGTNAG
GGTNAT
GGTNAC
GGTNAN
GGTNGA
GGTNGG
GGTNGT
GGTNGC
GGTNGN
GGTNTA
GGTNTG
GGTNTT
GGTNTC
GGTNTN
GGTNCA
GGTNCG
GGTNCT
GGTNCC
GGTNCN
GGTNNA
GGTNNG
GGTNNT
GGTNNC
GGTNNN
GGCAAA
GGCAAG
GGCAAT
GGCAAC
GGCAAN
GGCAGA
GGCAGG
GGCAGT
GGCAGC
GGCAGN
GGCATA
GGCATG
GGCATT
GGCATC
GGCATN
GGCACA
GGCACG
GGCACT
GGCACC
GGCACN
GGCANA
GGCANG
GGCANT
GGCANC
GGCANN
GGCGAA
GGCGAG
GGCGAT
GGCGAC
GGCGAN
GGCGGA
GGCGGG
GGCGGT
GGCGGC
GGCGGN
GGCGTA
GGCGTG
GGCGTT
GGCGTC
GGCGTN
GGCGCA
GGCGCG
GGCGCT
GGCGCC
GGCGCN
GGCGNA
GGCGNG
GGCGNT
GGCGNC
GGCGNN
GGCTAA
GGCTAG
GGCTAT
GGCTAC
GGCTAN
GGCTGA
GGCTGG
GGCTGT
GGCTGC
GGCTGN
GGCTTA
GGCTTG
GGCTTT
GGCTTC
GGCTTN
GGCTCA
GGCTCG
GGCTCT
GGCTCC
GGCTCN
GGCTNA
GGCTNG
GGCTNT
GGCTNC
GGCTNN
GGCCAA
GGCCAG
GGCCAT
GGCCAC
GGCCAN
GGCCGA
GGCCGG
GGCCGT
GGCCGC
GGCCGN
GGCCTA
GGCCTG
GGCCTT
GGCCTC
GGCCTN
GGCCCA
GGCCCG
GGCCCT
GGCCCC
GGCCCN
GGCCNA
GGCCNG
GGCCNT
GGCCNC
GGCCNN
GGCNAA
GGCNAG
GGCNAT
GGCNAC
GGCNAN
GGCNGA
GGCNGG
GGCNGT
GGCNGC
GGCNGN
GGCNTA
GGCNTG
GGCNTT
GGCNTC
GGCNTN
GGCNCA
GGCNCG
GGCNCT
GGCNCC
GGCNCN
GGCNNA
GGCNNG
GGCNNT
GGCNNC
GGCNNN
GGNAAA
GGNAAG
GGNAAT
GGNAAC
GGNAAN
GGNAGA
GGNAGG
GGNAGT
GGNAGC
GGNAGN
GGNATA
GGNATG
GGNATT
GGNATC
GGNATN
GGNACA
GGNACG
GGNACT
GGNACC
GGNACN
GGNANA
GGNANG
GGNANT
GGNANC
GGNANN
GGNGAA
GGNGAG
GGNGAT
GGNGAC
GGNGAN
GGNGGA
GGNGGG
GGNGGT
GGNGGC
GGNGGN
GGNGTA
GGNGTG
GGNGTT
GGNGTC
GGNGTN
GGNGCA
GGNGCG
GGNGCT
GGNGCC
GGNGCN
GGNGNA
GGNGNG
GGNGNT
GGNGNC
GGNGNN
GGNTAA
GGNTAG
GGNTAT
GGNTAC
GGNTAN
GGNTGA
GGNTGG
GGNTGT
GGNTGC
GGNTGN
GGNTTA
GGNTTG
GGNTTT
GGNTTC
GGNTTN
GGNTCA
GGNTCG
GGNTCT
GGNTCC
GGNTCN
GGNTNA
GGNTNG
GGNTNT
GGNTNC
GGNTNN
GGNCAA
GGNCAG
GGNCAT
GGNCAC
GGNCAN
GGNCGA
GGNCGG
GGNCGT
GGNCGC
GGNCGN
GGNCTA
GGNCTG
GGNCTT
GGNCTC
GGNCTN
GGNCCA
GGNCCG
GGNCCT
GGNCCC
GGNCCN
GGNCNA
GGNCNG
GGNCNT
GGNCNC
GGNCNN
GGNNAA
GGNNAG
GGNNAT
GGNNAC
GGNNAN
GGNNGA
GGNNGG
GGNNGT
GGNNGC
GGNNGN
GGNNTA
GGNNTG
GGNNTT
GGNNTC
GGNNTN
GGNNCA
GGNNCG
GGNNCT
GGNNCC
GGNNCN
GGNNNA
GGNNNG
GGNNNT
GGNNNC
GGNNNN
GTAAAA
GTAAAG
GTAAAT
GTAAAC
GTAAAN
GTAAGA
GTAAGG
GTAAGT
GTAAGC
GTAAGN
GTAATA
GTAATG
GTAATT
GTAATC
GTAATN
GTAACA
GTAACG
GTAACT
GTAACC
GTAACN
GTAANA
GTAANG
GTAANT
GTAANC
GTAANN
GTAGAA
GTAGAG
GTAGAT
GTAGAC
GTAGAN
GTAGGA
GTAGGG
GTAGGT
GTAGGC
GTAGGN
GTAGTA
GTAGTG
GTAGTT
GTAGTC
GTAGTN
GTAGCA
GTAGCG
GTAGCT
GTAGCC
GTAGCN
GTAGNA
GTAGNG
GTAGNT
GTAGNC
GTAGNN
GTATAA
GTATAG
GTATAT
GTATAC
GTATAN
GTATGA
GTATGG
GTATGT
GTATGC
GTATGN
GTATTA
GTATTG
GTATTT
GTATTC
GTATTN
GTATCA
GTATCG
GTATCT
GTATCC
GTATCN
GTATNA
GTATNG
GTATNT
GTATNC
GTATNN
GTACAA
GTACAG
GTACAT
GTACAC
GTACAN
GTACGA
GTACGG
GTACGT
GTACGC
GTACGN
GTACTA
GTACTG
GTACTT
GTACTC
GTACTN
GTACCA
GTACCG
GTACCT
GTACCC
GTACCN
GTACNA
GTACNG
GTACNT
GTACNC
GTACNN
GTANAA
GTANAG
GTANAT
GTANAC
GTANAN
GTANGA
GTANGG
GTANGT
GTANGC
GTANGN
GTANTA
GTANTG
GTANTT
GTANTC
GTANTN
GTANCA
GTANCG
GTANCT
GTANCC
GTANCN
GTANNA
GTANNG
GTANNT
GTANNC
GTANNN
GTGAAA
GTGAAG
GTGAAT
GTGAAC
GTGAAN
GTGAGA
GTGAGG
GTGAGT
GTGAGC
GTGAGN
GTGATA
GTGATG
GTGATT
GTGATC
GTGATN
GTGACA
GTGACG
GTGACT
GTGACC
GTGACN
GTGANA
GTGANG
GTGANT
GTGANC
GTGANN
GTGGAA
GTGGAG
GTGGAT
GTGGAC
GTGGAN
GTGGGA
GTGGGG
GTGGGT
GTGGGC
GTGGGN
GTGGTA
GTGGTG
GTGGTT
GTGGTC
GTGGTN
GTGGCA
GTGGCG
GTGGCT
GTGGCC
GTGGCN
GTGGNA
GTGGNG
GTGGNT
GTGGNC
GTGGNN
GTGTAA
GTGTAG
GTGTAT
GTGTAC
GTGTAN
GTGTGA
GTGTGG
GTGTGT
GTGTGC
GTGTGN
GTGTTA
GTGTTG
GTGTTT
GTGTTC
GTGTTN
GTGTCA
GTGTCG
GTGTCT
GTGTCC
GTGTCN
GTGTNA
GTGTNG
GTGTNT
GTGTNC
GTGTNN
GTGCAA
GTGCAG
GTGCAT
GTGCAC
GTGCAN
GTGCGA
GTGCGG
GTGCGT
GTGCGC
GTGCGN
GTGCTA
GTGCTG
GTGCTT
GTGCTC
GTGCTN
GTGCCA
GTGCCG
GTGCCT
GTGCCC
GTGCCN
GTGCNA
GTGCNG
GTGCNT
GTGCNC
GTGCNN
GTGNAA
GTGNAG
GTGNAT
GTGNAC
GTGNAN
GTGNGA
GTGNGG
GTGNGT
GTGNGC
GTGNGN
GTGNTA
GTGNTG
GTGNTT
GTGNTC
GTGNTN
GTGNCA
GTGNCG
GTGNCT
GTGNCC
GTGNCN
GTGNNA
GTGNNG
GTGNNT
GTGNNC
GTGNNN
GTTAAA
GTTAAG
GTTAAT
GTTAAC
GTTAAN
GTTAGA
GTTAGG
GTTAGT
GTTAGC
GTTAGN
GTTATA
GTTATG
GTTATT
GTTATC
GTTATN
GTTACA
GTTACG
GTTACT
GTTACC
GTTACN
GTTANA
GTTANG
GTTANT
GTTANC
GTTANN
GTTGAA
GTTGAG
GTTGAT
GTTGAC
GTTGAN
GTTGGA
GTTGGG
GTTGGT
GTTGGC
GTTGGN
GTTGTA
GTTGTG
GTTGTT
GTTGTC
GTTGTN
GTTGCA
GTTGCG
GTTGCT
GTTGCC
GTTGCN
GTTGNA
GTTGNG
GTTGNT
GTTGNC
GTTGNN
GTTTAA
GTTTAG
GTTTAT
GTTTAC
GTTTAN
GTTTGA
GTTTGG
GTTTGT
GTTTGC
GTTTGN
GTTTTA
GTTTTG
GTTTTT
GTTTTC
GTTTTN
GTTTCA
GTTTCG
GTTTCT
GTTTCC
GTTTCN
GTTTNA
GTTTNG
GTTTNT
GTTTNC
GTTTNN
GTTCAA
GTTCAG
GTTCAT
GTTCAC
GTTCAN
GTTCGA
GTTCGG
GTTCGT
GTTCGC
GTTCGN
GTTCTA
GTTCTG
GTTCTT
GTTCTC
GTTCTN
GTTCCA
GTTCCG
GTTCCT
GTTCCC
GTTCCN
GTTCNA
GTTCNG
GTTCNT
GTTCNC
GTTCNN
GTTNAA
GTTNAG
GTTNAT
GTTNAC
GTTNAN
GTTNGA
GTTNGG
GTTNGT
GTTNGC
GTTNGN
GTTNTA
GTTNTG
GTTNTT
GTTNTC
GTTNTN
GTTNCA
GTTNCG
GTTNCT
GTTNCC
GTTNCN
GTTNNA
GTTNNG
GTTNNT
GTTNNC
GTTNNN
GTCAAA
GTCAAG
GTCAAT
GTCAAC
GTCAAN
GTCAGA
GTCAGG
GTCAGT
GTCAGC
GTCAGN
GTCATA
GTCATG
GTCATT
GTCATC
GTCATN
GTCACA
GTCACG
GTCACT
GTCACC
GTCACN
GTCANA
GTCANG
GTCANT
GTCANC
GTCANN
GTCGAA
GTCGAG
GTCGAT
GTCGAC
GTCGAN
GTCGGA
GTCGGG
GTCGGT
GTCGGC
GTCGGN
GTCGTA
GTCGTG
GTCGTT
GTCGTC
GTCGTN
GTCGCA
GTCGCG
GTCGCT
GTCGCC
GTCGCN
GTCGNA
GTCGNG
GTCGNT
GTCGNC
GTCGNN
GTCTAA
GTCTAG
GTCTAT
GTCTAC
GTCTAN
GTCTGA
GTCTGG
GTCTGT
GTCTGC
GTCTGN
GTCTTA
GTCTTG
GTCTTT
GTCTTC
GTCTTN
GTCTCA
GTCTCG
GTCTCT
GTCTCC
GTCTCN
GTCTNA
GTCTNG
GTCTNT
GTCTNC
GTCTNN
GTCCAA
GTCCAG
GTCCAT
GTCCAC
GTCCAN
GTCCGA
GTCCGG
GTCCGT
GTCCGC
GTCCGN
GTCCTA
GTCCTG
GTCCTT
GTCCTC
GTCCTN
GTCCCA
GTCCCG
GTCCCT
GTCCCC
GTCCCN
GTCCNA
GTCCNG
GTCCNT
GTCCNC
GTCCNN
GTCNAA
GTCNAG
GTCNAT
GTCNAC
GTCNAN
GTCNGA
GTCNGG
GTCNGT
GTCNGC
GTCNGN
GTCNTA
GTCNTG
GTCNTT
GTCNTC
GTCNTN
GTCNCA
GTCNCG
GTCNCT
GTCNCC
GTCNCN
GTCNNA
GTCNNG
GTCNNT
GTCNNC
GTCNNN
GTNAAA
GTNAAG
GTNAAT
GTNAAC
GTNAAN
GTNAGA
GTNAGG
GTNAGT
GTNAGC
GTNAGN
GTNATA
GTNATG
GTNATT
GTNATC
GTNATN
GTNACA
GTNACG
GTNACT
GTNACC
GTNACN
GTNANA
GTNANG
GTNANT
GTNANC
GTNANN
GTNGAA
GTNGAG
GTNGAT
GTNGAC
GTNGAN
GTNGGA
GTNGGG
GTNGGT
GTNGGC
GTNGGN
GTNGTA
GTNGTG
GTNGTT
GTNGTC
GTNGTN
GTNGCA
GTNGCG
GTNGCT
GTNGCC
GTNGCN
GTNGNA
GTNGNG
GTNGNT
GTNGNC
GTNGNN
GTNTAA
GTNTAG
GTNTAT
GTNTAC
GTNTAN
GTNTGA
GTNTGG
GTNTGT
GTNTGC
GTNTGN
GTNTTA
GTNTTG
GTNTTT
GTNTTC
GTNTTN
GTNTCA
GTNTCG
GTNTCT
GTNTCC
GTNTCN
GTNTNA
GTNTNG
GTNTNT
GTNTNC
GTNTNN
GTNCAA
GTNCAG
GTNCAT
GTNCAC
GTNCAN
GTNCGA
GTNCGG
GTNCGT
GTNCGC
GTNCGN
GTNCTA
GTNCTG
GTNCTT
GTNCTC
GTNCTN
GTNCCA
GTNCCG
GTNCCT
GTNCCC
GTNCCN
GTNCNA
GTNCNG
GTNCNT
GTNCNC
GTNCNN
GTNNAA
GTNNAG
GTNNAT
GTNNAC
GTNNAN
GTNNGA
GTNNGG
GTNNGT
GTNNGC
GTNNGN
GTNNTA
GTNNTG
GTNNTT
GTNNTC
GTNNTN
GTNNCA
GTNNCG
GTNNCT
GTNNCC
GTNNCN
GTNNNA
GTNNNG
GTNNNT
GTNNNC
GTNNNN
GCAAAA
GCAAAG
GCAAAT
GCAAAC
GCAAAN
GCAAGA
GCAAGG
GCAAGT
GCAAGC
GCAAGN
GCAATA
GCAATG
GCAATT
GCAATC
GCAATN
GCAACA
GCAACG
GCAACT
GCAACC
GCAACN
GCAANA
GCAANG
GCAANT
GCAANC
GCAANN
GCAGAA
GCAGAG
GCAGAT
GCAGAC
GCAGAN
GCAGGA
GCAGGG
GCAGGT
GCAGGC
GCAGGN
GCAGTA
GCAGTG
GCAGTT
GCAGTC
GCAGTN
GCAGCA
GCAGCG
GCAGCT
GCAGCC
GCAGCN
GCAGNA
GCAGNG
GCAGNT
GCAGNC
GCAGNN
GCATAA
GCATAG
GCATAT
GCATAC
GCATAN
GCATGA
GCATGG
GCATGT
GCATGC
GCATGN
GCATTA
GCATTG
GCATTT
GCATTC
GCATTN
GCATCA
GCATCG
GCATCT
GCATCC
GCATCN
GCATNA
GCATNG
GCATNT
GCATNC
GCATNN
GCACAA
GCACAG
GCACAT
GCACAC
GCACAN
GCACGA
GCACGG
GCACGT
GCACGC
GCACGN
GCACTA
GCACTG
GCACTT
GCACTC
GCACTN
GCACCA
GCACCG
GCACCT
GCACCC
GCACCN
GCACNA
GCACNG
GCACNT
GCACNC
GCACNN
GCANAA
GCANAG
GCANAT
GCANAC
GCANAN
GCANGA
GCANGG
GCANGT
GCANGC
GCANGN
GCANTA
GCANTG
GCANTT
GCANTC
GCANTN
GCANCA
GCANCG
GCANCT
GCANCC
GCANCN
GCANNA
GCANNG
GCANNT
GCANNC
GCANNN
GCGAAA
GCGAAG
GCGAAT
GCGAAC
GCGAAN
GCGAGA
GCGAGG
GCGAGT
GCGAGC
GCGAGN
GCGATA
GCGATG
GCGATT
GCGATC
GCGATN
GCGACA
GCGACG
GCGACT
GCGACC
GCGACN
GCGANA
GCGANG
GCGANT
GCGANC
GCGANN
GCGGAA
GCGGAG
GCGGAT
GCGGAC
GCGGAN
GCGGGA
GCGGGG
GCGGGT
GCGGGC
GCGGGN
GCGGTA
GCGGTG
GCGGTT
GCGGTC
GCGGTN
GCGGCA
GCGGCG
GCGGCT
GCGGCC
GCGGCN
GCGGNA
GCGGNG
GCGGNT
GCGGNC
GCGGNN
GCGTAA
GCGTAG
GCGTAT
GCGTAC
GCGTAN
GCGTGA
GCGTGG
GCGTGT
GCGTGC
GCGTGN
GCGTTA
GCGTTG
GCGTTT
GCGTTC
GCGTTN
GCGTCA
GCGTCG
GCGTCT
GCGTCC
GCGTCN
GCGTNA
GCGTNG
GCGTNT
GCGTNC
GCGTNN
GCGCAA
GCGCAG
GCGCAT
GCGCAC
GCGCAN
GCGCGA
GCGCGG
GCGCGT
GCGCGC
GCGCGN
GCGCTA
GCGCTG
GCGCTT
GCGCTC
GCGCTN
GCGCCA
GCGCCG
GCGCCT
GCGCCC
GCGCCN
GCGCNA
GCGCNG
GCGCNT
GCGCNC
GCGCNN
GCGNAA
GCGNAG
GCGNAT
GCGNAC
GCGNAN
GCGNGA
GCGNGG
GCGNGT
GCGNGC
GCGNGN
GCGNTA
GCGNTG
GCGNTT
GCGNTC
GCGNTN
GCGNCA
GCGNCG
GCGNCT
GCGNCC
GCGNCN
GCGNNA
GCGNNG
GCGNNT
GCGNNC
GCGNNN
GCTAAA
GCTAAG
GCTAAT
GCTAAC
GCTAAN
GCTAGA
GCTAGG
GCTAGT
GCTAGC
GCTAGN
GCTATA
GCTATG
GCTATT
GCTATC
GCTATN
GCTACA
GCTACG
GCTACT
GCTACC
GCTACN
GCTANA
GCTANG
GCTANT
GCTANC
GCTANN
GCTGAA
GCTGAG
GCTGAT
GCTGAC
GCTGAN
GCTGGA
GCTGGG
GCTGGT
GCTGGC
GCTGGN
GCTGTA
GCTGTG
GCTGTT
GCTGTC
GCTGTN
GCTGCA
GCTGCG
GCTGCT
GCTGCC
GCTGCN
GCTGNA
GCTGNG
GCTGNT
GCTGNC
GCTGNN
GCTTAA
GCTTAG
GCTTAT
GCTTAC
GCTTAN
GCTTGA
GCTTGG
GCTTGT
GCTTGC
GCTTGN
GCTTTA
GCTTTG
GCTTTT
GCTTTC
GCTTTN
GCTTCA
GCTTCG
GCTTCT
GCTTCC
GCTTCN
GCTTNA
GCTTNG
GCTTNT
GCTTNC
GCTTNN
GCTCAA
GCTCAG
GCTCAT
GCTCAC
GCTCAN
GCTCGA
GCTCGG
GCTCGT
GCTCGC
GCTCGN
GCTCTA
GCTCTG
GCTCTT
GCTCTC
GCTCTN
GCTCCA
GCTCCG
GCTCCT
GCTCCC
GCTCCN
GCTCNA
GCTCNG
GCTCNT
GCTCNC
GCTCNN
GCTNAA
GCTNAG
GCTNAT
GCTNAC
GCTNAN
GCTNGA
GCTNGG
GCTNGT
GCTNGC
GCTNGN
GCTNTA
GCTNTG
GCTNTT
GCTNTC
GCTNTN
GCTNCA
GCTNCG
GCTNCT
GCTNCC
GCTNCN
GCTNNA
GCTNNG
GCTNNT
GCTNNC
GCTNNN
GCCAAA
GCCAAG
GCCAAT
GCCAAC
GCCAAN
GCCAGA
GCCAGG
GCCAGT
GCCAGC
GCCAGN
GCCATA
GCCATG
GCCATT
GCCATC
GCCATN
GCCACA
GCCACG
GCCACT
GCCACC
GCCACN
GCCANA
GCCANG
GCCANT
GCCANC
GCCANN
GCCGAA
GCCGAG
GCCGAT
GCCGAC
GCCGAN
GCCGGA
GCCGGG
GCCGGT
GCCGGC
GCCGGN
GCCGTA
GCCGTG
GCCGTT
GCCGTC
GCCGTN
GCCGCA
GCCGCG
GCCGCT
GCCGCC
GCCGCN
GCCGNA
GCCGNG
GCCGNT
GCCGNC
GCCGNN
GCCTAA
GCCTAG
GCCTAT
GCCTAC
GCCTAN
GCCTGA
GCCTGG
GCCTGT
GCCTGC
GCCTGN
GCCTTA
GCCTTG
GCCTTT
GCCTTC
GCCTTN
GCCTCA
GCCTCG
GCCTCT
GCCTCC
GCCTCN
GCCTNA
GCCTNG
GCCTNT
GCCTNC
GCCTNN
GCCCAA
GCCCAG
GCCCAT
GCCCAC
GCCCAN
GCCCGA
GCCCGG
GCCCGT
GCCCGC
GCCCGN
GCCCTA
GCCCTG
GCCCTT
GCCCTC
GCCCTN
GCCCCA
GCCCCG
GCCCCT
GCCCCC
GCCCCN
GCCCNA
GCCCNG
GCCCNT
GCCCNC
GCCCNN
GCCNAA
GCCNAG
GCCNAT
GCCNAC
GCCNAN
GCCNGA
GCCNGG
GCCNGT
GCCNGC
GCCNGN
GCCNTA
GCCNTG
GCCNTT
GCCNTC
GCCNTN
GCCNCA
GCCNCG
GCCNCT
GCCNCC
GCCNCN
GCCNNA
GCCNNG
GCCNNT
GCCNNC
GCCNNN
GCNAAA
GCNAAG
GCNAAT
GCNAAC
GCNAAN
GCNAGA
GCNAGG
GCNAGT
GCNAGC
GCNAGN
GCNATA
GCNATG
GCNATT
GCNATC
GCNATN
GCNACA
GCNACG
GCNACT
GCNACC
GCNACN
GCNANA
GCNANG
GCNANT
GCNANC
GCNANN
GCNGAA
GCNGAG
GCNGAT
GCNGAC
GCNGAN
GCNGGA
GCNGGG
GCNGGT
GCNGGC
GCNGGN
GCNGTA
GCNGTG
GCNGTT
GCNGTC
GCNGTN
GCNGCA
GCNGCG
GCNGCT
GCNGCC
GCNGCN
GCNGNA
GCNGNG
GCNGNT
GCNGNC
GCNGNN
GCNTAA
GCNTAG
GCNTAT
GCNTAC
GCNTAN
GCNTGA
GCNTGG
GCNTGT
GCNTGC
GCNTGN
GCNTTA
GCNTTG
GCNTTT
GCNTTC
GCNTTN
GCNTCA
GCNTCG
GCNTCT
GCNTCC
GCNTCN
GCNTNA
GCNTNG
GCNTNT
GCNTNC
GCNTNN
GCNCAA
GCNCAG
GCNCAT
GCNCAC
GCNCAN
GCNCGA
GCNCGG
GCNCGT
GCNCGC
GCNCGN
GCNCTA
GCNCTG
GCNCTT
GCNCTC
GCNCTN
GCNCCA
GCNCCG
GCNCCT
GCNCCC
GCNCCN
GCNCNA
GCNCNG
GCNCNT
GCNCNC
GCNCNN
GCNNAA
GCNNAG
GCNNAT
GCNNAC
GCNNAN
GCNNGA
GCNNGG
GCNNGT
GCNNGC
GCNNGN
GCNNTA
GCNNTG
GCNNTT
GCNNTC
GCNNTN
GCNNCA
GCNNCG
GCNNCT
GCNNCC
GCNNCN
GCNNNA
GCNNNG
GCNNNT
GCNNNC
GCNNNN
GNAAAA
GNAAAG
GNAAAT
GNAAAC
GNAAAN
GNAAGA
GNAAGG
GNAAGT
GNAAGC
GNAAGN
GNAATA
GNAATG
GNAATT
GNAATC
GNAATN
GNAACA
GNAACG
GNAACT
GNAACC
GNAACN
GNAANA
GNAANG
GNAANT
GNAANC
GNAANN
GNAGAA
GNAGAG
GNAGAT
GNAGAC
GNAGAN
GNAGGA
GNAGGG
GNAGGT
GNAGGC
GNAGGN
GNAGTA
GNAGTG
GNAGTT
GNAGTC
GNAGTN
GNAGCA
GNAGCG
GNAGCT
GNAGCC
GNAGCN
GNAGNA
GNAGNG
GNAGNT
GNAGNC
GNAGNN
GNATAA
GNATAG
GNATAT
GNATAC
GNATAN
GNATGA
GNATGG
GNATGT
GNATGC
GNATGN
GNATTA
GNATTG
GNATTT
GNATTC
GNATTN
GNATCA
GNATCG
GNATCT
GNATCC
GNATCN
GNATNA
GNATNG
GNATNT
GNATNC
GNATNN
GNACAA
GNACAG
GNACAT
GNACAC
GNACAN
GNACGA
GNACGG
GNACGT
GNACGC
GNACGN
GNACTA
GNACTG
GNACTT
GNACTC
GNACTN
GNACCA
GNACCG
GNACCT
GNACCC
GNACCN
GNACNA
GNACNG
GNACNT
GNACNC
GNACNN
GNANAA
GNANAG
GNANAT
GNANAC
GNANAN
GNANGA
GNANGG
GNANGT
GNANGC
GNANGN
GNANTA
GNANTG
GNANTT
GNANTC
GNANTN
GNANCA
GNANCG
GNANCT
GNANCC
GNANCN
GNANNA
GNANNG
GNANNT
GNANNC
GNANNN
GNGAAA
GNGAAG
GNGAAT
GNGAAC
GNGAAN
GNGAGA
GNGAGG
GNGAGT
GNGAGC
GNGAGN
GNGATA
GNGATG
GNGATT
GNGATC
GNGATN
GNGACA
GNGACG
GNGACT
GNGACC
GNGACN
GNGANA
GNGANG
GNGANT
GNGANC
GNGANN
GNGGAA
GNGGAG
GNGGAT
GNGGAC
GNGGAN
GNGGGA
GNGGGG
GNGGGT
GNGGGC
GNGGGN
GNGGTA
GNGGTG
GNGGTT
GNGGTC
GNGGTN
GNGGCA
GNGGCG
GNGGCT
GNGGCC
GNGGCN
GNGGNA
GNGGNG
GNGGNT
GNGGNC
GNGGNN
GNGTAA
GNGTAG
GNGTAT
GNGTAC
GNGTAN
GNGTGA
GNGTGG
GNGTGT
GNGTGC
GNGTGN
GNGTTA
GNGTTG
GNGTTT
GNGTTC
GNGTTN
GNGTCA
GNGTCG
GNGTCT
GNGTCC
GNGTCN
GNGTNA
GNGTNG
GNGTNT
GNGTNC
GNGTNN
GNGCAA
GNGCAG
GNGCAT
GNGCAC
GNGCAN
GNGCGA
GNGCGG
GNGCGT
GNGCGC
GNGCGN
GNGCTA
GNGCTG
GNGCTT
GNGCTC
GNGCTN
GNGCCA
GNGCCG
GNGCCT
GNGCCC
GNGCCN
GNGCNA
GNGCNG
GNGCNT
GNGCNC
GNGCNN
GNGNAA
GNGNAG
GNGNAT
GNGNAC
GNGNAN
GNGNGA
GNGNGG
GNGNGT
GNGNGC
GNGNGN
GNGNTA
GNGNTG
GNGNTT
GNGNTC
GNGNTN
GNGNCA
GNGNCG
GNGNCT
GNGNCC
GNGNCN
GNGNNA
GNGNNG
GNGNNT
GNGNNC
GNGNNN
GNTAAA
GNTAAG
GNTAAT
GNTAAC
GNTAAN
GNTAGA
GNTAGG
GNTAGT
GNTAGC
GNTAGN
GNTATA
GNTATG
GNTATT
GNTATC
GNTATN
GNTACA
GNTACG
GNTACT
GNTACC
GNTACN
GNTANA
GNTANG
GNTANT
GNTANC
GNTANN
GNTGAA
GNTGAG
GNTGAT
GNTGAC
GNTGAN
GNTGGA
GNTGGG
GNTGGT
GNTGGC
GNTGGN
GNTGTA
GNTGTG
GNTGTT
GNTGTC
GNTGTN
GNTGCA
GNTGCG
GNTGCT
GNTGCC
GNTGCN
GNTGNA
GNTGNG
GNTGNT
GNTGNC
GNTGNN
GNTTAA
GNTTAG
GNTTAT
GNTTAC
GNTTAN
GNTTGA
GNTTGG
GNTTGT
GNTTGC
GNTTGN
GNTTTA
GNTTTG
GNTTTT
GNTTTC
GNTTTN
GNTTCA
GNTTCG
GNTTCT
GNTTCC
GNTTCN
GNTTNA
GNTTNG
GNTTNT
GNTTNC
GNTTNN
GNTCAA
GNTCAG
GNTCAT
GNTCAC
GNTCAN
GNTCGA
GNTCGG
GNTCGT
GNTCGC
GNTCGN
GNTCTA
GNTCTG
GNTCTT
GNTCTC
GNTCTN
GNTCCA
GNTCCG
GNTCCT
GNTCCC
GNTCCN
GNTCNA
GNTCNG
GNTCNT
GNTCNC
GNTCNN
GNTNAA
GNTNAG
GNTNAT
GNTNAC
GNTNAN
GNTNGA
GNTNGG
GNTNGT
GNTNGC
GNTNGN
GNTNTA
GNTNTG
GNTNTT
GNTNTC
GNTNTN
GNTNCA
GNTNCG
GNTNCT
GNTNCC
GNTNCN
GNTNNA
GNTNNG
GNTNNT
GNTNNC
GNTNNN
GNCAAA
GNCAAG
GNCAAT
GNCAAC
GNCAAN
GNCAGA
GNCAGG
GNCAGT
GNCAGC
GNCAGN
GNCATA
GNCATG
GNCATT
GNCATC
GNCATN
GNCACA
GNCACG
GNCACT
GNCACC
GNCACN
GNCANA
GNCANG
GNCANT
GNCANC
GNCANN
GNCGAA
GNCGAG
GNCGAT
GNCGAC
GNCGAN
GNCGGA
GNCGGG
GNCGGT
GNCGGC
GNCGGN
GNCGTA
GNCGTG
GNCGTT
GNCGTC
GNCGTN
GNCGCA
GNCGCG
GNCGCT
GNCGCC
GNCGCN
GNCGNA
GNCGNG
GNCGNT
GNCGNC
GNCGNN
GNCTAA
GNCTAG
GNCTAT
GNCTAC
GNCTAN
GNCTGA
GNCTGG
GNCTGT
GNCTGC
GNCTGN
GNCTTA
GNCTTG
GNCTTT
GNCTTC
GNCTTN
GNCTCA
GNCTCG
GNCTCT
GNCTCC
GNCTCN
GNCTNA
GNCTNG
GNCTNT
GNCTNC
GNCTNN
GNCCAA
GNCCAG
GNCCAT
GNCCAC
GNCCAN
GNCCGA
GNCCGG
GNCCGT
GNCCGC
GNCCGN
GNCCTA
GNCCTG
GNCCTT
GNCCTC
GNCCTN
GNCCCA
GNCCCG
GNCCCT
GNCCCC
GNCCCN
GNCCNA
GNCCNG
GNCCNT
GNCCNC
GNCCNN
GNCNAA
GNCNAG
GNCNAT
GNCNAC
GNCNAN
GNCNGA
GNCNGG
GNCNGT
GNCNGC
GNCNGN
GNCNTA
GNCNTG
GNCNTT
GNCNTC
GNCNTN
GNCNCA
GNCNCG
GNCNCT
GNCNCC
GNCNCN
GNCNNA
GNCNNG
GNCNNT
GNCNNC
GNCNNN
GNNAAA
GNNAAG
GNNAAT
GNNAAC
GNNAAN
GNNAGA
GNNAGG
GNNAGT
GNNAGC
GNNAGN
GNNATA
GNNATG
GNNATT
GNNATC
GNNATN
GNNACA
GNNACG
GNNACT
GNNACC
GNNACN
GNNANA
GNNANG
GNNANT
GNNANC
GNNANN
GNNGAA
GNNGAG
GNNGAT
GNNGAC
GNNGAN
GNNGGA
GNNGGG
GNNGGT
GNNGGC
GNNGGN
GNNGTA
GNNGTG
GNNGTT
GNNGTC
GNNGTN
GNNGCA
GNNGCG
GNNGCT
GNNGCC
GNNGCN
GNNGNA
GNNGNG
GNNGNT
GNNGNC
GNNGNN
GNNTAA
GNNTAG
GNNTAT
GNNTAC
GNNTAN
GNNTGA
GNNTGG
GNNTGT
GNNTGC
GNNTGN
GNNTTA
GNNTTG
GNNTTT
GNNTTC
GNNTTN
GNNTCA
GNNTCG
GNNTCT
GNNTCC
GNNTCN
GNNTNA
GNNTNG
GNNTNT
GNNTNC
GNNTNN
GNNCAA
GNNCAG
GNNCAT
GNNCAC
GNNCAN
GNNCGA
GNNCGG
GNNCGT
GNNCGC
GNNCGN
GNNCTA
GNNCTG
GNNCTT
GNNCTC
GNNCTN
GNNCCA
GNNCCG
GNNCCT
GNNCCC
GNNCCN
GNNCNA
GNNCNG
GNNCNT
GNNCNC
GNNCNN
GNNNAA
GNNNAG
GNNNAT
GNNNAC
GNNNAN
GNNNGA
GNNNGG
GNNNGT
GNNNGC
GNNNGN
GNNNTA
GNNNTG
GNNNTT
GNNNTC
GNNNTN
GNNNCA
GNNNCG
GNNNCT
GNNNCC
GNNNCN
GNNNNA
GNNNNG
GNNNNT
GNNNNC
GNNNNN
TAAAAA
TAAAAG
TAAAAT
TAAAAC
TAAAAN
TAAAGA
TAAAGG
TAAAGT
TAAAGC
TAAAGN
TAAATA
TAAATG
TAAATT
TAAATC
TAAATN
TAAACA
TAAACG
TAAACT
TAAACC
TAAACN
TAAANA
TAAANG
TAAANT
TAAANC
TAAANN
TAAGAA
TAAGAG
TAAGAT
TAAGAC
TAAGAN
TAAGGA
TAAGGG
TAAGGT
TAAGGC
TAAGGN
TAAGTA
TAAGTG
TAAGTT
TAAGTC
TAAGTN
TAAGCA
TAAGCG
TAAGCT
TAAGCC
TAAGCN
TAAGNA
TAAGNG
TAAGNT
TAAGNC
TAAGNN
TAATAA
TAATAG
TAATAT
TAATAC
TAATAN
TAATGA
TAATGG
TAATGT
TAATGC
TAATGN
TAATTA
TAATTG
TAATTT
TAATTC
TAATTN
TAATCA
TAATCG
TAATCT
TAATCC
TAATCN
TAATNA
TAATNG
TAATNT
TAATNC
TAATNN
TAACAA
TAACAG
TAACAT
TAACAC
TAACAN
TAACGA
TAACGG
TAACGT
TAACGC
TAACGN
TAACTA
TAACTG
TAACTT
TAACTC
TAACTN
TAACCA
TAACCG
TAACCT
TAACCC
TAACCN
TAACNA
TAACNG
TAACNT
TAACNC
TAACNN
TAANAA
TAANAG
TAANAT
TAANAC
TAANAN
TAANGA
TAANGG
TAANGT
TAANGC
TAANGN
TAANTA
TAANTG
TAANTT
TAANTC
TAANTN
TAANCA
TAANCG
TAANCT
TAANCC
TAANCN
TAANNA
TAANNG
TAANNT
TAANNC
TAANNN
TAGAAA
TAGAAG
TAGAAT
TAGAAC
TAGAAN
TAGAGA
TAGAGG
TAGAGT
TAGAGC
TAGAGN
TAGATA
TAGATG
TAGATT
TAGATC
TAGATN
TAGACA
TAGACG
TAGACT
TAGACC
TAGACN
TAGANA
TAGANG
TAGANT
TAGANC
TAGANN
TAGGAA
TAGGAG
TAGGAT
TAGGAC
TAGGAN
TAGGGA
TAGGGG
TAGGGT
TAGGGC
TAGGGN
TAGGTA
TAGGTG
TAGGTT
TAGGTC
TAGGTN
TAGGCA
TAGGCG
TAGGCT
TAGGCC
TAGGCN
TAGGNA
TAGGNG
TAGGNT
TAGGNC
TAGGNN
TAGTAA
TAGTAG
TAGTAT
TAGTAC
TAGTAN
TAGTGA
TAGTGG
TAGTGT
TAGTGC
TAGTGN
TAGTTA
TAGTTG
TAGTTT
TAGTTC
TAGTTN
TAGTCA
TAGTCG
TAGTCT
TAGTCC
TAGTCN
TAGTNA
TAGTNG
TAGTNT
TAGTNC
TAGTNN
TAGCAA
TAGCAG
TAGCAT
TAGCAC
TAGCAN
TAGCGA
TAGCGG
TAGCGT
TAGCGC
TAGCGN
TAGCTA
TAGCTG
TAGCTT
TAGCTC
TAGCTN
TAGCCA
TAGCCG
TAGCCT
TAGCCC
TAGCCN
TAGCNA
TAGCNG
TAGCNT
TAGCNC
TAGCNN
TAGNAA
TAGNAG
TAGNAT
TAGNAC
TAGNAN
TAGNGA
TAGNGG
TAGNGT
TAGNGC
TAGNGN
TAGNTA
TAGNTG
TAGNTT
TAGNTC
TAGNTN
TAGNCA
TAGNCG
TAGNCT
TAGNCC
TAGNCN
TAGNNA
TAGNNG
TAGNNT
TAGNNC
TAGNNN
TATAAA
TATAAG
TATAAT
TATAAC
TATAAN
TATAGA
TATAGG
TATAGT
TATAGC
TATAGN
TATATA
TATATG
TATATT
TATATC
TATATN
TATACA
TATACG
TATACT
TATACC
TATACN
TATANA
TATANG
TATANT
TATANC
TATANN
TATGAA
TATGAG
TATGAT
TATGAC
TATGAN
TATGGA
TATGGG
TATGGT
TATGGC
TATGGN
TATGTA
TATGTG
TATGTT
TATGTC
TATGTN
TATGCA
TATGCG
TATGCT
TATGCC
TATGCN
TATGNA
TATGNG
TATGNT
TATGNC
TATGNN
TATTAA
TATTAG
TATTAT
TATTAC
TATTAN
TATTGA
TATTGG
TATTGT
TATTGC
TATTGN
TATTTA
TATTTG
TATTTT
TATTTC
TATTTN
TATTCA
TATTCG
TATTCT
TATTCC
TATTCN
TATTNA
TATTNG
TATTNT
TATTNC
TATTNN
TATCAA
TATCAG
TATCAT
TATCAC
TATCAN
TATCGA
TATCGG
TATCGT
TATCGC
TATCGN
TATCTA
TATCTG
TATCTT
TATCTC
TATCTN
TATCCA
TATCCG
TATCCT
TATCCC
TATCCN
TATCNA
TATCNG
TATCNT
TATCNC
TATCNN
TATNAA
TATNAG
TATNAT
TATNAC
TATNAN
TATNGA
TATNGG
TATNGT
TATNGC
TATNGN
TATNTA
TATNTG
TATNTT
TATNTC
TATNTN
TATNCA
TATNCG
TATNCT
TATNCC
TATNCN
TATNNA
TATNNG
TATNNT
TATNNC
TATNNN
TACAAA
TACAAG
TACAAT
TACAAC
TACAAN
TACAGA
TACAGG
TACAGT
TACAGC
TACAGN
TACATA
TACATG
TACATT
TACATC
TACATN
TACACA
TACACG
TACACT
TACACC
TACACN
TACANA
TACANG
TACANT
TACANC
TACANN
TACGAA
TACGAG
TACGAT
TACGAC
TACGAN
TACGGA
TACGGG
TACGGT
TACGGC
TACGGN
TACGTA
TACGTG
TACGTT
TACGTC
TACGTN
TACGCA
TACGCG
TACGCT
TACGCC
TACGCN
TACGNA
TACGNG
TACGNT
TACGNC
TACGNN
TACTAA
TACTAG
TACTAT
TACTAC
TACTAN
TACTGA
TACTGG
TACTGT
TACTGC
TACTGN
TACTTA
TACTTG
TACTTT
TACTTC
TACTTN
TACTCA
TACTCG
TACTCT
TACTCC
TACTCN
TACTNA
TACTNG
TACTNT
TACTNC
TACTNN
TACCAA
TACCAG
TACCAT
TACCAC
TACCAN
TACCGA
TACCGG
TACCGT
TACCGC
TACCGN
TACCTA
TACCTG
TACCTT
TACCTC
TACCTN
TACCCA
TACCCG
TACCCT
TACCCC
TACCCN
TACCNA
TACCNG
TACCNT
TACCNC
TACCNN
TACNAA
TACNAG
TACNAT
TACNAC
TACNAN
TACNGA
TACNGG
TACNGT
TACNGC
TACNGN
TACNTA
TACNTG
TACNTT
TACNTC
TACNTN
TACNCA
TACNCG
TACNCT
TACNCC
TACNCN
TACNNA
TACNNG
TACNNT
TACNNC
TACNNN
TANAAA
TANAAG
TANAAT
TANAAC
TANAAN
TANAGA
TANAGG
TANAGT
TANAGC
TANAGN
TANATA
TANATG
TANATT
TANATC
TANATN
TANACA
TANACG
TANACT
TANACC
TANACN
TANANA
TANANG
TANANT
TANANC
TANANN
TANGAA
TANGAG
TANGAT
TANGAC
TANGAN
TANGGA
TANGGG
TANGGT
TANGGC
TANGGN
TANGTA
TANGTG
TANGTT
TANGTC
TANGTN
TANGCA
TANGCG
TANGCT
TANGCC
TANGCN
TANGNA
TANGNG
TANGNT
TANGNC
TANGNN
TANTAA
TANTAG
TANTAT
TANTAC
TANTAN
TANTGA
TANTGG
TANTGT
TANTGC
TANTGN
TANTTA
TANTTG
TANTTT
TANTTC
TANTTN
TANTCA
TANTCG
TANTCT
TANTCC
TANTCN
TANTNA
TANTNG
TANTNT
TANTNC
TANTNN
TANCAA
TANCAG
TANCAT
TANCAC
TANCAN
TANCGA
TANCGG
TANCGT
TANCGC
TANCGN
TANCTA
TANCTG
TANCTT
TANCTC
TANCTN
TANCCA
TANCCG
TANCCT
TANCCC
TANCCN
TANCNA
TANCNG
TANCNT
TANCNC
TANCNN
TANNAA
TANNAG
TANNAT
TANNAC
TANNAN
TANNGA
TANNGG
TANNGT
TANNGC
TANNGN
TANNTA
TANNTG
TANNTT
TANNTC
TANNTN
TANNCA
TANNCG
TANNCT
TANNCC
TANNCN
TANNNA
TANNNG
TANNNT
TANNNC
TANNNN
TGAAAA
TGAAAG
TGAAAT
TGAAAC
TGAAAN
TGAAGA
TGAAGG
TGAAGT
TGAAGC
TGAAGN
TGAATA
TGAATG
TGAATT
TGAATC
TGAATN
TGAACA
TGAACG
TGAACT
TGAACC
TGAACN
TGAANA
TGAANG
TGAANT
TGAANC
TGAANN
TGAGAA
TGAGAG
TGAGAT
TGAGAC
TGAGAN
TGAGGA
TGAGGG
TGAGGT
TGAGGC
TGAGGN
TGAGTA
TGAGTG
TGAGTT
TGAGTC
TGAGTN
TGAGCA
TGAGCG
TGAGCT
TGAGCC
TGAGCN
TGAGNA
TGAGNG
TGAGNT
TGAGNC
TGAGNN
TGATAA
TGATAG
TGATAT
TGATAC
TGATAN
TGATGA
TGATGG
TGATGT
TGATGC
TGATGN
TGATTA
TGATTG
TGATTT
TGATTC
TGATTN
TGATCA
TGATCG
TGATCT
TGATCC
TGATCN
TGATNA
TGATNG
TGATNT
TGATNC
TGATNN
TGACAA
TGACAG
TGACAT
TGACAC
TGACAN
TGACGA
TGACGG
TGACGT
TGACGC
TGACGN
TGACTA
TGACTG
TGACTT
TGACTC
TGACTN
TGACCA
TGACCG
TGACCT
TGACCC
TGACCN
TGACNA
TGACNG
TGACNT
TGACNC
TGACNN
TGANAA
TGANAG
TGANAT
TGANAC
TGANAN
TGANGA
TGANGG
TGANGT
TGANGC
TGANGN
TGANTA
TGANTG
TGANTT
TGANTC
TGANTN
TGANCA
TGANCG
TGANCT
TGANCC
TGANCN
TGANNA
TGANNG
TGANNT
TGANNC
TGANNN
TGGAAA
TGGAAG
TGGAAT
TGGAAC
TGGAAN
TGGAGA
TGGAGG
TGGAGT
TGGAGC
TGGAGN
TGGATA
TGGATG
TGGATT
TGGATC
TGGATN
TGGACA
TGGACG
TGGACT
TGGACC
TGGACN
TGGANA
TGGANG
TGGANT
TGGANC
TGGANN
TGGGAA
TGGGAG
TGGGAT
TGGGAC
TGGGAN
TGGGGA
TGGGGG
TGGGGT
TGGGGC
TGGGGN
TGGGTA
TGGGTG
TGGGTT
TGGGTC
TGGGTN
TGGGCA
TGGGCG
TGGGCT
TGGGCC
TGGGCN
TGGGNA
TGGGNG
TGGGNT
TGGGNC
TGGGNN
TGGTAA
TGGTAG
TGGTAT
TGGTAC
TGGTAN
TGGTGA
TGGTGG
TGGTGT
TGGTGC
TGGTGN
TGGTTA
TGGTTG
TGGTTT
TGGTTC
TGGTTN
TGGTCA
TGGTCG
TGGTCT
TGGTCC
TGGTCN
TGGTNA
TGGTNG
TGGTNT
TGGTNC
TGGTNN
TGGCAA
TGGCAG
TGGCAT
TGGCAC
TGGCAN
TGGCGA
TGGCGG
TGGCGT
TGGCGC
TGGCGN
TGGCTA
TGGCTG
TGGCTT
TGGCTC
TGGCTN
TGGCCA
TGGCCG
TGGCCT
TGGCCC
TGGCCN
TGGCNA
TGGCNG
TGGCNT
TGGCNC
TGGCNN
TGGNAA
TGGNAG
TGGNAT
TGGNAC
TGGNAN
TGGNGA
TGGNGG
TGGNGT
TGGNGC
TGGNGN
TGGNTA
TGGNTG
TGGNTT
TGGNTC
TGGNTN
TGGNCA
TGGNCG
TGGNCT
TGGNCC
TGGNCN
TGGNNA
TGGNNG
TGGNNT
TGGNNC
TGGNNN
TGTAAA
TGTAAG
TGTAAT
TGTAAC
TGTAAN
TGTAGA
TGTAGG
TGTAGT
TGTAGC
TGTAGN
TGTATA
TGTATG
TGTATT
