{"[PAD]": 0, "[UNK]": 1, "[CLS]": 2, "[SEP]": 3, "[MSK]": 4, "AAAAAA": 5, "AAAAAG": 6, "AAAAAT": 7, "AAAAAC": 8, "AAAAAN": 9, "AAAAGA": 10, "AAAAGG": 11, "AAAAGT": 12, "AAAAGC": 13, "AAAAGN": 14, "AAAATA": 15, "AAAATG": 16, "AAAATT": 17, "AAAATC": 18, "AAAATN": 19, "AAAACA": 20, "AAAACG": 21, "AAAACT": 22, "AAAACC": 23, "AAAACN": 24, "AAAANA": 25, "AAAANG": 26, "AAAANT": 27, "AAAANC": 28, "AAAANN": 29, "AAAGAA": 30, "AAAGAG": 31, "AAAGAT": 32, "AAAGAC": 33, "AAAGAN": 34, "AAAGGA": 35, "AAAGGG": 36, "AAAGGT": 37, "AAAGGC": 38, "AAAGGN": 39, "AAAGTA": 40, "AAAGTG": 41, "AAAGTT": 42, "AAAGTC": 43, "AAAGTN": 44, "AAAGCA": 45, "AAAGCG": 46, "AAAGCT": 47, "AAAGCC": 48, "AAAGCN": 49, "AAAGNA": 50, "AAAGNG": 51, "AAAGNT": 52, "AAAGNC": 53, "AAAGNN": 54, "AAATAA": 55, "AAATAG": 56, "AAATAT": 57, "AAATAC": 58, "AAATAN": 59, "AAATGA": 60, "AAATGG": 61, "AAATGT": 62, "AAATGC": 63, "AAATGN": 64, "AAATTA": 65, "AAATTG": 66, "AAATTT": 67, "AAATTC": 68, "AAATTN": 69, "AAATCA": 70, "AAATCG": 71, "AAATCT": 72, "AAATCC": 73, "AAATCN": 74, "AAATNA": 75, "AAATNG": 76, "AAATNT": 77, "AAATNC": 78, "AAATNN": 79, "AAACAA": 80, "AAACAG": 81, "AAACAT": 82, "AAACAC": 83, "AAACAN": 84, "AAACGA": 85, "AAACGG": 86, "AAACGT": 87, "AAACGC": 88, "AAACGN": 89, "AAACTA": 90, "AAACTG": 91, "AAACTT": 92, "AAACTC": 93, "AAACTN": 94, "AAACCA": 95, "AAACCG": 96, "AAACCT": 97, "AAACCC": 98, "AAACCN": 99, "AAACNA": 100, "AAACNG": 101, "AAACNT": 102, "AAACNC": 103, "AAACNN": 104, "AAANAA": 105, "AAANAG": 106, "AAANAT": 107, "AAANAC": 108, "AAANAN": 109, "AAANGA": 110, "AAANGG": 111, "AAANGT": 112, "AAANGC": 113, "AAANGN": 114, "AAANTA": 115, "AAANTG": 116, "AAANTT": 117, "AAANTC": 118, "AAANTN": 119, "AAANCA": 120, "AAANCG": 121, "AAANCT": 122, "AAANCC": 123, "AAANCN": 124, "AAANNA": 125, "AAANNG": 126, "AAANNT": 127, "AAANNC": 128, "AAANNN": 129, "AAGAAA": 130, "AAGAAG": 131, "AAGAAT": 132, "AAGAAC": 133, "AAGAAN": 134, "AAGAGA": 135, "AAGAGG": 136, "AAGAGT": 137, "AAGAGC": 138, "AAGAGN": 139, "AAGATA": 140, "AAGATG": 141, "AAGATT": 142, "AAGATC": 143, "AAGATN": 144, "AAGACA": 145, "AAGACG": 146, "AAGACT": 147, "AAGACC": 148, "AAGACN": 149, "AAGANA": 150, "AAGANG": 151, "AAGANT": 152, "AAGANC": 153, "AAGANN": 154, "AAGGAA": 155, "AAGGAG": 156, "AAGGAT": 157, "AAGGAC": 158, "AAGGAN": 159, "AAGGGA": 160, "AAGGGG": 161, "AAGGGT": 162, "AAGGGC": 163, "AAGGGN": 164, "AAGGTA": 165, "AAGGTG": 166, "AAGGTT": 167, "AAGGTC": 168, "AAGGTN": 169, "AAGGCA": 170, "AAGGCG": 171, "AAGGCT": 172, "AAGGCC": 173, "AAGGCN": 174, "AAGGNA": 175, "AAGGNG": 176, "AAGGNT": 177, "AAGGNC": 178, "AAGGNN": 179, "AAGTAA": 180, "AAGTAG": 181, "AAGTAT": 182, "AAGTAC": 183, "AAGTAN": 184, "AAGTGA": 185, "AAGTGG": 186, "AAGTGT": 187, "AAGTGC": 188, "AAGTGN": 189, "AAGTTA": 190, "AAGTTG": 191, "AAGTTT": 192, "AAGTTC": 193, "AAGTTN": 194, "AAGTCA": 195, "AAGTCG": 196, "AAGTCT": 197, "AAGTCC": 198, "AAGTCN": 199, "AAGTNA": 200, "AAGTNG": 201, "AAGTNT": 202, "AAGTNC": 203, "AAGTNN": 204, "AAGCAA": 205, "AAGCAG": 206, "AAGCAT": 207, "AAGCAC": 208, "AAGCAN": 209, "AAGCGA": 210, "AAGCGG": 211, "AAGCGT": 212, "AAGCGC": 213, "AAGCGN": 214, "AAGCTA": 215, "AAGCTG": 216, "AAGCTT": 217, "AAGCTC": 218, "AAGCTN": 219, "AAGCCA": 220, "AAGCCG": 221, "AAGCCT": 222, "AAGCCC": 223, "AAGCCN": 224, "AAGCNA": 225, "AAGCNG": 226, "AAGCNT": 227, "AAGCNC": 228, "AAGCNN": 229, "AAGNAA": 230, "AAGNAG": 231, "AAGNAT": 232, "AAGNAC": 233, "AAGNAN": 234, "AAGNGA": 235, "AAGNGG": 236, "AAGNGT": 237, "AAGNGC": 238, "AAGNGN": 239, "AAGNTA": 240, "AAGNTG": 241, "AAGNTT": 242, "AAGNTC": 243, "AAGNTN": 244, "AAGNCA": 245, "AAGNCG": 246, "AAGNCT": 247, "AAGNCC": 248, "AAGNCN": 249, "AAGNNA": 250, "AAGNNG": 251, "AAGNNT": 252, "AAGNNC": 253, "AAGNNN": 254, "AATAAA": 255, "AATAAG": 256, "AATAAT": 257, "AATAAC": 258, "AATAAN": 259, "AATAGA": 260, "AATAGG": 261, "AATAGT": 262, "AATAGC": 263, "AATAGN": 264, "AATATA": 265, "AATATG": 266, "AATATT": 267, "AATATC": 268, "AATATN": 269, "AATACA": 270, "AATACG": 271, "AATACT": 272, "AATACC": 273, "AATACN": 274, "AATANA": 275, "AATANG": 276, "AATANT": 277, "AATANC": 278, "AATANN": 279, "AATGAA": 280, "AATGAG": 281, "AATGAT": 282, "AATGAC": 283, "AATGAN": 284, "AATGGA": 285, "AATGGG": 286, "AATGGT": 287, "AATGGC": 288, "AATGGN": 289, "AATGTA": 290, "AATGTG": 291, "AATGTT": 292, "AATGTC": 293, "AATGTN": 294, "AATGCA": 295, "AATGCG": 296, "AATGCT": 297, "AATGCC": 298, "AATGCN": 299, "AATGNA": 300, "AATGNG": 301, "AATGNT": 302, "AATGNC": 303, "AATGNN": 304, "AATTAA": 305, "AATTAG": 306, "AATTAT": 307, "AATTAC": 308, "AATTAN": 309, "AATTGA": 310, "AATTGG": 311, "AATTGT": 312, "AATTGC": 313, "AATTGN": 314, "AATTTA": 315, "AATTTG": 316, "AATTTT": 317, "AATTTC": 318, "AATTTN": 319, "AATTCA": 320, "AATTCG": 321, "AATTCT": 322, "AATTCC": 323, "AATTCN": 324, "AATTNA": 325, "AATTNG": 326, "AATTNT": 327, "AATTNC": 328, "AATTNN": 329, "AATCAA": 330, "AATCAG": 331, "AATCAT": 332, "AATCAC": 333, "AATCAN": 334, "AATCGA": 335, "AATCGG": 336, "AATCGT": 337, "AATCGC": 338, "AATCGN": 339, "AATCTA": 340, "AATCTG": 341, "AATCTT": 342, "AATCTC": 343, "AATCTN": 344, "AATCCA": 345, "AATCCG": 346, "AATCCT": 347, "AATCCC": 348, "AATCCN": 349, "AATCNA": 350, "AATCNG": 351, "AATCNT": 352, "AATCNC": 353, "AATCNN": 354, "AATNAA": 355, "AATNAG": 356, "AATNAT": 357, "AATNAC": 358, "AATNAN": 359, "AATNGA": 360, "AATNGG": 361, "AATNGT": 362, "AATNGC": 363, "AATNGN": 364, "AATNTA": 365, "AATNTG": 366, "AATNTT": 367, "AATNTC": 368, "AATNTN": 369, "AATNCA": 370, "AATNCG": 371, "AATNCT": 372, "AATNCC": 373, "AATNCN": 374, "AATNNA": 375, "AATNNG": 376, "AATNNT": 377, "AATNNC": 378, "AATNNN": 379, "AACAAA": 380, "AACAAG": 381, "AACAAT": 382, "AACAAC": 383, "AACAAN": 384, "AACAGA": 385, "AACAGG": 386, "AACAGT": 387, "AACAGC": 388, "AACAGN": 389, "AACATA": 390, "AACATG": 391, "AACATT": 392, "AACATC": 393, "AACATN": 394, "AACACA": 395, "AACACG": 396, "AACACT": 397, "AACACC": 398, "AACACN": 399, "AACANA": 400, "AACANG": 401, "AACANT": 402, "AACANC": 403, "AACANN": 404, "AACGAA": 405, "AACGAG": 406, "AACGAT": 407, "AACGAC": 408, "AACGAN": 409, "AACGGA": 410, "AACGGG": 411, "AACGGT": 412, "AACGGC": 413, "AACGGN": 414, "AACGTA": 415, "AACGTG": 416, "AACGTT": 417, "AACGTC": 418, "AACGTN": 419, "AACGCA": 420, "AACGCG": 421, "AACGCT": 422, "AACGCC": 423, "AACGCN": 424, "AACGNA": 425, "AACGNG": 426, "AACGNT": 427, "AACGNC": 428, "AACGNN": 429, "AACTAA": 430, "AACTAG": 431, "AACTAT": 432, "AACTAC": 433, "AACTAN": 434, "AACTGA": 435, "AACTGG": 436, "AACTGT": 437, "AACTGC": 438, "AACTGN": 439, "AACTTA": 440, "AACTTG": 441, "AACTTT": 442, "AACTTC": 443, "AACTTN": 444, "AACTCA": 445, "AACTCG": 446, "AACTCT": 447, "AACTCC": 448, "AACTCN": 449, "AACTNA": 450, "AACTNG": 451, "AACTNT": 452, "AACTNC": 453, "AACTNN": 454, "AACCAA": 455, "AACCAG": 456, "AACCAT": 457, "AACCAC": 458, "AACCAN": 459, "AACCGA": 460, "AACCGG": 461, "AACCGT": 462, "AACCGC": 463, "AACCGN": 464, "AACCTA": 465, "AACCTG": 466, "AACCTT": 467, "AACCTC": 468, "AACCTN": 469, "AACCCA": 470, "AACCCG": 471, "AACCCT": 472, "AACCCC": 473, "AACCCN": 474, "AACCNA": 475, "AACCNG": 476, "AACCNT": 477, "AACCNC": 478, "AACCNN": 479, "AACNAA": 480, "AACNAG": 481, "AACNAT": 482, "AACNAC": 483, "AACNAN": 484, "AACNGA": 485, "AACNGG": 486, "AACNGT": 487, "AACNGC": 488, "AACNGN": 489, "AACNTA": 490, "AACNTG": 491, "AACNTT": 492, "AACNTC": 493, "AACNTN": 494, "AACNCA": 495, "AACNCG": 496, "AACNCT": 497, "AACNCC": 498, "AACNCN": 499, "AACNNA": 500, "AACNNG": 501, "AACNNT": 502, "AACNNC": 503, "AACNNN": 504, "AANAAA": 505, "AANAAG": 506, "AANAAT": 507, "AANAAC": 508, "AANAAN": 509, "AANAGA": 510, "AANAGG": 511, "AANAGT": 512, "AANAGC": 513, "AANAGN": 514, "AANATA": 515, "AANATG": 516, "AANATT": 517, "AANATC": 518, "AANATN": 519, "AANACA": 520, "AANACG": 521, "AANACT": 522, "AANACC": 523, "AANACN": 524, "AANANA": 525, "AANANG": 526, "AANANT": 527, "AANANC": 528, "AANANN": 529, "AANGAA": 530, "AANGAG": 531, "AANGAT": 532, "AANGAC": 533, "AANGAN": 534, "AANGGA": 535, "AANGGG": 536, "AANGGT": 537, "AANGGC": 538, "AANGGN": 539, "AANGTA": 540, "AANGTG": 541, "AANGTT": 542, "AANGTC": 543, "AANGTN": 544, "AANGCA": 545, "AANGCG": 546, "AANGCT": 547, "AANGCC": 548, "AANGCN": 549, "AANGNA": 550, "AANGNG": 551, "AANGNT": 552, "AANGNC": 553, "AANGNN": 554, "AANTAA": 555, "AANTAG": 556, "AANTAT": 557, "AANTAC": 558, "AANTAN": 559, "AANTGA": 560, "AANTGG": 561, "AANTGT": 562, "AANTGC": 563, "AANTGN": 564, "AANTTA": 565, "AANTTG": 566, "AANTTT": 567, "AANTTC": 568, "AANTTN": 569, "AANTCA": 570, "AANTCG": 571, "AANTCT": 572, "AANTCC": 573, "AANTCN": 574, "AANTNA": 575, "AANTNG": 576, "AANTNT": 577, "AANTNC": 578, "AANTNN": 579, "AANCAA": 580, "AANCAG": 581, "AANCAT": 582, "AANCAC": 583, "AANCAN": 584, "AANCGA": 585, "AANCGG": 586, "AANCGT": 587, "AANCGC": 588, "AANCGN": 589, "AANCTA": 590, "AANCTG": 591, "AANCTT": 592, "AANCTC": 593, "AANCTN": 594, "AANCCA": 595, "AANCCG": 596, "AANCCT": 597, "AANCCC": 598, "AANCCN": 599, "AANCNA": 600, "AANCNG": 601, "AANCNT": 602, "AANCNC": 603, "AANCNN": 604, "AANNAA": 605, "AANNAG": 606, "AANNAT": 607, "AANNAC": 608, "AANNAN": 609, "AANNGA": 610, "AANNGG": 611, "AANNGT": 612, "AANNGC": 613, "AANNGN": 614, "AANNTA": 615, "AANNTG": 616, "AANNTT": 617, "AANNTC": 618, "AANNTN": 619, "AANNCA": 620, "AANNCG": 621, "AANNCT": 622, "AANNCC": 623, "AANNCN": 624, "AANNNA": 625, "AANNNG": 626, "AANNNT": 627, "AANNNC": 628, "AANNNN": 629, "AGAAAA": 630, "AGAAAG": 631, "AGAAAT": 632, "AGAAAC": 633, "AGAAAN": 634, "AGAAGA": 635, "AGAAGG": 636, "AGAAGT": 637, "AGAAGC": 638, "AGAAGN": 639, "AGAATA": 640, "AGAATG": 641, "AGAATT": 642, "AGAATC": 643, "AGAATN": 644, "AGAACA": 645, "AGAACG": 646, "AGAACT": 647, "AGAACC": 648, "AGAACN": 649, "AGAANA": 650, "AGAANG": 651, "AGAANT": 652, "AGAANC": 653, "AGAANN": 654, "AGAGAA": 655, "AGAGAG": 656, "AGAGAT": 657, "AGAGAC": 658, "AGAGAN": 659, "AGAGGA": 660, "AGAGGG": 661, "AGAGGT": 662, "AGAGGC": 663, "AGAGGN": 664, "AGAGTA": 665, "AGAGTG": 666, "AGAGTT": 667, "AGAGTC": 668, "AGAGTN": 669, "AGAGCA": 670, "AGAGCG": 671, "AGAGCT": 672, "AGAGCC": 673, "AGAGCN": 674, "AGAGNA": 675, "AGAGNG": 676, "AGAGNT": 677, "AGAGNC": 678, "AGAGNN": 679, "AGATAA": 680, "AGATAG": 681, "AGATAT": 682, "AGATAC": 683, "AGATAN": 684, "AGATGA": 685, "AGATGG": 686, "AGATGT": 687, "AGATGC": 688, "AGATGN": 689, "AGATTA": 690, "AGATTG": 691, "AGATTT": 692, "AGATTC": 693, "AGATTN": 694, "AGATCA": 695, "AGATCG": 696, "AGATCT": 697, "AGATCC": 698, "AGATCN": 699, "AGATNA": 700, "AGATNG": 701, "AGATNT": 702, "AGATNC": 703, "AGATNN": 704, "AGACAA": 705, "AGACAG": 706, "AGACAT": 707, "AGACAC": 708, "AGACAN": 709, "AGACGA": 710, "AGACGG": 711, "AGACGT": 712, "AGACGC": 713, "AGACGN": 714, "AGACTA": 715, "AGACTG": 716, "AGACTT": 717, "AGACTC": 718, "AGACTN": 719, "AGACCA": 720, "AGACCG": 721, "AGACCT": 722, "AGACCC": 723, "AGACCN": 724, "AGACNA": 725, "AGACNG": 726, "AGACNT": 727, "AGACNC": 728, "AGACNN": 729, "AGANAA": 730, "AGANAG": 731, "AGANAT": 732, "AGANAC": 733, "AGANAN": 734, "AGANGA": 735, "AGANGG": 736, "AGANGT": 737, "AGANGC": 738, "AGANGN": 739, "AGANTA": 740, "AGANTG": 741, "AGANTT": 742, "AGANTC": 743, "AGANTN": 744, "AGANCA": 745, "AGANCG": 746, "AGANCT": 747, "AGANCC": 748, "AGANCN": 749, "AGANNA": 750, "AGANNG": 751, "AGANNT": 752, "AGANNC": 753, "AGANNN": 754, "AGGAAA": 755, "AGGAAG": 756, "AGGAAT": 757, "AGGAAC": 758, "AGGAAN": 759, "AGGAGA": 760, "AGGAGG": 761, "AGGAGT": 762, "AGGAGC": 763, "AGGAGN": 764, "AGGATA": 765, "AGGATG": 766, "AGGATT": 767, "AGGATC": 768, "AGGATN": 769, "AGGACA": 770, "AGGACG": 771, "AGGACT": 772, "AGGACC": 773, "AGGACN": 774, "AGGANA": 775, "AGGANG": 776, "AGGANT": 777, "AGGANC": 778, "AGGANN": 779, "AGGGAA": 780, "AGGGAG": 781, "AGGGAT": 782, "AGGGAC": 783, "AGGGAN": 784, "AGGGGA": 785, "AGGGGG": 786, "AGGGGT": 787, "AGGGGC": 788, "AGGGGN": 789, "AGGGTA": 790, "AGGGTG": 791, "AGGGTT": 792, "AGGGTC": 793, "AGGGTN": 794, "AGGGCA": 795, "AGGGCG": 796, "AGGGCT": 797, "AGGGCC": 798, "AGGGCN": 799, "AGGGNA": 800, "AGGGNG": 801, "AGGGNT": 802, "AGGGNC": 803, "AGGGNN": 804, "AGGTAA": 805, "AGGTAG": 806, "AGGTAT": 807, "AGGTAC": 808, "AGGTAN": 809, "AGGTGA": 810, "AGGTGG": 811, "AGGTGT": 812, "AGGTGC": 813, "AGGTGN": 814, "AGGTTA": 815, "AGGTTG": 816, "AGGTTT": 817, "AGGTTC": 818, "AGGTTN": 819, "AGGTCA": 820, "AGGTCG": 821, "AGGTCT": 822, "AGGTCC": 823, "AGGTCN": 824, "AGGTNA": 825, "AGGTNG": 826, "AGGTNT": 827, "AGGTNC": 828, "AGGTNN": 829, "AGGCAA": 830, "AGGCAG": 831, "AGGCAT": 832, "AGGCAC": 833, "AGGCAN": 834, "AGGCGA": 835, "AGGCGG": 836, "AGGCGT": 837, "AGGCGC": 838, "AGGCGN": 839, "AGGCTA": 840, "AGGCTG": 841, "AGGCTT": 842, "AGGCTC": 843, "AGGCTN": 844, "AGGCCA": 845, "AGGCCG": 846, "AGGCCT": 847, "AGGCCC": 848, "AGGCCN": 849, "AGGCNA": 850, "AGGCNG": 851, "AGGCNT": 852, "AGGCNC": 853, "AGGCNN": 854, "AGGNAA": 855, "AGGNAG": 856, "AGGNAT": 857, "AGGNAC": 858, "AGGNAN": 859, "AGGNGA": 860, "AGGNGG": 861, "AGGNGT": 862, "AGGNGC": 863, "AGGNGN": 864, "AGGNTA": 865, "AGGNTG": 866, "AGGNTT": 867, "AGGNTC": 868, "AGGNTN": 869, "AGGNCA": 870, "AGGNCG": 871, "AGGNCT": 872, "AGGNCC": 873, "AGGNCN": 874, "AGGNNA": 875, "AGGNNG": 876, "AGGNNT": 877, "AGGNNC": 878, "AGGNNN": 879, "AGTAAA": 880, "AGTAAG": 881, "AGTAAT": 882, "AGTAAC": 883, "AGTAAN": 884, "AGTAGA": 885, "AGTAGG": 886, "AGTAGT": 887, "AGTAGC": 888, "AGTAGN": 889, "AGTATA": 890, "AGTATG": 891, "AGTATT": 892, "AGTATC": 893, "AGTATN": 894, "AGTACA": 895, "AGTACG": 896, "AGTACT": 897, "AGTACC": 898, "AGTACN": 899, "AGTANA": 900, "AGTANG": 901, "AGTANT": 902, "AGTANC": 903, "AGTANN": 904, "AGTGAA": 905, "AGTGAG": 906, "AGTGAT": 907, "AGTGAC": 908, "AGTGAN": 909, "AGTGGA": 910, "AGTGGG": 911, "AGTGGT": 912, "AGTGGC": 913, "AGTGGN": 914, "AGTGTA": 915, "AGTGTG": 916, "AGTGTT": 917, "AGTGTC": 918, "AGTGTN": 919, "AGTGCA": 920, "AGTGCG": 921, "AGTGCT": 922, "AGTGCC": 923, "AGTGCN": 924, "AGTGNA": 925, "AGTGNG": 926, "AGTGNT": 927, "AGTGNC": 928, "AGTGNN": 929, "AGTTAA": 930, "AGTTAG": 931, "AGTTAT": 932, "AGTTAC": 933, "AGTTAN": 934, "AGTTGA": 935, "AGTTGG": 936, "AGTTGT": 937, "AGTTGC": 938, "AGTTGN": 939, "AGTTTA": 940, "AGTTTG": 941, "AGTTTT": 942, "AGTTTC": 943, "AGTTTN": 944, "AGTTCA": 945, "AGTTCG": 946, "AGTTCT": 947, "AGTTCC": 948, "AGTTCN": 949, "AGTTNA": 950, "AGTTNG": 951, "AGTTNT": 952, "AGTTNC": 953, "AGTTNN": 954, "AGTCAA": 955, "AGTCAG": 956, "AGTCAT": 957, "AGTCAC": 958, "AGTCAN": 959, "AGTCGA": 960, "AGTCGG": 961, "AGTCGT": 962, "AGTCGC": 963, "AGTCGN": 964, "AGTCTA": 965, "AGTCTG": 966, "AGTCTT": 967, "AGTCTC": 968, "AGTCTN": 969, "AGTCCA": 970, "AGTCCG": 971, "AGTCCT": 972, "AGTCCC": 973, "AGTCCN": 974, "AGTCNA": 975, "AGTCNG": 976, "AGTCNT": 977, "AGTCNC": 978, "AGTCNN": 979, "AGTNAA": 980, "AGTNAG": 981, "AGTNAT": 982, "AGTNAC": 983, "AGTNAN": 984, "AGTNGA": 985, "AGTNGG": 986, "AGTNGT": 987, "AGTNGC": 988, "AGTNGN": 989, "AGTNTA": 990, "AGTNTG": 991, "AGTNTT": 992, "AGTNTC": 993, "AGTNTN": 994, "AGTNCA": 995, "AGTNCG": 996, "AGTNCT": 997, "AGTNCC": 998, "AGTNCN": 999, "AGTNNA": 1000, "AGTNNG": 1001, "AGTNNT": 1002, "AGTNNC": 1003, "AGTNNN": 1004, "AGCAAA": 1005, "AGCAAG": 1006, "AGCAAT": 1007, "AGCAAC": 1008, "AGCAAN": 1009, "AGCAGA": 1010, "AGCAGG": 1011, "AGCAGT": 1012, "AGCAGC": 1013, "AGCAGN": 1014, "AGCATA": 1015, "AGCATG": 1016, "AGCATT": 1017, "AGCATC": 1018, "AGCATN": 1019, "AGCACA": 1020, "AGCACG": 1021, "AGCACT": 1022, "AGCACC": 1023, "AGCACN": 1024, "AGCANA": 1025, "AGCANG": 1026, "AGCANT": 1027, "AGCANC": 1028, "AGCANN": 1029, "AGCGAA": 1030, "AGCGAG": 1031, "AGCGAT": 1032, "AGCGAC": 1033, "AGCGAN": 1034, "AGCGGA": 1035, "AGCGGG": 1036, "AGCGGT": 1037, "AGCGGC": 1038, "AGCGGN": 1039, "AGCGTA": 1040, "AGCGTG": 1041, "AGCGTT": 1042, "AGCGTC": 1043, "AGCGTN": 1044, "AGCGCA": 1045, "AGCGCG": 1046, "AGCGCT": 1047, "AGCGCC": 1048, "AGCGCN": 1049, "AGCGNA": 1050, "AGCGNG": 1051, "AGCGNT": 1052, "AGCGNC": 1053, "AGCGNN": 1054, "AGCTAA": 1055, "AGCTAG": 1056, "AGCTAT": 1057, "AGCTAC": 1058, "AGCTAN": 1059, "AGCTGA": 1060, "AGCTGG": 1061, "AGCTGT": 1062, "AGCTGC": 1063, "AGCTGN": 1064, "AGCTTA": 1065, "AGCTTG": 1066, "AGCTTT": 1067, "AGCTTC": 1068, "AGCTTN": 1069, "AGCTCA": 1070, "AGCTCG": 1071, "AGCTCT": 1072, "AGCTCC": 1073, "AGCTCN": 1074, "AGCTNA": 1075, "AGCTNG": 1076, "AGCTNT": 1077, "AGCTNC": 1078, "AGCTNN": 1079, "AGCCAA": 1080, "AGCCAG": 1081, "AGCCAT": 1082, "AGCCAC": 1083, "AGCCAN": 1084, "AGCCGA": 1085, "AGCCGG": 1086, "AGCCGT": 1087, "AGCCGC": 1088, "AGCCGN": 1089, "AGCCTA": 1090, "AGCCTG": 1091, "AGCCTT": 1092, "AGCCTC": 1093, "AGCCTN": 1094, "AGCCCA": 1095, "AGCCCG": 1096, "AGCCCT": 1097, "AGCCCC": 1098, "AGCCCN": 1099, "AGCCNA": 1100, "AGCCNG": 1101, "AGCCNT": 1102, "AGCCNC": 1103, "AGCCNN": 1104, "AGCNAA": 1105, "AGCNAG": 1106, "AGCNAT": 1107, "AGCNAC": 1108, "AGCNAN": 1109, "AGCNGA": 1110, "AGCNGG": 1111, "AGCNGT": 1112, "AGCNGC": 1113, "AGCNGN": 1114, "AGCNTA": 1115, "AGCNTG": 1116, "AGCNTT": 1117, "AGCNTC": 1118, "AGCNTN": 1119, "AGCNCA": 1120, "AGCNCG": 1121, "AGCNCT": 1122, "AGCNCC": 1123, "AGCNCN": 1124, "AGCNNA": 1125, "AGCNNG": 1126, "AGCNNT": 1127, "AGCNNC": 1128, "AGCNNN": 1129, "AGNAAA": 1130, "AGNAAG": 1131, "AGNAAT": 1132, "AGNAAC": 1133, "AGNAAN": 1134, "AGNAGA": 1135, "AGNAGG": 1136, "AGNAGT": 1137, "AGNAGC": 1138, "AGNAGN": 1139, "AGNATA": 1140, "AGNATG": 1141, "AGNATT": 1142, "AGNATC": 1143, "AGNATN": 1144, "AGNACA": 1145, "AGNACG": 1146, "AGNACT": 1147, "AGNACC": 1148, "AGNACN": 1149, "AGNANA": 1150, "AGNANG": 1151, "AGNANT": 1152, "AGNANC": 1153, "AGNANN": 1154, "AGNGAA": 1155, "AGNGAG": 1156, "AGNGAT": 1157, "AGNGAC": 1158, "AGNGAN": 1159, "AGNGGA": 1160, "AGNGGG": 1161, "AGNGGT": 1162, "AGNGGC": 1163, "AGNGGN": 1164, "AGNGTA": 1165, "AGNGTG": 1166, "AGNGTT": 1167, "AGNGTC": 1168, "AGNGTN": 1169, "AGNGCA": 1170, "AGNGCG": 1171, "AGNGCT": 1172, "AGNGCC": 1173, "AGNGCN": 1174, "AGNGNA": 1175, "AGNGNG": 1176, "AGNGNT": 1177, "AGNGNC": 1178, "AGNGNN": 1179, "AGNTAA": 1180, "AGNTAG": 1181, "AGNTAT": 1182, "AGNTAC": 1183, "AGNTAN": 1184, "AGNTGA": 1185, "AGNTGG": 1186, "AGNTGT": 1187, "AGNTGC": 1188, "AGNTGN": 1189, "AGNTTA": 1190, "AGNTTG": 1191, "AGNTTT": 1192, "AGNTTC": 1193, "AGNTTN": 1194, "AGNTCA": 1195, "AGNTCG": 1196, "AGNTCT": 1197, "AGNTCC": 1198, "AGNTCN": 1199, "AGNTNA": 1200, "AGNTNG": 1201, "AGNTNT": 1202, "AGNTNC": 1203, "AGNTNN": 1204, "AGNCAA": 1205, "AGNCAG": 1206, "AGNCAT": 1207, "AGNCAC": 1208, "AGNCAN": 1209, "AGNCGA": 1210, "AGNCGG": 1211, "AGNCGT": 1212, "AGNCGC": 1213, "AGNCGN": 1214, "AGNCTA": 1215, "AGNCTG": 1216, "AGNCTT": 1217, "AGNCTC": 1218, "AGNCTN": 1219, "AGNCCA": 1220, "AGNCCG": 1221, "AGNCCT": 1222, "AGNCCC": 1223, "AGNCCN": 1224, "AGNCNA": 1225, "AGNCNG": 1226, "AGNCNT": 1227, "AGNCNC": 1228, "AGNCNN": 1229, "AGNNAA": 1230, "AGNNAG": 1231, "AGNNAT": 1232, "AGNNAC": 1233, "AGNNAN": 1234, "AGNNGA": 1235, "AGNNGG": 1236, "AGNNGT": 1237, "AGNNGC": 1238, "AGNNGN": 1239, "AGNNTA": 1240, "AGNNTG": 1241, "AGNNTT": 1242, "AGNNTC": 1243, "AGNNTN": 1244, "AGNNCA": 1245, "AGNNCG": 1246, "AGNNCT": 1247, "AGNNCC": 1248, "AGNNCN": 1249, "AGNNNA": 1250, "AGNNNG": 1251, "AGNNNT": 1252, "AGNNNC": 1253, "AGNNNN": 1254, "ATAAAA": 1255, "ATAAAG": 1256, "ATAAAT": 1257, "ATAAAC": 1258, "ATAAAN": 1259, "ATAAGA": 1260, "ATAAGG": 1261, "ATAAGT": 1262, "ATAAGC": 1263, "ATAAGN": 1264, "ATAATA": 1265, "ATAATG": 1266, "ATAATT": 1267, "ATAATC": 1268, "ATAATN": 1269, "ATAACA": 1270, "ATAACG": 1271, "ATAACT": 1272, "ATAACC": 1273, "ATAACN": 1274, "ATAANA": 1275, "ATAANG": 1276, "ATAANT": 1277, "ATAANC": 1278, "ATAANN": 1279, "ATAGAA": 1280, "ATAGAG": 1281, "ATAGAT": 1282, "ATAGAC": 1283, "ATAGAN": 1284, "ATAGGA": 1285, "ATAGGG": 1286, "ATAGGT": 1287, "ATAGGC": 1288, "ATAGGN": 1289, "ATAGTA": 1290, "ATAGTG": 1291, "ATAGTT": 1292, "ATAGTC": 1293, "ATAGTN": 1294, "ATAGCA": 1295, "ATAGCG": 1296, "ATAGCT": 1297, "ATAGCC": 1298, "ATAGCN": 1299, "ATAGNA": 1300, "ATAGNG": 1301, "ATAGNT": 1302, "ATAGNC": 1303, "ATAGNN": 1304, "ATATAA": 1305, "ATATAG": 1306, "ATATAT": 1307, "ATATAC": 1308, "ATATAN": 1309, "ATATGA": 1310, "ATATGG": 1311, "ATATGT": 1312, "ATATGC": 1313, "ATATGN": 1314, "ATATTA": 1315, "ATATTG": 1316, "ATATTT": 1317, "ATATTC": 1318, "ATATTN": 1319, "ATATCA": 1320, "ATATCG": 1321, "ATATCT": 1322, "ATATCC": 1323, "ATATCN": 1324, "ATATNA": 1325, "ATATNG": 1326, "ATATNT": 1327, "ATATNC": 1328, "ATATNN": 1329, "ATACAA": 1330, "ATACAG": 1331, "ATACAT": 1332, "ATACAC": 1333, "ATACAN": 1334, "ATACGA": 1335, "ATACGG": 1336, "ATACGT": 1337, "ATACGC": 1338, "ATACGN": 1339, "ATACTA": 1340, "ATACTG": 1341, "ATACTT": 1342, "ATACTC": 1343, "ATACTN": 1344, "ATACCA": 1345, "ATACCG": 1346, "ATACCT": 1347, "ATACCC": 1348, "ATACCN": 1349, "ATACNA": 1350, "ATACNG": 1351, "ATACNT": 1352, "ATACNC": 1353, "ATACNN": 1354, "ATANAA": 1355, "ATANAG": 1356, "ATANAT": 1357, "ATANAC": 1358, "ATANAN": 1359, "ATANGA": 1360, "ATANGG": 1361, "ATANGT": 1362, "ATANGC": 1363, "ATANGN": 1364, "ATANTA": 1365, "ATANTG": 1366, "ATANTT": 1367, "ATANTC": 1368, "ATANTN": 1369, "ATANCA": 1370, "ATANCG": 1371, "ATANCT": 1372, "ATANCC": 1373, "ATANCN": 1374, "ATANNA": 1375, "ATANNG": 1376, "ATANNT": 1377, "ATANNC": 1378, "ATANNN": 1379, "ATGAAA": 1380, "ATGAAG": 1381, "ATGAAT": 1382, "ATGAAC": 1383, "ATGAAN": 1384, "ATGAGA": 1385, "ATGAGG": 1386, "ATGAGT": 1387, "ATGAGC": 1388, "ATGAGN": 1389, "ATGATA": 1390, "ATGATG": 1391, "ATGATT": 1392, "ATGATC": 1393, "ATGATN": 1394, "ATGACA": 1395, "ATGACG": 1396, "ATGACT": 1397, "ATGACC": 1398, "ATGACN": 1399, "ATGANA": 1400, "ATGANG": 1401, "ATGANT": 1402, "ATGANC": 1403, "ATGANN": 1404, "ATGGAA": 1405, "ATGGAG": 1406, "ATGGAT": 1407, "ATGGAC": 1408, "ATGGAN": 1409, "ATGGGA": 1410, "ATGGGG": 1411, "ATGGGT": 1412, "ATGGGC": 1413, "ATGGGN": 1414, "ATGGTA": 1415, "ATGGTG": 1416, "ATGGTT": 1417, "ATGGTC": 1418, "ATGGTN": 1419, "ATGGCA": 1420, "ATGGCG": 1421, "ATGGCT": 1422, "ATGGCC": 1423, "ATGGCN": 1424, "ATGGNA": 1425, "ATGGNG": 1426, "ATGGNT": 1427, "ATGGNC": 1428, "ATGGNN": 1429, "ATGTAA": 1430, "ATGTAG": 1431, "ATGTAT": 1432, "ATGTAC": 1433, "ATGTAN": 1434, "ATGTGA": 1435, "ATGTGG": 1436, "ATGTGT": 1437, "ATGTGC": 1438, "ATGTGN": 1439, "ATGTTA": 1440, "ATGTTG": 1441, "ATGTTT": 1442, "ATGTTC": 1443, "ATGTTN": 1444, "ATGTCA": 1445, "ATGTCG": 1446, "ATGTCT": 1447, "ATGTCC": 1448, "ATGTCN": 1449, "ATGTNA": 1450, "ATGTNG": 1451, "ATGTNT": 1452, "ATGTNC": 1453, "ATGTNN": 1454, "ATGCAA": 1455, "ATGCAG": 1456, "ATGCAT": 1457, "ATGCAC": 1458, "ATGCAN": 1459, "ATGCGA": 1460, "ATGCGG": 1461, "ATGCGT": 1462, "ATGCGC": 1463, "ATGCGN": 1464, "ATGCTA": 1465, "ATGCTG": 1466, "ATGCTT": 1467, "ATGCTC": 1468, "ATGCTN": 1469, "ATGCCA": 1470, "ATGCCG": 1471, "ATGCCT": 1472, "ATGCCC": 1473, "ATGCCN": 1474, "ATGCNA": 1475, "ATGCNG": 1476, "ATGCNT": 1477, "ATGCNC": 1478, "ATGCNN": 1479, "ATGNAA": 1480, "ATGNAG": 1481, "ATGNAT": 1482, "ATGNAC": 1483, "ATGNAN": 1484, "ATGNGA": 1485, "ATGNGG": 1486, "ATGNGT": 1487, "ATGNGC": 1488, "ATGNGN": 1489, "ATGNTA": 1490, "ATGNTG": 1491, "ATGNTT": 1492, "ATGNTC": 1493, "ATGNTN": 1494, "ATGNCA": 1495, "ATGNCG": 1496, "ATGNCT": 1497, "ATGNCC": 1498, "ATGNCN": 1499, "ATGNNA": 1500, "ATGNNG": 1501, "ATGNNT": 1502, "ATGNNC": 1503, "ATGNNN": 1504, "ATTAAA": 1505, "ATTAAG": 1506, "ATTAAT": 1507, "ATTAAC": 1508, "ATTAAN": 1509, "ATTAGA": 1510, "ATTAGG": 1511, "ATTAGT": 1512, "ATTAGC": 1513, "ATTAGN": 1514, "ATTATA": 1515, "ATTATG": 1516, "ATTATT": 1517, "ATTATC": 1518, "ATTATN": 1519, "ATTACA": 1520, "ATTACG": 1521, "ATTACT": 1522, "ATTACC": 1523, "ATTACN": 1524, "ATTANA": 1525, "ATTANG": 1526, "ATTANT": 1527, "ATTANC": 1528, "ATTANN": 1529, "ATTGAA": 1530, "ATTGAG": 1531, "ATTGAT": 1532, "ATTGAC": 1533, "ATTGAN": 1534, "ATTGGA": 1535, "ATTGGG": 1536, "ATTGGT": 1537, "ATTGGC": 1538, "ATTGGN": 1539, "ATTGTA": 1540, "ATTGTG": 1541, "ATTGTT": 1542, "ATTGTC": 1543, "ATTGTN": 1544, "ATTGCA": 1545, "ATTGCG": 1546, "ATTGCT": 1547, "ATTGCC": 1548, "ATTGCN": 1549, "ATTGNA": 1550, "ATTGNG": 1551, "ATTGNT": 1552, "ATTGNC": 1553, "ATTGNN": 1554, "ATTTAA": 1555, "ATTTAG": 1556, "ATTTAT": 1557, "ATTTAC": 1558, "ATTTAN": 1559, "ATTTGA": 1560, "ATTTGG": 1561, "ATTTGT": 1562, "ATTTGC": 1563, "ATTTGN": 1564, "ATTTTA": 1565, "ATTTTG": 1566, "ATTTTT": 1567, "ATTTTC": 1568, "ATTTTN": 1569, "ATTTCA": 1570, "ATTTCG": 1571, "ATTTCT": 1572, "ATTTCC": 1573, "ATTTCN": 1574, "ATTTNA": 1575, "ATTTNG": 1576, "ATTTNT": 1577, "ATTTNC": 1578, "ATTTNN": 1579, "ATTCAA": 1580, "ATTCAG": 1581, "ATTCAT": 1582, "ATTCAC": 1583, "ATTCAN": 1584, "ATTCGA": 1585, "ATTCGG": 1586, "ATTCGT": 1587, "ATTCGC": 1588, "ATTCGN": 1589, "ATTCTA": 1590, "ATTCTG": 1591, "ATTCTT": 1592, "ATTCTC": 1593, "ATTCTN": 1594, "ATTCCA": 1595, "ATTCCG": 1596, "ATTCCT": 1597, "ATTCCC": 1598, "ATTCCN": 1599, "ATTCNA": 1600, "ATTCNG": 1601, "ATTCNT": 1602, "ATTCNC": 1603, "ATTCNN": 1604, "ATTNAA": 1605, "ATTNAG": 1606, "ATTNAT": 1607, "ATTNAC": 1608, "ATTNAN": 1609, "ATTNGA": 1610, "ATTNGG": 1611, "ATTNGT": 1612, "ATTNGC": 1613, "ATTNGN": 1614, "ATTNTA": 1615, "ATTNTG": 1616, "ATTNTT": 1617, "ATTNTC": 1618, "ATTNTN": 1619, "ATTNCA": 1620, "ATTNCG": 1621, "ATTNCT": 1622, "ATTNCC": 1623, "ATTNCN": 1624, "ATTNNA": 1625, "ATTNNG": 1626, "ATTNNT": 1627, "ATTNNC": 1628, "ATTNNN": 1629, "ATCAAA": 1630, "ATCAAG": 1631, "ATCAAT": 1632, "ATCAAC": 1633, "ATCAAN": 1634, "ATCAGA": 1635, "ATCAGG": 1636, "ATCAGT": 1637, "ATCAGC": 1638, "ATCAGN": 1639, "ATCATA": 1640, "ATCATG": 1641, "ATCATT": 1642, "ATCATC": 1643, "ATCATN": 1644, "ATCACA": 1645, "ATCACG": 1646, "ATCACT": 1647, "ATCACC": 1648, "ATCACN": 1649, "ATCANA": 1650, "ATCANG": 1651, "ATCANT": 1652, "ATCANC": 1653, "ATCANN": 1654, "ATCGAA": 1655, "ATCGAG": 1656, "ATCGAT": 1657, "ATCGAC": 1658, "ATCGAN": 1659, "ATCGGA": 1660, "ATCGGG": 1661, "ATCGGT": 1662, "ATCGGC": 1663, "ATCGGN": 1664, "ATCGTA": 1665, "ATCGTG": 1666, "ATCGTT": 1667, "ATCGTC": 1668, "ATCGTN": 1669, "ATCGCA": 1670, "ATCGCG": 1671, "ATCGCT": 1672, "ATCGCC": 1673, "ATCGCN": 1674, "ATCGNA": 1675, "ATCGNG": 1676, "ATCGNT": 1677, "ATCGNC": 1678, "ATCGNN": 1679, "ATCTAA": 1680, "ATCTAG": 1681, "ATCTAT": 1682, "ATCTAC": 1683, "ATCTAN": 1684, "ATCTGA": 1685, "ATCTGG": 1686, "ATCTGT": 1687, "ATCTGC": 1688, "ATCTGN": 1689, "ATCTTA": 1690, "ATCTTG": 1691, "ATCTTT": 1692, "ATCTTC": 1693, "ATCTTN": 1694, "ATCTCA": 1695, "ATCTCG": 1696, "ATCTCT": 1697, "ATCTCC": 1698, "ATCTCN": 1699, "ATCTNA": 1700, "ATCTNG": 1701, "ATCTNT": 1702, "ATCTNC": 1703, "ATCTNN": 1704, "ATCCAA": 1705, "ATCCAG": 1706, "ATCCAT": 1707, "ATCCAC": 1708, "ATCCAN": 1709, "ATCCGA": 1710, "ATCCGG": 1711, "ATCCGT": 1712, "ATCCGC": 1713, "ATCCGN": 1714, "ATCCTA": 1715, "ATCCTG": 1716, "ATCCTT": 1717, "ATCCTC": 1718, "ATCCTN": 1719, "ATCCCA": 1720, "ATCCCG": 1721, "ATCCCT": 1722, "ATCCCC": 1723, "ATCCCN": 1724, "ATCCNA": 1725, "ATCCNG": 1726, "ATCCNT": 1727, "ATCCNC": 1728, "ATCCNN": 1729, "ATCNAA": 1730, "ATCNAG": 1731, "ATCNAT": 1732, "ATCNAC": 1733, "ATCNAN": 1734, "ATCNGA": 1735, "ATCNGG": 1736, "ATCNGT": 1737, "ATCNGC": 1738, "ATCNGN": 1739, "ATCNTA": 1740, "ATCNTG": 1741, "ATCNTT": 1742, "ATCNTC": 1743, "ATCNTN": 1744, "ATCNCA": 1745, "ATCNCG": 1746, "ATCNCT": 1747, "ATCNCC": 1748, "ATCNCN": 1749, "ATCNNA": 1750, "ATCNNG": 1751, "ATCNNT": 1752, "ATCNNC": 1753, "ATCNNN": 1754, "ATNAAA": 1755, "ATNAAG": 1756, "ATNAAT": 1757, "ATNAAC": 1758, "ATNAAN": 1759, "ATNAGA": 1760, "ATNAGG": 1761, "ATNAGT": 1762, "ATNAGC": 1763, "ATNAGN": 1764, "ATNATA": 1765, "ATNATG": 1766, "ATNATT": 1767, "ATNATC": 1768, "ATNATN": 1769, "ATNACA": 1770, "ATNACG": 1771, "ATNACT": 1772, "ATNACC": 1773, "ATNACN": 1774, "ATNANA": 1775, "ATNANG": 1776, "ATNANT": 1777, "ATNANC": 1778, "ATNANN": 1779, "ATNGAA": 1780, "ATNGAG": 1781, "ATNGAT": 1782, "ATNGAC": 1783, "ATNGAN": 1784, "ATNGGA": 1785, "ATNGGG": 1786, "ATNGGT": 1787, "ATNGGC": 1788, "ATNGGN": 1789, "ATNGTA": 1790, "ATNGTG": 1791, "ATNGTT": 1792, "ATNGTC": 1793, "ATNGTN": 1794, "ATNGCA": 1795, "ATNGCG": 1796, "ATNGCT": 1797, "ATNGCC": 1798, "ATNGCN": 1799, "ATNGNA": 1800, "ATNGNG": 1801, "ATNGNT": 1802, "ATNGNC": 1803, "ATNGNN": 1804, "ATNTAA": 1805, "ATNTAG": 1806, "ATNTAT": 1807, "ATNTAC": 1808, "ATNTAN": 1809, "ATNTGA": 1810, "ATNTGG": 1811, "ATNTGT": 1812, "ATNTGC": 1813, "ATNTGN": 1814, "ATNTTA": 1815, "ATNTTG": 1816, "ATNTTT": 1817, "ATNTTC": 1818, "ATNTTN": 1819, "ATNTCA": 1820, "ATNTCG": 1821, "ATNTCT": 1822, "ATNTCC": 1823, "ATNTCN": 1824, "ATNTNA": 1825, "ATNTNG": 1826, "ATNTNT": 1827, "ATNTNC": 1828, "ATNTNN": 1829, "ATNCAA": 1830, "ATNCAG": 1831, "ATNCAT": 1832, "ATNCAC": 1833, "ATNCAN": 1834, "ATNCGA": 1835, "ATNCGG": 1836, "ATNCGT": 1837, "ATNCGC": 1838, "ATNCGN": 1839, "ATNCTA": 1840, "ATNCTG": 1841, "ATNCTT": 1842, "ATNCTC": 1843, "ATNCTN": 1844, "ATNCCA": 1845, "ATNCCG": 1846, "ATNCCT": 1847, "ATNCCC": 1848, "ATNCCN": 1849, "ATNCNA": 1850, "ATNCNG": 1851, "ATNCNT": 1852, "ATNCNC": 1853, "ATNCNN": 1854, "ATNNAA": 1855, "ATNNAG": 1856, "ATNNAT": 1857, "ATNNAC": 1858, "ATNNAN": 1859, "ATNNGA": 1860, "ATNNGG": 1861, "ATNNGT": 1862, "ATNNGC": 1863, "ATNNGN": 1864, "ATNNTA": 1865, "ATNNTG": 1866, "ATNNTT": 1867, "ATNNTC": 1868, "ATNNTN": 1869, "ATNNCA": 1870, "ATNNCG": 1871, "ATNNCT": 1872, "ATNNCC": 1873, "ATNNCN": 1874, "ATNNNA": 1875, "ATNNNG": 1876, "ATNNNT": 1877, "ATNNNC": 1878, "ATNNNN": 1879, "ACAAAA": 1880, "ACAAAG": 1881, "ACAAAT": 1882, "ACAAAC": 1883, "ACAAAN": 1884, "ACAAGA": 1885, "ACAAGG": 1886, "ACAAGT": 1887, "ACAAGC": 1888, "ACAAGN": 1889, "ACAATA": 1890, "ACAATG": 1891, "ACAATT": 1892, "ACAATC": 1893, "ACAATN": 1894, "ACAACA": 1895, "ACAACG": 1896, "ACAACT": 1897, "ACAACC": 1898, "ACAACN": 1899, "ACAANA": 1900, "ACAANG": 1901, "ACAANT": 1902, "ACAANC": 1903, "ACAANN": 1904, "ACAGAA": 1905, "ACAGAG": 1906, "ACAGAT": 1907, "ACAGAC": 1908, "ACAGAN": 1909, "ACAGGA": 1910, "ACAGGG": 1911, "ACAGGT": 1912, "ACAGGC": 1913, "ACAGGN": 1914, "ACAGTA": 1915, "ACAGTG": 1916, "ACAGTT": 1917, "ACAGTC": 1918, "ACAGTN": 1919, "ACAGCA": 1920, "ACAGCG": 1921, "ACAGCT": 1922, "ACAGCC": 1923, "ACAGCN": 1924, "ACAGNA": 1925, "ACAGNG": 1926, "ACAGNT": 1927, "ACAGNC": 1928, "ACAGNN": 1929, "ACATAA": 1930, "ACATAG": 1931, "ACATAT": 1932, "ACATAC": 1933, "ACATAN": 1934, "ACATGA": 1935, "ACATGG": 1936, "ACATGT": 1937, "ACATGC": 1938, "ACATGN": 1939, "ACATTA": 1940, "ACATTG": 1941, "ACATTT": 1942, "ACATTC": 1943, "ACATTN": 1944, "ACATCA": 1945, "ACATCG": 1946, "ACATCT": 1947, "ACATCC": 1948, "ACATCN": 1949, "ACATNA": 1950, "ACATNG": 1951, "ACATNT": 1952, "ACATNC": 1953, "ACATNN": 1954, "ACACAA": 1955, "ACACAG": 1956, "ACACAT": 1957, "ACACAC": 1958, "ACACAN": 1959, "ACACGA": 1960, "ACACGG": 1961, "ACACGT": 1962, "ACACGC": 1963, "ACACGN": 1964, "ACACTA": 1965, "ACACTG": 1966, "ACACTT": 1967, "ACACTC": 1968, "ACACTN": 1969, "ACACCA": 1970, "ACACCG": 1971, "ACACCT": 1972, "ACACCC": 1973, "ACACCN": 1974, "ACACNA": 1975, "ACACNG": 1976, "ACACNT": 1977, "ACACNC": 1978, "ACACNN": 1979, "ACANAA": 1980, "ACANAG": 1981, "ACANAT": 1982, "ACANAC": 1983, "ACANAN": 1984, "ACANGA": 1985, "ACANGG": 1986, "ACANGT": 1987, "ACANGC": 1988, "ACANGN": 1989, "ACANTA": 1990, "ACANTG": 1991, "ACANTT": 1992, "ACANTC": 1993, "ACANTN": 1994, "ACANCA": 1995, "ACANCG": 1996, "ACANCT": 1997, "ACANCC": 1998, "ACANCN": 1999, "ACANNA": 2000, "ACANNG": 2001, "ACANNT": 2002, "ACANNC": 2003, "ACANNN": 2004, "ACGAAA": 2005, "ACGAAG": 2006, "ACGAAT": 2007, "ACGAAC": 2008, "ACGAAN": 2009, "ACGAGA": 2010, "ACGAGG": 2011, "ACGAGT": 2012, "ACGAGC": 2013, "ACGAGN": 2014, "ACGATA": 2015, "ACGATG": 2016, "ACGATT": 2017, "ACGATC": 2018, "ACGATN": 2019, "ACGACA": 2020, "ACGACG": 2021, "ACGACT": 2022, "ACGACC": 2023, "ACGACN": 2024, "ACGANA": 2025, "ACGANG": 2026, "ACGANT": 2027, "ACGANC": 2028, "ACGANN": 2029, "ACGGAA": 2030, "ACGGAG": 2031, "ACGGAT": 2032, "ACGGAC": 2033, "ACGGAN": 2034, "ACGGGA": 2035, "ACGGGG": 2036, "ACGGGT": 2037, "ACGGGC": 2038, "ACGGGN": 2039, "ACGGTA": 2040, "ACGGTG": 2041, "ACGGTT": 2042, "ACGGTC": 2043, "ACGGTN": 2044, "ACGGCA": 2045, "ACGGCG": 2046, "ACGGCT": 2047, "ACGGCC": 2048, "ACGGCN": 2049, "ACGGNA": 2050, "ACGGNG": 2051, "ACGGNT": 2052, "ACGGNC": 2053, "ACGGNN": 2054, "ACGTAA": 2055, "ACGTAG": 2056, "ACGTAT": 2057, "ACGTAC": 2058, "ACGTAN": 2059, "ACGTGA": 2060, "ACGTGG": 2061, "ACGTGT": 2062, "ACGTGC": 2063, "ACGTGN": 2064, "ACGTTA": 2065, "ACGTTG": 2066, "ACGTTT": 2067, "ACGTTC": 2068, "ACGTTN": 2069, "ACGTCA": 2070, "ACGTCG": 2071, "ACGTCT": 2072, "ACGTCC": 2073, "ACGTCN": 2074, "ACGTNA": 2075, "ACGTNG": 2076, "ACGTNT": 2077, "ACGTNC": 2078, "ACGTNN": 2079, "ACGCAA": 2080, "ACGCAG": 2081, "ACGCAT": 2082, "ACGCAC": 2083, "ACGCAN": 2084, "ACGCGA": 2085, "ACGCGG": 2086, "ACGCGT": 2087, "ACGCGC": 2088, "ACGCGN": 2089, "ACGCTA": 2090, "ACGCTG": 2091, "ACGCTT": 2092, "ACGCTC": 2093, "ACGCTN": 2094, "ACGCCA": 2095, "ACGCCG": 2096, "ACGCCT": 2097, "ACGCCC": 2098, "ACGCCN": 2099, "ACGCNA": 2100, "ACGCNG": 2101, "ACGCNT": 2102, "ACGCNC": 2103, "ACGCNN": 2104, "ACGNAA": 2105, "ACGNAG": 2106, "ACGNAT": 2107, "ACGNAC": 2108, "ACGNAN": 2109, "ACGNGA": 2110, "ACGNGG": 2111, "ACGNGT": 2112, "ACGNGC": 2113, "ACGNGN": 2114, "ACGNTA": 2115, "ACGNTG": 2116, "ACGNTT": 2117, "ACGNTC": 2118, "ACGNTN": 2119, "ACGNCA": 2120, "ACGNCG": 2121, "ACGNCT": 2122, "ACGNCC": 2123, "ACGNCN": 2124, "ACGNNA": 2125, "ACGNNG": 2126, "ACGNNT": 2127, "ACGNNC": 2128, "ACGNNN": 2129, "ACTAAA": 2130, "ACTAAG": 2131, "ACTAAT": 2132, "ACTAAC": 2133, "ACTAAN": 2134, "ACTAGA": 2135, "ACTAGG": 2136, "ACTAGT": 2137, "ACTAGC": 2138, "ACTAGN": 2139, "ACTATA": 2140, "ACTATG": 2141, "ACTATT": 2142, "ACTATC": 2143, "ACTATN": 2144, "ACTACA": 2145, "ACTACG": 2146, "ACTACT": 2147, "ACTACC": 2148, "ACTACN": 2149, "ACTANA": 2150, "ACTANG": 2151, "ACTANT": 2152, "ACTANC": 2153, "ACTANN": 2154, "ACTGAA": 2155, "ACTGAG": 2156, "ACTGAT": 2157, "ACTGAC": 2158, "ACTGAN": 2159, "ACTGGA": 2160, "ACTGGG": 2161, "ACTGGT": 2162, "ACTGGC": 2163, "ACTGGN": 2164, "ACTGTA": 2165, "ACTGTG": 2166, "ACTGTT": 2167, "ACTGTC": 2168, "ACTGTN": 2169, "ACTGCA": 2170, "ACTGCG": 2171, "ACTGCT": 2172, "ACTGCC": 2173, "ACTGCN": 2174, "ACTGNA": 2175, "ACTGNG": 2176, "ACTGNT": 2177, "ACTGNC": 2178, "ACTGNN": 2179, "ACTTAA": 2180, "ACTTAG": 2181, "ACTTAT": 2182, "ACTTAC": 2183, "ACTTAN": 2184, "ACTTGA": 2185, "ACTTGG": 2186, "ACTTGT": 2187, "ACTTGC": 2188, "ACTTGN": 2189, "ACTTTA": 2190, "ACTTTG": 2191, "ACTTTT": 2192, "ACTTTC": 2193, "ACTTTN": 2194, "ACTTCA": 2195, "ACTTCG": 2196, "ACTTCT": 2197, "ACTTCC": 2198, "ACTTCN": 2199, "ACTTNA": 2200, "ACTTNG": 2201, "ACTTNT": 2202, "ACTTNC": 2203, "ACTTNN": 2204, "ACTCAA": 2205, "ACTCAG": 2206, "ACTCAT": 2207, "ACTCAC": 2208, "ACTCAN": 2209, "ACTCGA": 2210, "ACTCGG": 2211, "ACTCGT": 2212, "ACTCGC": 2213, "ACTCGN": 2214, "ACTCTA": 2215, "ACTCTG": 2216, "ACTCTT": 2217, "ACTCTC": 2218, "ACTCTN": 2219, "ACTCCA": 2220, "ACTCCG": 2221, "ACTCCT": 2222, "ACTCCC": 2223, "ACTCCN": 2224, "ACTCNA": 2225, "ACTCNG": 2226, "ACTCNT": 2227, "ACTCNC": 2228, "ACTCNN": 2229, "ACTNAA": 2230, "ACTNAG": 2231, "ACTNAT": 2232, "ACTNAC": 2233, "ACTNAN": 2234, "ACTNGA": 2235, "ACTNGG": 2236, "ACTNGT": 2237, "ACTNGC": 2238, "ACTNGN": 2239, "ACTNTA": 2240, "ACTNTG": 2241, "ACTNTT": 2242, "ACTNTC": 2243, "ACTNTN": 2244, "ACTNCA": 2245, "ACTNCG": 2246, "ACTNCT": 2247, "ACTNCC": 2248, "ACTNCN": 2249, "ACTNNA": 2250, "ACTNNG": 2251, "ACTNNT": 2252, "ACTNNC": 2253, "ACTNNN": 2254, "ACCAAA": 2255, "ACCAAG": 2256, "ACCAAT": 2257, "ACCAAC": 2258, "ACCAAN": 2259, "ACCAGA": 2260, "ACCAGG": 2261, "ACCAGT": 2262, "ACCAGC": 2263, "ACCAGN": 2264, "ACCATA": 2265, "ACCATG": 2266, "ACCATT": 2267, "ACCATC": 2268, "ACCATN": 2269, "ACCACA": 2270, "ACCACG": 2271, "ACCACT": 2272, "ACCACC": 2273, "ACCACN": 2274, "ACCANA": 2275, "ACCANG": 2276, "ACCANT": 2277, "ACCANC": 2278, "ACCANN": 2279, "ACCGAA": 2280, "ACCGAG": 2281, "ACCGAT": 2282, "ACCGAC": 2283, "ACCGAN": 2284, "ACCGGA": 2285, "ACCGGG": 2286, "ACCGGT": 2287, "ACCGGC": 2288, "ACCGGN": 2289, "ACCGTA": 2290, "ACCGTG": 2291, "ACCGTT": 2292, "ACCGTC": 2293, "ACCGTN": 2294, "ACCGCA": 2295, "ACCGCG": 2296, "ACCGCT": 2297, "ACCGCC": 2298, "ACCGCN": 2299, "ACCGNA": 2300, "ACCGNG": 2301, "ACCGNT": 2302, "ACCGNC": 2303, "ACCGNN": 2304, "ACCTAA": 2305, "ACCTAG": 2306, "ACCTAT": 2307, "ACCTAC": 2308, "ACCTAN": 2309, "ACCTGA": 2310, "ACCTGG": 2311, "ACCTGT": 2312, "ACCTGC": 2313, "ACCTGN": 2314, "ACCTTA": 2315, "ACCTTG": 2316, "ACCTTT": 2317, "ACCTTC": 2318, "ACCTTN": 2319, "ACCTCA": 2320, "ACCTCG": 2321, "ACCTCT": 2322, "ACCTCC": 2323, "ACCTCN": 2324, "ACCTNA": 2325, "ACCTNG": 2326, "ACCTNT": 2327, "ACCTNC": 2328, "ACCTNN": 2329, "ACCCAA": 2330, "ACCCAG": 2331, "ACCCAT": 2332, "ACCCAC": 2333, "ACCCAN": 2334, "ACCCGA": 2335, "ACCCGG": 2336, "ACCCGT": 2337, "ACCCGC": 2338, "ACCCGN": 2339, "ACCCTA": 2340, "ACCCTG": 2341, "ACCCTT": 2342, "ACCCTC": 2343, "ACCCTN": 2344, "ACCCCA": 2345, "ACCCCG": 2346, "ACCCCT": 2347, "ACCCCC": 2348, "ACCCCN": 2349, "ACCCNA": 2350, "ACCCNG": 2351, "ACCCNT": 2352, "ACCCNC": 2353, "ACCCNN": 2354, "ACCNAA": 2355, "ACCNAG": 2356, "ACCNAT": 2357, "ACCNAC": 2358, "ACCNAN": 2359, "ACCNGA": 2360, "ACCNGG": 2361, "ACCNGT": 2362, "ACCNGC": 2363, "ACCNGN": 2364, "ACCNTA": 2365, "ACCNTG": 2366, "ACCNTT": 2367, "ACCNTC": 2368, "ACCNTN": 2369, "ACCNCA": 2370, "ACCNCG": 2371, "ACCNCT": 2372, "ACCNCC": 2373, "ACCNCN": 2374, "ACCNNA": 2375, "ACCNNG": 2376, "ACCNNT": 2377, "ACCNNC": 2378, "ACCNNN": 2379, "ACNAAA": 2380, "ACNAAG": 2381, "ACNAAT": 2382, "ACNAAC": 2383, "ACNAAN": 2384, "ACNAGA": 2385, "ACNAGG": 2386, "ACNAGT": 2387, "ACNAGC": 2388, "ACNAGN": 2389, "ACNATA": 2390, "ACNATG": 2391, "ACNATT": 2392, "ACNATC": 2393, "ACNATN": 2394, "ACNACA": 2395, "ACNACG": 2396, "ACNACT": 2397, "ACNACC": 2398, "ACNACN": 2399, "ACNANA": 2400, "ACNANG": 2401, "ACNANT": 2402, "ACNANC": 2403, "ACNANN": 2404, "ACNGAA": 2405, "ACNGAG": 2406, "ACNGAT": 2407, "ACNGAC": 2408, "ACNGAN": 2409, "ACNGGA": 2410, "ACNGGG": 2411, "ACNGGT": 2412, "ACNGGC": 2413, "ACNGGN": 2414, "ACNGTA": 2415, "ACNGTG": 2416, "ACNGTT": 2417, "ACNGTC": 2418, "ACNGTN": 2419, "ACNGCA": 2420, "ACNGCG": 2421, "ACNGCT": 2422, "ACNGCC": 2423, "ACNGCN": 2424, "ACNGNA": 2425, "ACNGNG": 2426, "ACNGNT": 2427, "ACNGNC": 2428, "ACNGNN": 2429, "ACNTAA": 2430, "ACNTAG": 2431, "ACNTAT": 2432, "ACNTAC": 2433, "ACNTAN": 2434, "ACNTGA": 2435, "ACNTGG": 2436, "ACNTGT": 2437, "ACNTGC": 2438, "ACNTGN": 2439, "ACNTTA": 2440, "ACNTTG": 2441, "ACNTTT": 2442, "ACNTTC": 2443, "ACNTTN": 2444, "ACNTCA": 2445, "ACNTCG": 2446, "ACNTCT": 2447, "ACNTCC": 2448, "ACNTCN": 2449, "ACNTNA": 2450, "ACNTNG": 2451, "ACNTNT": 2452, "ACNTNC": 2453, "ACNTNN": 2454, "ACNCAA": 2455, "ACNCAG": 2456, "ACNCAT": 2457, "ACNCAC": 2458, "ACNCAN": 2459, "ACNCGA": 2460, "ACNCGG": 2461, "ACNCGT": 2462, "ACNCGC": 2463, "ACNCGN": 2464, "ACNCTA": 2465, "ACNCTG": 2466, "ACNCTT": 2467, "ACNCTC": 2468, "ACNCTN": 2469, "ACNCCA": 2470, "ACNCCG": 2471, "ACNCCT": 2472, "ACNCCC": 2473, "ACNCCN": 2474, "ACNCNA": 2475, "ACNCNG": 2476, "ACNCNT": 2477, "ACNCNC": 2478, "ACNCNN": 2479, "ACNNAA": 2480, "ACNNAG": 2481, "ACNNAT": 2482, "ACNNAC": 2483, "ACNNAN": 2484, "ACNNGA": 2485, "ACNNGG": 2486, "ACNNGT": 2487, "ACNNGC": 2488, "ACNNGN": 2489, "ACNNTA": 2490, "ACNNTG": 2491, "ACNNTT": 2492, "ACNNTC": 2493, "ACNNTN": 2494, "ACNNCA": 2495, "ACNNCG": 2496, "ACNNCT": 2497, "ACNNCC": 2498, "ACNNCN": 2499, "ACNNNA": 2500, "ACNNNG": 2501, "ACNNNT": 2502, "ACNNNC": 2503, "ACNNNN": 2504, "ANAAAA": 2505, "ANAAAG": 2506, "ANAAAT": 2507, "ANAAAC": 2508, "ANAAAN": 2509, "ANAAGA": 2510, "ANAAGG": 2511, "ANAAGT": 2512, "ANAAGC": 2513, "ANAAGN": 2514, "ANAATA": 2515, "ANAATG": 2516, "ANAATT": 2517, "ANAATC": 2518, "ANAATN": 2519, "ANAACA": 2520, "ANAACG": 2521, "ANAACT": 2522, "ANAACC": 2523, "ANAACN": 2524, "ANAANA": 2525, "ANAANG": 2526, "ANAANT": 2527, "ANAANC": 2528, "ANAANN": 2529, "ANAGAA": 2530, "ANAGAG": 2531, "ANAGAT": 2532, "ANAGAC": 2533, "ANAGAN": 2534, "ANAGGA": 2535, "ANAGGG": 2536, "ANAGGT": 2537, "ANAGGC": 2538, "ANAGGN": 2539, "ANAGTA": 2540, "ANAGTG": 2541, "ANAGTT": 2542, "ANAGTC": 2543, "ANAGTN": 2544, "ANAGCA": 2545, "ANAGCG": 2546, "ANAGCT": 2547, "ANAGCC": 2548, "ANAGCN": 2549, "ANAGNA": 2550, "ANAGNG": 2551, "ANAGNT": 2552, "ANAGNC": 2553, "ANAGNN": 2554, "ANATAA": 2555, "ANATAG": 2556, "ANATAT": 2557, "ANATAC": 2558, "ANATAN": 2559, "ANATGA": 2560, "ANATGG": 2561, "ANATGT": 2562, "ANATGC": 2563, "ANATGN": 2564, "ANATTA": 2565, "ANATTG": 2566, "ANATTT": 2567, "ANATTC": 2568, "ANATTN": 2569, "ANATCA": 2570, "ANATCG": 2571, "ANATCT": 2572, "ANATCC": 2573, "ANATCN": 2574, "ANATNA": 2575, "ANATNG": 2576, "ANATNT": 2577, "ANATNC": 2578, "ANATNN": 2579, "ANACAA": 2580, "ANACAG": 2581, "ANACAT": 2582, "ANACAC": 2583, "ANACAN": 2584, "ANACGA": 2585, "ANACGG": 2586, "ANACGT": 2587, "ANACGC": 2588, "ANACGN": 2589, "ANACTA": 2590, "ANACTG": 2591, "ANACTT": 2592, "ANACTC": 2593, "ANACTN": 2594, "ANACCA": 2595, "ANACCG": 2596, "ANACCT": 2597, "ANACCC": 2598, "ANACCN": 2599, "ANACNA": 2600, "ANACNG": 2601, "ANACNT": 2602, "ANACNC": 2603, "ANACNN": 2604, "ANANAA": 2605, "ANANAG": 2606, "ANANAT": 2607, "ANANAC": 2608, "ANANAN": 2609, "ANANGA": 2610, "ANANGG": 2611, "ANANGT": 2612, "ANANGC": 2613, "ANANGN": 2614, "ANANTA": 2615, "ANANTG": 2616, "ANANTT": 2617, "ANANTC": 2618, "ANANTN": 2619, "ANANCA": 2620, "ANANCG": 2621, "ANANCT": 2622, "ANANCC": 2623, "ANANCN": 2624, "ANANNA": 2625, "ANANNG": 2626, "ANANNT": 2627, "ANANNC": 2628, "ANANNN": 2629, "ANGAAA": 2630, "ANGAAG": 2631, "ANGAAT": 2632, "ANGAAC": 2633, "ANGAAN": 2634, "ANGAGA": 2635, "ANGAGG": 2636, "ANGAGT": 2637, "ANGAGC": 2638, "ANGAGN": 2639, "ANGATA": 2640, "ANGATG": 2641, "ANGATT": 2642, "ANGATC": 2643, "ANGATN": 2644, "ANGACA": 2645, "ANGACG": 2646, "ANGACT": 2647, "ANGACC": 2648, "ANGACN": 2649, "ANGANA": 2650, "ANGANG": 2651, "ANGANT": 2652, "ANGANC": 2653, "ANGANN": 2654, "ANGGAA": 2655, "ANGGAG": 2656, "ANGGAT": 2657, "ANGGAC": 2658, "ANGGAN": 2659, "ANGGGA": 2660, "ANGGGG": 2661, "ANGGGT": 2662, "ANGGGC": 2663, "ANGGGN": 2664, "ANGGTA": 2665, "ANGGTG": 2666, "ANGGTT": 2667, "ANGGTC": 2668, "ANGGTN": 2669, "ANGGCA": 2670, "ANGGCG": 2671, "ANGGCT": 2672, "ANGGCC": 2673, "ANGGCN": 2674, "ANGGNA": 2675, "ANGGNG": 2676, "ANGGNT": 2677, "ANGGNC": 2678, "ANGGNN": 2679, "ANGTAA": 2680, "ANGTAG": 2681, "ANGTAT": 2682, "ANGTAC": 2683, "ANGTAN": 2684, "ANGTGA": 2685, "ANGTGG": 2686, "ANGTGT": 2687, "ANGTGC": 2688, "ANGTGN": 2689, "ANGTTA": 2690, "ANGTTG": 2691, "ANGTTT": 2692, "ANGTTC": 2693, "ANGTTN": 2694, "ANGTCA": 2695, "ANGTCG": 2696, "ANGTCT": 2697, "ANGTCC": 2698, "ANGTCN": 2699, "ANGTNA": 2700, "ANGTNG": 2701, "ANGTNT": 2702, "ANGTNC": 2703, "ANGTNN": 2704, "ANGCAA": 2705, "ANGCAG": 2706, "ANGCAT": 2707, "ANGCAC": 2708, "ANGCAN": 2709, "ANGCGA": 2710, "ANGCGG": 2711, "ANGCGT": 2712, "ANGCGC": 2713, "ANGCGN": 2714, "ANGCTA": 2715, "ANGCTG": 2716, "ANGCTT": 2717, "ANGCTC": 2718, "ANGCTN": 2719, "ANGCCA": 2720, "ANGCCG": 2721, "ANGCCT": 2722, "ANGCCC": 2723, "ANGCCN": 2724, "ANGCNA": 2725, "ANGCNG": 2726, "ANGCNT": 2727, "ANGCNC": 2728, "ANGCNN": 2729, "ANGNAA": 2730, "ANGNAG": 2731, "ANGNAT": 2732, "ANGNAC": 2733, "ANGNAN": 2734, "ANGNGA": 2735, "ANGNGG": 2736, "ANGNGT": 2737, "ANGNGC": 2738, "ANGNGN": 2739, "ANGNTA": 2740, "ANGNTG": 2741, "ANGNTT": 2742, "ANGNTC": 2743, "ANGNTN": 2744, "ANGNCA": 2745, "ANGNCG": 2746, "ANGNCT": 2747, "ANGNCC": 2748, "ANGNCN": 2749, "ANGNNA": 2750, "ANGNNG": 2751, "ANGNNT": 2752, "ANGNNC": 2753, "ANGNNN": 2754, "ANTAAA": 2755, "ANTAAG": 2756, "ANTAAT": 2757, "ANTAAC": 2758, "ANTAAN": 2759, "ANTAGA": 2760, "ANTAGG": 2761, "ANTAGT": 2762, "ANTAGC": 2763, "ANTAGN": 2764, "ANTATA": 2765, "ANTATG": 2766, "ANTATT": 2767, "ANTATC": 2768, "ANTATN": 2769, "ANTACA": 2770, "ANTACG": 2771, "ANTACT": 2772, "ANTACC": 2773, "ANTACN": 2774, "ANTANA": 2775, "ANTANG": 2776, "ANTANT": 2777, "ANTANC": 2778, "ANTANN": 2779, "ANTGAA": 2780, "ANTGAG": 2781, "ANTGAT": 2782, "ANTGAC": 2783, "ANTGAN": 2784, "ANTGGA": 2785, "ANTGGG": 2786, "ANTGGT": 2787, "ANTGGC": 2788, "ANTGGN": 2789, "ANTGTA": 2790, "ANTGTG": 2791, "ANTGTT": 2792, "ANTGTC": 2793, "ANTGTN": 2794, "ANTGCA": 2795, "ANTGCG": 2796, "ANTGCT": 2797, "ANTGCC": 2798, "ANTGCN": 2799, "ANTGNA": 2800, "ANTGNG": 2801, "ANTGNT": 2802, "ANTGNC": 2803, "ANTGNN": 2804, "ANTTAA": 2805, "ANTTAG": 2806, "ANTTAT": 2807, "ANTTAC": 2808, "ANTTAN": 2809, "ANTTGA": 2810, "ANTTGG": 2811, "ANTTGT": 2812, "ANTTGC": 2813, "ANTTGN": 2814, "ANTTTA": 2815, "ANTTTG": 2816, "ANTTTT": 2817, "ANTTTC": 2818, "ANTTTN": 2819, "ANTTCA": 2820, "ANTTCG": 2821, "ANTTCT": 2822, "ANTTCC": 2823, "ANTTCN": 2824, "ANTTNA": 2825, "ANTTNG": 2826, "ANTTNT": 2827, "ANTTNC": 2828, "ANTTNN": 2829, "ANTCAA": 2830, "ANTCAG": 2831, "ANTCAT": 2832, "ANTCAC": 2833, "ANTCAN": 2834, "ANTCGA": 2835, "ANTCGG": 2836, "ANTCGT": 2837, "ANTCGC": 2838, "ANTCGN": 2839, "ANTCTA": 2840, "ANTCTG": 2841, "ANTCTT": 2842, "ANTCTC": 2843, "ANTCTN": 2844, "ANTCCA": 2845, "ANTCCG": 2846, "ANTCCT": 2847, "ANTCCC": 2848, "ANTCCN": 2849, "ANTCNA": 2850, "ANTCNG": 2851, "ANTCNT": 2852, "ANTCNC": 2853, "ANTCNN": 2854, "ANTNAA": 2855, "ANTNAG": 2856, "ANTNAT": 2857, "ANTNAC": 2858, "ANTNAN": 2859, "ANTNGA": 2860, "ANTNGG": 2861, "ANTNGT": 2862, "ANTNGC": 2863, "ANTNGN": 2864, "ANTNTA": 2865, "ANTNTG": 2866, "ANTNTT": 2867, "ANTNTC": 2868, "ANTNTN": 2869, "ANTNCA": 2870, "ANTNCG": 2871, "ANTNCT": 2872, "ANTNCC": 2873, "ANTNCN": 2874, "ANTNNA": 2875, "ANTNNG": 2876, "ANTNNT": 2877, "ANTNNC": 2878, "ANTNNN": 2879, "ANCAAA": 2880, "ANCAAG": 2881, "ANCAAT": 2882, "ANCAAC": 2883, "ANCAAN": 2884, "ANCAGA": 2885, "ANCAGG": 2886, "ANCAGT": 2887, "ANCAGC": 2888, "ANCAGN": 2889, "ANCATA": 2890, "ANCATG": 2891, "ANCATT": 2892, "ANCATC": 2893, "ANCATN": 2894, "ANCACA": 2895, "ANCACG": 2896, "ANCACT": 2897, "ANCACC": 2898, "ANCACN": 2899, "ANCANA": 2900, "ANCANG": 2901, "ANCANT": 2902, "ANCANC": 2903, "ANCANN": 2904, "ANCGAA": 2905, "ANCGAG": 2906, "ANCGAT": 2907, "ANCGAC": 2908, "ANCGAN": 2909, "ANCGGA": 2910, "ANCGGG": 2911, "ANCGGT": 2912, "ANCGGC": 2913, "ANCGGN": 2914, "ANCGTA": 2915, "ANCGTG": 2916, "ANCGTT": 2917, "ANCGTC": 2918, "ANCGTN": 2919, "ANCGCA": 2920, "ANCGCG": 2921, "ANCGCT": 2922, "ANCGCC": 2923, "ANCGCN": 2924, "ANCGNA": 2925, "ANCGNG": 2926, "ANCGNT": 2927, "ANCGNC": 2928, "ANCGNN": 2929, "ANCTAA": 2930, "ANCTAG": 2931, "ANCTAT": 2932, "ANCTAC": 2933, "ANCTAN": 2934, "ANCTGA": 2935, "ANCTGG": 2936, "ANCTGT": 2937, "ANCTGC": 2938, "ANCTGN": 2939, "ANCTTA": 2940, "ANCTTG": 2941, "ANCTTT": 2942, "ANCTTC": 2943, "ANCTTN": 2944, "ANCTCA": 2945, "ANCTCG": 2946, "ANCTCT": 2947, "ANCTCC": 2948, "ANCTCN": 2949, "ANCTNA": 2950, "ANCTNG": 2951, "ANCTNT": 2952, "ANCTNC": 2953, "ANCTNN": 2954, "ANCCAA": 2955, "ANCCAG": 2956, "ANCCAT": 2957, "ANCCAC": 2958, "ANCCAN": 2959, "ANCCGA": 2960, "ANCCGG": 2961, "ANCCGT": 2962, "ANCCGC": 2963, "ANCCGN": 2964, "ANCCTA": 2965, "ANCCTG": 2966, "ANCCTT": 2967, "ANCCTC": 2968, "ANCCTN": 2969, "ANCCCA": 2970, "ANCCCG": 2971, "ANCCCT": 2972, "ANCCCC": 2973, "ANCCCN": 2974, "ANCCNA": 2975, "ANCCNG": 2976, "ANCCNT": 2977, "ANCCNC": 2978, "ANCCNN": 2979, "ANCNAA": 2980, "ANCNAG": 2981, "ANCNAT": 2982, "ANCNAC": 2983, "ANCNAN": 2984, "ANCNGA": 2985, "ANCNGG": 2986, "ANCNGT": 2987, "ANCNGC": 2988, "ANCNGN": 2989, "ANCNTA": 2990, "ANCNTG": 2991, "ANCNTT": 2992, "ANCNTC": 2993, "ANCNTN": 2994, "ANCNCA": 2995, "ANCNCG": 2996, "ANCNCT": 2997, "ANCNCC": 2998, "ANCNCN": 2999, "ANCNNA": 3000, "ANCNNG": 3001, "ANCNNT": 3002, "ANCNNC": 3003, "ANCNNN": 3004, "ANNAAA": 3005, "ANNAAG": 3006, "ANNAAT": 3007, "ANNAAC": 3008, "ANNAAN": 3009, "ANNAGA": 3010, "ANNAGG": 3011, "ANNAGT": 3012, "ANNAGC": 3013, "ANNAGN": 3014, "ANNATA": 3015, "ANNATG": 3016, "ANNATT": 3017, "ANNATC": 3018, "ANNATN": 3019, "ANNACA": 3020, "ANNACG": 3021, "ANNACT": 3022, "ANNACC": 3023, "ANNACN": 3024, "ANNANA": 3025, "ANNANG": 3026, "ANNANT": 3027, "ANNANC": 3028, "ANNANN": 3029, "ANNGAA": 3030, "ANNGAG": 3031, "ANNGAT": 3032, "ANNGAC": 3033, "ANNGAN": 3034, "ANNGGA": 3035, "ANNGGG": 3036, "ANNGGT": 3037, "ANNGGC": 3038, "ANNGGN": 3039, "ANNGTA": 3040, "ANNGTG": 3041, "ANNGTT": 3042, "ANNGTC": 3043, "ANNGTN": 3044, "ANNGCA": 3045, "ANNGCG": 3046, "ANNGCT": 3047, "ANNGCC": 3048, "ANNGCN": 3049, "ANNGNA": 3050, "ANNGNG": 3051, "ANNGNT": 3052, "ANNGNC": 3053, "ANNGNN": 3054, "ANNTAA": 3055, "ANNTAG": 3056, "ANNTAT": 3057, "ANNTAC": 3058, "ANNTAN": 3059, "ANNTGA": 3060, "ANNTGG": 3061, "ANNTGT": 3062, "ANNTGC": 3063, "ANNTGN": 3064, "ANNTTA": 3065, "ANNTTG": 3066, "ANNTTT": 3067, "ANNTTC": 3068, "ANNTTN": 3069, "ANNTCA": 3070, "ANNTCG": 3071, "ANNTCT": 3072, "ANNTCC": 3073, "ANNTCN": 3074, "ANNTNA": 3075, "ANNTNG": 3076, "ANNTNT": 3077, "ANNTNC": 3078, "ANNTNN": 3079, "ANNCAA": 3080, "ANNCAG": 3081, "ANNCAT": 3082, "ANNCAC": 3083, "ANNCAN": 3084, "ANNCGA": 3085, "ANNCGG": 3086, "ANNCGT": 3087, "ANNCGC": 3088, "ANNCGN": 3089, "ANNCTA": 3090, "ANNCTG": 3091, "ANNCTT": 3092, "ANNCTC": 3093, "ANNCTN": 3094, "ANNCCA": 3095, "ANNCCG": 3096, "ANNCCT": 3097, "ANNCCC": 3098, "ANNCCN": 3099, "ANNCNA": 3100, "ANNCNG": 3101, "ANNCNT": 3102, "ANNCNC": 3103, "ANNCNN": 3104, "ANNNAA": 3105, "ANNNAG": 3106, "ANNNAT": 3107, "ANNNAC": 3108, "ANNNAN": 3109, "ANNNGA": 3110, "ANNNGG": 3111, "ANNNGT": 3112, "ANNNGC": 3113, "ANNNGN": 3114, "ANNNTA": 3115, "ANNNTG": 3116, "ANNNTT": 3117, "ANNNTC": 3118, "ANNNTN": 3119, "ANNNCA": 3120, "ANNNCG": 3121, "ANNNCT": 3122, "ANNNCC": 3123, "ANNNCN": 3124, "ANNNNA": 3125, "ANNNNG": 3126, "ANNNNT": 3127, "ANNNNC": 3128, "ANNNNN": 3129, "GAAAAA": 3130, "GAAAAG": 3131, "GAAAAT": 3132, "GAAAAC": 3133, "GAAAAN": 3134, "GAAAGA": 3135, "GAAAGG": 3136, "GAAAGT": 3137, "GAAAGC": 3138, "GAAAGN": 3139, "GAAATA": 3140, "GAAATG": 3141, "GAAATT": 3142, "GAAATC": 3143, "GAAATN": 3144, "GAAACA": 3145, "GAAACG": 3146, "GAAACT": 3147, "GAAACC": 3148, "GAAACN": 3149, "GAAANA": 3150, "GAAANG": 3151, "GAAANT": 3152, "GAAANC": 3153, "GAAANN": 3154, "GAAGAA": 3155, "GAAGAG": 3156, "GAAGAT": 3157, "GAAGAC": 3158, "GAAGAN": 3159, "GAAGGA": 3160, "GAAGGG": 3161, "GAAGGT": 3162, "GAAGGC": 3163, "GAAGGN": 3164, "GAAGTA": 3165, "GAAGTG": 3166, "GAAGTT": 3167, "GAAGTC": 3168, "GAAGTN": 3169, "GAAGCA": 3170, "GAAGCG": 3171, "GAAGCT": 3172, "GAAGCC": 3173, "GAAGCN": 3174, "GAAGNA": 3175, "GAAGNG": 3176, "GAAGNT": 3177, "GAAGNC": 3178, "GAAGNN": 3179, "GAATAA": 3180, "GAATAG": 3181, "GAATAT": 3182, "GAATAC": 3183, "GAATAN": 3184, "GAATGA": 3185, "GAATGG": 3186, "GAATGT": 3187, "GAATGC": 3188, "GAATGN": 3189, "GAATTA": 3190, "GAATTG": 3191, "GAATTT": 3192, "GAATTC": 3193, "GAATTN": 